{
  "ec68fe4c-97c5-4d63-9b20-c766e8571960": {
    "pk": "ec68fe4c-97c5-4d63-9b20-c766e8571960",
    "project_name": null,
    "name": "Jiaxuan You",
    "bio": " I am a researcher in the field of graph neural networks (GNNs) and machine learning. My work focuses on developing new classes of GNNs and understanding the relationship between the graph structure of neural networks and their predictive performance.\n\nIn my research on GNNs, I have proposed Position-aware Graph Neural Networks (P-GNNs), a new class of GNNs for computing position-aware node embeddings. P-GNNs sample sets of anchor nodes and learn a non-linear distance-weighted aggregation scheme over the anchor-sets, allowing them to capture the positions/locations of nodes with respect to the anchor nodes. I have shown that P-GNNs consistently outperform state-of-the-art GNNs on multiple prediction tasks, including link prediction and community detection.\n\nIn addition to my work on GNNs, I have also investigated how the graph structure of neural networks affects their predictive performance. I have developed a novel graph-based representation of neural networks called a relational graph, where layers of neural network computation correspond to rounds of message exchange along the graph structure. Using this representation, I have shown that a \"sweet spot\" of relational graphs leads to neural networks with significantly improved predictive performance, and that neural network performance is approximately a smooth function of the clustering coefficient and average path length of its relational graph.\n\nI am also interested in developing GNNs with greater expressive power than the 1-Weisfeiler-Lehman (1-WL) graph isomorphism test. To this end, I have developed a class of message passing GNNs, named Identity-aware Graph Neural Networks (ID-GNNs), which consider nodes' identities during message passing. ID-GNNs have been shown to improve the performance of existing GNN architectures on challenging node, edge, and graph property prediction tasks, as well as on node and graph classification benchmarks and real-world link prediction tasks.\n\nI am also interested in the application of GNNs to dynamic graphs, and have proposed ROLAND, an effective graph representation learning framework for real-world dynamic graphs. ROLAND can help researchers easily repurpose any static GNN to dynamic graphs, and features a live-update evaluation setting for dynamic graphs that mimics real-world use cases. I have conducted experiments over eight different dynamic graph datasets on future link prediction tasks",
    "collaborators": [
      "Jure Leskovec",
      "Rex Ying",
      "Kaidi Cao",
      "Kaiming He",
      "Saining Xie",
      "Jonathan Gomes-Selman",
      "Tianyu Du",
      "Shirley Wu",
      "Jiaju Liu"
    ],
    "institute": null,
    "embed": null,
    "is_proj_leader_candidate": false,
    "is_proj_participant_candidate": true,
    "is_reviewer_candidate": false,
    "is_chair_candidate": false
  },
  "541a3f6f-5aa5-4a42-a20e-22f6a48102cd": {
    "pk": "541a3f6f-5aa5-4a42-a20e-22f6a48102cd",
    "project_name": null,
    "name": "Jure Leskovec",
    "bio": " I am a researcher with a strong background in network analysis, machine learning, and data mining. I have worked on various projects involving large-scale network data, such as social and information networks, and have developed models to understand and explain the emergence of patterns in these networks.\n\nOne of my notable contributions is the development of the Multiplicative Attribute Graph (MAG) model, which captures the interactions between network structure and node attributes. This model allows for mathematical analysis and provides insights into the connectivity and emergence of the giant connected component in networks.\n\nI have also worked on the Latent Multi-group Membership Graph (LMMG) model, which models the occurrence of links and node feature structure in networks. This model can be used for summarizing network structure, predicting links between nodes, and predicting missing features of a node.\n\nIn addition, I have studied the task of automatically identifying users' social circles in large-scale social networks, and have developed a model that combines network structure and user profile information to accurately detect circles.\n\nI am also interested in the analysis of time-varying network data and have proposed a nonparametric multi-group membership model for dynamic networks, which captures the birth and death of individual groups and the evolution of individual node group memberships.\n\nI have also studied the problem of donor retention in online crowdfunding platforms and have presented a large-scale study of millions of donors and donations on DonorsChoose.org, identifying factors impacting donor retention and discussing how the findings could inform steps to improve donor retention in crowdfunding communities and non-profit organizations.\n\nMost recently, I have studied the relationship between Label Propagation (LPA) and Graph Convolutional Neural Networks (GCN) in terms of feature/label smoothing and influence, and have proposed an end-to-end model that unifies GCN and LPA for node classification, which has shown superiority over state-of-the-art GCN-based methods in terms of node classification accuracy.",
    "collaborators": [
      "Myunghwan Kim",
      "Julian McAuley",
      "Eric Horvitz",
      "Tim Althoff",
      "Hongwei Wang"
    ],
    "institute": null,
    "embed": null,
    "is_proj_leader_candidate": false,
    "is_proj_participant_candidate": false,
    "is_reviewer_candidate": true,
    "is_chair_candidate": false
  },
  "df02f5fc-8184-4eeb-a1da-a6f0e4052a62": {
    "pk": "df02f5fc-8184-4eeb-a1da-a6f0e4052a62",
    "project_name": null,
    "name": "Stefanie Jegelka",
    "bio": " I am a researcher working on various topics in machine learning and theoretical computer science. My recent work has focused on graph neural networks (GNNs) and their theoretical properties, including representation, generalization, and extrapolation. I have also explored the use of ResNets for approximating Lebesgue integrable functions in multiple dimensions, and have demonstrated the increased representational power of narrow deep networks using the ResNet architecture.\n\nIn addition to my work on neural networks, I have also studied distributionally robust optimization (DRO) with uncertainty sets measured via maximum mean discrepancy (MMD). I have shown that MMD DRO is roughly equivalent to regularization by the Hilbert norm, and have revealed deep connections to classic results in statistical learning. I have also derived a generically applicable approximation of MMD DRO, which generalizes recent work on variance-based regularization.\n\nI am also interested in the implicit bias induced by the training of neural networks, and have extended theoretical results on the convergence of weights in deep linear networks to the last few linear layers of nonlinear ReLU-activated feedforward networks containing fully-connected layers and skip connections. I have also studied the benefits of encoding invariances into models for improving sample complexity, and have provided minimax optimal rates for kernel ridge regression on compact manifolds with a target function that is invariant to a group action on the manifold.\n\nIn my work on robust optimization, I have revisited the Budget Allocation or Bipartite Influence Maximization problem from a robust optimization perspective, where an adversary may choose the least favorable parameters within a confidence set. I have shown that this nonconvex problem can be solved exactly by leveraging connections to continuous submodular functions, and by solving a constrained submodular minimization problem.\n\nI have also proposed a new criterion, Max-value Entropy Search (MES), for Bayesian optimization that uses the information about the maximum function value instead of the entropy. I have shown relations of MES to other Bayesian optimization methods, and have established a regret bound. I have observed that MES maintains or improves the good empirical performance of ES/PES, while tremendously lightening the computational burden.\n\nIn my work on robustness to group invariances, I have studied how the inherent invariances, with respect to any smooth action of a Lie group on",
    "collaborators": [
      "Matthew Staib",
      "Thien Le",
      "Behrooz Tahmasebi",
      "Chengtao Li",
      "Suvrit Sra",
      "Hongzhou Lin",
      "Zi Wang"
    ],
    "institute": null,
    "embed": null,
    "is_proj_leader_candidate": false,
    "is_proj_participant_candidate": false,
    "is_reviewer_candidate": true,
    "is_chair_candidate": false
  },
  "ef7ab9c5-2e6e-49f5-934e-360f419137e8": {
    "pk": "ef7ab9c5-2e6e-49f5-934e-360f419137e8",
    "project_name": null,
    "name": "Silvio Lattanzi",
    "bio": " I am a researcher in the field of computer science, specifically in algorithms and data structures. I have worked on various problems related to social networks, clustering, and graph algorithms.\n\nOne of my research projects focused on reconciling multiple online social networks to identify all the accounts belonging to the same individual. I was able to prove strong theoretical guarantees on the performance of our algorithm on well-established network models and also confirmed its effectiveness through experiments on synthetic and real social network data sets.\n\nI have also worked on improving the $k$-means++ algorithm, which is often used for optimizing the $k$-means clustering objective. I proposed augmenting the algorithm with local search steps obtained through the $k$-means++ sampling distribution to achieve a $9 + \\varepsilon$ approximation ratio. This is the best possible for local search and I showed that it yields substantial practical improvements.\n\nIn addition, I have designed the first distributed and the first streaming algorithms to compute and maintain an approximate $k$-core decomposition with provable guarantees. These algorithms achieve rigorous bounds on space complexity while bounding the number of passes or number of rounds of computation.\n\nI have also studied the problem of estimating the common mean of independent symmetric random variables with different and unknown standard deviations. I showed that, under some mild regularity assumptions on the distribution, there is a fully adaptive estimator that is invariant to permutations of the elements of the sample and satisfies certain conditions with high probability.\n\nI am interested in the problem of maintaining a stable and high quality solution for the facility location problem in fully dynamic data streams, where elements can be both inserted and deleted. I have developed an algorithm that maintains a constant approximation and incurs polylogarithmic amortized recourse per update.\n\nI have also studied the question of fair clustering under the disparate impact doctrine, where each protected class must have approximately equal representation in every cluster. I formulated the fair clustering problem under both the $k$-center and the $k$-median objectives, and introduced the concept of fairlets to decompose the problem into finding good fairlets and then using existing machinery for traditional clustering algorithms.\n\nI am interested in maintaining a constant approximate clustering by changing the cluster centers only a small number of times during the entire execution of the algorithm. I have developed an algorithm that matches the guarantees in the off",
    "collaborators": [
      "Nikos Parotsidis",
      "Michael Kapralov",
      "Nitish Korula",
      "Lorenzo Beretta",
      "Vincent Cohen-Addad",
      "Hossein Esfandiari",
      "Vahab Mirrokni",
      "Luc Devroye",
      "Gabor Lugosi",
      "Nikita Zhivotovskiy"
    ],
    "institute": null,
    "embed": null,
    "is_proj_leader_candidate": false,
    "is_proj_participant_candidate": false,
    "is_reviewer_candidate": false,
    "is_chair_candidate": true
  },
  "b5320d8d-62e3-4745-8645-11f0ead3c434": {
    "pk": "b5320d8d-62e3-4745-8645-11f0ead3c434",
    "project_name": null,
    "name": "Rex Ying",
    "bio": " I am a researcher working on various aspects of graph neural networks (GNNs) and their applications. My work includes exploring structural feature correlation analysis in GNNs, where I have developed graph feature to feature (Fea2Fea) prediction pipelines in a low dimensional space to uncover some preliminary results. I have also worked on improving the classification accuracy of GNNs by filtering irredundant feature combinations with initial node features.\n\nIn addition, I have proposed a novel approach called Temporal Motifs Explainer (TempME) to uncover the most pivotal temporal motifs that guide the prediction of temporal graph neural networks (TGNNs). TempME extracts the most interaction-related motifs while minimizing the amount of contained information to preserve the sparsity and succinctness of the explanation.\n\nI have also worked on extending GCNs to hyperbolic geometry, which offers an alternative to embedding real-world graphs with scale-free or hierarchical structure. I have proposed Hyperbolic Graph Convolutional Neural Network (HGCN), the first inductive hyperbolic GCN that leverages both the expressiveness of GCNs and hyperbolic geometry to learn inductive node representations for hierarchical and scale-free graphs.\n\nFurthermore, I have presented GraphSAGE, a general, inductive framework that leverages node feature information to efficiently generate node embeddings for previously unseen data. Instead of training individual embeddings for each node, GraphSAGE learns a function that generates embeddings by sampling and aggregating features from a node's local neighborhood.\n\nMy work also includes a conceptual review of key advancements in representation learning on graphs, including matrix factorization-based methods, random-walk based algorithms, and graph neural networks. I have developed a unified framework to describe these recent approaches and highlighted a number of important applications and directions for future work.\n\nI have proposed Position-aware Graph Neural Networks (P-GNNs), a new class of GNNs for computing position-aware node embeddings. P-GNN first samples sets of anchor nodes, computes the distance of a given target node to each anchor-set, and then learns a non-linear distance-weighted aggregation scheme over the anchor-sets.\n\nI have also worked on encoding long sequences in Natural Language Processing (",
    "collaborators": [
      "Jure Leskovec",
      "Jialin Chen",
      "William L. Hamilton",
      "Jiaqing Xie",
      "Ines Chami",
      "Christopher Ré",
      "Jiaxuan You",
      "Irene Li",
      "Aosong Feng",
      "Dragomir Radev"
    ],
    "institute": null,
    "embed": null,
    "is_proj_leader_candidate": false,
    "is_proj_participant_candidate": true,
    "is_reviewer_candidate": false,
    "is_chair_candidate": false
  },
  "cd65113e-1b85-484b-b7f9-9fa582cc682f": {
    "pk": "cd65113e-1b85-484b-b7f9-9fa582cc682f",
    "project_name": null,
    "name": "Tim Althoff",
    "bio": " I am a researcher with a focus on using large-scale data and computational methods to study various topics, including online crowdfunding, visual recognition, mental health, social media, and physical activity.\n\nIn my work on online crowdfunding, I have studied millions of donors and donations on DonorsChoose.org, a platform for education projects. I have explored factors that impact donor retention and found that donors are more likely to return if they had a positive interaction with the receiver of the donation, including appropriate and timely recognition of their support and detailed communication of their impact.\n\nIn the field of visual recognition, I have proposed a new image representation called Detection Bank, which is based on the detection images from a large number of windowed object detectors. This representation has been shown to capture complementary information to state-of-the-art representations and significantly outperforms them on TRECVID MED 2011 data.\n\nI have also studied text-message-based counseling conversations and developed a set of novel computational discourse analysis methods to measure how various linguistic aspects of conversations are correlated with conversation outcomes. Through this work, I have discovered actionable conversation strategies that are associated with better conversation outcomes.\n\nIn addition, I have conducted a comprehensive study of trending topics across three major online and social media streams, Twitter, Google, and Wikipedia. I have presented a novel approach for forecasting the life cycle of trending topics in the very moment they emerge and demonstrated that forecasts by the proposed approach are more accurate than baseline methods.\n\nI have also studied how competitions affect physical activity, specifically in the context of walking challenges in a mobile activity tracking application. I have found that during walking competitions, the average user increases physical activity by 23% and that competitions with an equal mix of both men and women are more effective in increasing the level of activities.\n\nI have developed a method called TIMEMACHINE to generate a timeline of events and relations for entities in a knowledge base, based on submodular optimization and web-co-occurrence statistics with provable performance guarantees.\n\nI have studied the effect of the mobile game Pokémon Go on physical activity and found that it leads to significant increases in physical activity over a period of 30 days, with particularly engaged users increasing their activity by 1473 steps a day on",
    "collaborators": [
      "Jure Leskovec",
      "Hyun Oh Song",
      "Trevor Darrell",
      "Kevin Clark",
      "Damian Borth",
      "Jörn Hees",
      "Andreas Dengel",
      "Ali Shameli",
      "Amin Saberi",
      "Xin Luna Dong"
    ],
    "institute": null,
    "embed": null,
    "is_proj_leader_candidate": true,
    "is_proj_participant_candidate": true,
    "is_reviewer_candidate": true,
    "is_chair_candidate": true
  },
  "5f2cb5e3-4079-44f3-baf8-4ef7e3200583": {
    "pk": "5f2cb5e3-4079-44f3-baf8-4ef7e3200583",
    "project_name": null,
    "name": "Christos Faloutsos",
    "bio": " I am a researcher with a strong background in computer science and data analysis. My work is focused on developing innovative and practical solutions to real-world problems, particularly in the areas of network analysis, graph mining, and machine learning.\n\nOne of my key contributions is the development of the V-SMART-Join framework, a scalable MapReduce-based solution for discovering similar entities in large datasets. This work was motivated by the skewed distribution of Internet traffic and is up to 30 times faster than the state-of-the-art algorithm.\n\nI am also interested in the analysis of large graphs, and have developed the GMine system, which offers multi-resolution graph exploration and summarization. This system allows users to interactively explore large graphs with hundreds of thousands of nodes, by partitioning the graph into a hierarchy of communities-within-communities and storing it into a novel R-tree-like structure.\n\nIn addition, I have proposed NetSimile, a novel and scalable method for assessing similarity between networks, without solving the node-correspondence problem. This method has been shown to be effective in a variety of tasks, including clustering, visualization, and network transfer learning.\n\nI have also worked on the problem of succinctly describing large graphs, by constructing a \"vocabulary\" of subgraph-types that often occur in real graphs, and using this vocabulary to find the most succinct description of a graph. This work has been applied to multi-million-edge real graphs, including Flickr and the Notre Dame web graph.\n\nMost recently, I have developed TribeFlow, a method for predicting user trajectories in non-stationary, transient, and time-heterogeneous environments. This method has been shown to be more accurate and up to 413x faster than top competitors in a variety of applications, including next product recommendation, next song recommendation, next location prediction, and general arbitrary-length user trajectory prediction.\n\nI am passionate about using my skills in computer science and data analysis to make a positive impact on the world, and am always looking for new and exciting challenges to tackle.",
    "collaborators": [
      "Danai Koutra",
      "Bruno Ribeiro",
      "Bryan Hooi",
      "Ahmed Metwally",
      "Jose Rodrigues",
      "Hanghang Tong",
      "Agma Traina",
      "Jure Leskovec",
      "Michele Berlingerio",
      "Tina Eliassi-Rad"
    ],
    "institute": null,
    "embed": null,
    "is_proj_leader_candidate": false,
    "is_proj_participant_candidate": true,
    "is_reviewer_candidate": false,
    "is_chair_candidate": false
  },
  "806defef-5ecd-40e1-bcf3-d0abb8f46b46": {
    "pk": "806defef-5ecd-40e1-bcf3-d0abb8f46b46",
    "project_name": null,
    "name": "Julian McAuley",
    "bio": " I am a researcher with a focus on various aspects of data analysis and machine learning. I have worked on several projects involving social networks, where I studied the use of social-network metadata for image classification and retrieval. I developed a model that accounts for the interdependencies between images sharing common properties and found that social-network metadata can be useful in a variety of classification tasks.\n\nIn another project, I addressed the problem of organizing people's personal social networks by automatically identifying users' social circles. I posed this task as a multi-membership node clustering problem on a user's ego-network and developed a model that combines network structure and user profile information to accurately detect circles, including overlapping and hierarchically nested circles.\n\nI have also worked on a project related to recommender systems, where I modeled how tastes change due to the act of consuming more products. I developed a latent factor recommendation system that explicitly accounts for each user's level of experience and found that such a model leads to better recommendations and allows for the study of the role of user experience and expertise.\n\nIn addition to my work on social networks and recommender systems, I have also surveyed the current state of model compression and acceleration for pretrained language models, with a focus on the inference stage. I have reviewed benchmarks, metrics, and methodology for efficient NLP research.\n\nMost recently, I have investigated the use of review text in recommender systems and have observed several discrepancies in reported results. I have attempted to resolve these ambiguities and have provided hypotheses for under what conditions reviews are likely to be helpful for recommendation.\n\nIn summary, I am a researcher with expertise in social networks, recommender systems, and natural language processing. I am interested in developing models and techniques for data analysis and machine learning, with a focus on efficiency, accuracy, and real-world impact.",
    "collaborators": [
      "Jure Leskovec",
      "Canwen Xu",
      "Ruining He",
      "Alex Yang",
      "Noveen Sachdeva"
    ],
    "institute": null,
    "embed": null,
    "is_proj_leader_candidate": false,
    "is_proj_participant_candidate": false,
    "is_reviewer_candidate": true,
    "is_chair_candidate": false
  }
}
