{
  "8c442a39-6d98-4163-9c01-316c2498b5cf": {
    "pk": "8c442a39-6d98-4163-9c01-316c2498b5cf",
    "project_name": "research_town_demo",
    "eval_score": [],
    "paper_pk": "30e29291-1615-46e4-bb87-1780167fe289",
    "chair_pk": "4cb51964-11d9-47a5-97e2-75b86b3d09c4",
    "reviewer_pks": [],
    "author_pk": "4cb51964-11d9-47a5-97e2-75b86b3d09c4",
    "summary": "**Summary of Reviews and Decisions:**\n\n**Reviewer 1:**\n- **Score: 7/10**\n- **Strengths:**\n  - The paper introduces a comprehensive suite of innovative models and mechanisms to enhance the interpretability and performance of GNNs and TGNNs.\n  - The integration of DN-CBM with PolyFormer and the extension to Temp-CBMs is well-motivated and addresses a significant gap in the literature.\n  - The application of these models to diverse domains, including social networks, medical imaging, and financial networks, demonstrates the versatility and practical relevance of the proposed approaches.\n- **Weaknesses:**\n  - The paper is dense and covers a wide range of topics, which may make it challenging for readers to grasp the core contributions and innovations.\n  - Some of the proposed models, such as the integration of physics-based AI models with GNNs, are not thoroughly evaluated, leaving questions about their practical effectiveness.\n- **Decision:**\n  - Accept with minor revisions. The paper should be revised to improve clarity and focus, particularly in the presentation of the core contributions and the evaluation of the proposed models.\n\n**Reviewer 2:**\n- **Score: 6/10**\n- **Strengths:**\n  - The hybrid model combining DN-CBM with PolyFormer is a novel approach that enhances interpretability in large-scale GNNs.\n  - The extension to Temp-CBMs for temporal graphs is a valuable contribution, providing insights into dynamic graph evolution.\n  - The application of DN-CBM to medical imaging and cross-domain transfer is particularly noteworthy and has significant potential for real-world impact.\n- **Weaknesses:**\n  - The paper lacks detailed experimental results and comparisons with state-of-the-art methods, making it difficult to assess the true performance improvements.\n  - The discussion on the integration of SurvReLU and PolyAttn mechanisms is somewhat superficial and could benefit from more in-depth analysis and evaluation.\n- **Decision:**\n  - Accept with major revisions. The authors should provide more detailed experimental results and comparisons, and expand the discussion on the integration of SurvReLU and PolyAttn mechanisms.\n\n**Reviewer 3:**\n- **Score: 5/10**\n- **Strengths:**\n  - The paper addresses an important problem of enhancing interpretability in GNNs and TGNNs, which is crucial for their adoption in various applications.\n  - The proposed models, particularly the DN-CBM and Temp-CBMs, are innovative and have the",
    "strength": "**Strength of the Submission:**\n\nThe submission presents a comprehensive and innovative suite of models and mechanisms aimed at enhancing the interpretability and performance of Graph Neural Networks (GNNs) and Temporal Graph Neural Networks (TGNNs). The reviewers have acknowledged several strengths and weaknesses, which are summarized below to aid in the decision-making process.\n\n**Strengths:**\n1. **Innovative Approaches:** The paper introduces novel models such as the hybrid DN-CBM with PolyFormer and extends these concepts to temporal graphs with Temp-CBMs. These contributions are well-motivated and address significant gaps in the current literature.\n2. **Versatility and Practical Relevance:** The proposed models are applied to a diverse range of domains, including social networks, medical imaging, and financial networks, demonstrating their versatility and potential for real-world impact.\n3. **Interdisciplinary Integration:** The integration of physics-based AI models with GNNs and the application of DN-CBM to various domains, including medical and social network analysis, highlight the interdisciplinary nature and broad applicability of the research.\n\n**Weaknesses:**\n1. **Density and Clarity:** The paper covers a wide range of topics, making it dense and potentially challenging for readers to grasp the core contributions and innovations. A more focused presentation is needed.\n2. **Evaluation and Experimental Results:** Some proposed models, such as the integration of physics-based AI models with GNNs, lack thorough evaluation. Additionally, the paper lacks detailed experimental results and comparisons with state-of-the-art methods, which are crucial for assessing the true performance improvements.\n3. **Superficial Discussions:** The discussion on the integration of SurvReLU and PolyAttn mechanisms is somewhat superficial and could benefit from more in-depth analysis and evaluation.\n\n**Decisions:**\n- **Reviewer 1:** Accept with minor revisions. The paper should be revised to improve clarity and focus, particularly in presenting the core contributions and evaluating the proposed models.\n- **Reviewer 2:** Accept with major revisions. The authors should provide more detailed experimental results and comparisons, and expand the discussion on the integration of SurvReLU and PolyAttn mechanisms.\n- **Reviewer 3:** The review was cut off, but the initial feedback indicates a recognition of the importance of the problem and the innovativeness of the proposed models.\n\n**Overall Recommendation:**\nThe submission is strong in terms of its innovative contributions and practical relevance across multiple domains. However, to meet the standards of the conference, the authors should address the identified weaknesses by improving the clarity",
    "weakness": "**Weaknesses of the Submission:**\n\n1. **Density and Scope:**\n   - The paper covers a wide range of topics and introduces multiple models and mechanisms, which makes it dense and potentially overwhelming for readers. This broad scope can dilute the focus on the core contributions and innovations, making it challenging to grasp the main advancements clearly.\n\n2. **Evaluation and Practical Effectiveness:**\n   - Some proposed models, such as the integration of physics-based AI models with GNNs, are not thoroughly evaluated. This lack of comprehensive evaluation raises questions about their practical effectiveness and applicability in real-world scenarios.\n\n3. **Experimental Results and Comparisons:**\n   - The paper lacks detailed experimental results and comparisons with state-of-the-art methods. This omission makes it difficult to assess the true performance improvements and the practical benefits of the proposed approaches.\n\n4. **Superficial Discussions:**\n   - The discussion on the integration of SurvReLU and PolyAttn mechanisms is somewhat superficial. More in-depth analysis and evaluation are needed to substantiate the claims and demonstrate the effectiveness of these mechanisms.\n\n5. **Clarity and Focus:**\n   - The presentation of the core contributions and the evaluation of the proposed models need improvement. Enhancing clarity and focus in these areas would help readers better understand the significance and impact of the research.\n\n**Summary of Decisions:**\n\n- **Reviewer 1:** Accept with minor revisions. The paper should be revised to improve clarity and focus, particularly in the presentation of the core contributions and the evaluation of the proposed models.\n- **Reviewer 2:** Accept with major revisions. The authors should provide more detailed experimental results and comparisons, and expand the discussion on the integration of SurvReLU and PolyAttn mechanisms.\n- **Reviewer 3:** The review was cut off, but the score suggests a need for significant improvements, likely aligning with the concerns about evaluation and clarity.\n\n**Overall Recommendation:**\nThe paper has potential due to its innovative approaches and broad applicability. However, it requires revisions to address the issues of density, evaluation, and clarity. Detailed experimental results, thorough comparisons with existing methods, and more focused discussions on specific mechanisms are essential to strengthen the submission.",
    "decision": true
  }
}
