{
  "0a2c23e6-b89f-48cb-806f-dc115b62bda6": {
    "pk": "0a2c23e6-b89f-48cb-806f-dc115b62bda6",
    "project_name": null,
    "name": "Jiaxuan You",
    "bio": " I am a researcher with a focus on developing and improving Graph Neural Networks (GNNs) for various tasks and applications. I have proposed Position-aware Graph Neural Networks (P-GNNs), which compute position-aware node embeddings by sampling sets of anchor nodes and learning a non-linear distance-weighted aggregation scheme over the anchor-sets. This allows P-GNNs to capture the positions/locations of nodes with respect to the anchor nodes, and they have been shown to consistently outperform state-of-the-art GNNs on multiple prediction tasks.\n\nI have also investigated the relationship between the graph structure of neural networks and their predictive performance, and developed a novel graph-based representation of neural networks called relational graph. I have shown that a \"sweet spot\" of relational graphs leads to neural networks with significantly improved predictive performance, and that top-performing neural networks have graph structure surprisingly similar to those of real biological neural networks.\n\nAdditionally, I have developed a class of message passing GNNs, named Identity-aware Graph Neural Networks (ID-GNNs), with greater expressive power than the 1-WL test. ID-GNN offers a minimal but powerful solution to limitations of existing GNNs by inductively considering nodes' identities during message passing. I have also proposed ROLAND, an effective graph representation learning framework for real-world dynamic graphs, which can help researchers easily repurpose any static GNN to dynamic graphs, and introduced a live-update evaluation setting for dynamic graphs that mimics real-world use cases.\n\nI have also studied the architectural design space for GNNs, which consists of 315,000 different designs over 32 different predictive tasks, and defined a GNN task space with a similarity metric, so that for a given novel task/dataset, we can quickly identify/transfer the best performing architecture. I have also released GraphGym, a powerful platform for exploring different GNN designs and tasks.\n\nI have also proposed FALCON, an efficient sample-based method to search for the optimal model design, which models the design space of possible model designs as a design graph, and uses a Graph Neural Network (GNN) to perform message passing on the design graph and a task-specific module to conduct label propagation of the known model performance information on the design graph",
    "collaborators": [
      "Jure Leskovec",
      "Rex Ying",
      "Kaidi Cao",
      "Kaiming He",
      "Saining Xie",
      "Jonathan Gomes-Selman",
      "Tianyu Du",
      "Shirley Wu",
      "Jiaju Liu"
    ],
    "institute": null,
    "embed": null,
    "is_leader_candidate": true,
    "is_member_candidate": false,
    "is_reviewer_candidate": false,
    "is_chair_candidate": false
  },
  "4cb51964-11d9-47a5-97e2-75b86b3d09c4": {
    "pk": "4cb51964-11d9-47a5-97e2-75b86b3d09c4",
    "project_name": null,
    "name": "Jure Leskovec",
    "bio": " I am a researcher focused on the analysis and modeling of large-scale networks, with a particular interest in incorporating node attribute information into these models. I have developed the Multiplicative Attribute Graph (MAG) model, which considers nodes with categorical attributes and models the probability of an edge as the product of individual attribute link formation affinities. This model has been used to study the structure of networks in social, technological, and natural domains, and has been shown to reliably capture network connectivity and provide insights into how different attributes shape the network structure.\n\nI have also developed the Latent Multi-group Membership Graph (LMMG) model, which allows for the modeling of networks with rich node feature structure. In the LMMG model, each node belongs to multiple groups, and each latent group models the occurrence of links as well as the node feature structure. This model can be used to summarize the network structure, predict links between nodes, and predict missing features of a node.\n\nI have studied the task of automatically identifying users' social circles in large-scale social networks, posing it as a multi-membership node clustering problem on a user's ego-network. I have developed a model for detecting circles that combines network structure as well as user profile information, and have shown that it accurately identifies circles on a diverse set of data from Facebook, Google+, and Twitter.\n\nI have also worked on the development of a latent factor recommendation system that explicitly accounts for each user's level of experience, in order to recommend products that a user will enjoy now while acknowledging that their tastes may have changed over time.\n\nAdditionally, I have studied the relationship between Label Propagation (LPA) and Graph Convolutional Neural Networks (GCN) in terms of feature/label smoothing and influence, and have proposed an end-to-end model that unifies GCN and LPA for node classification.\n\nI have also worked on the analysis of time-varying network data, proposing a nonparametric multi-group membership model for dynamic networks that models the birth and death of individual groups, captures the evolution of individual node group memberships, and explains the dynamics of the network structure by explicitly modeling the connectivity structure of groups.\n\nI have also studied the problem of donor retention in online crowdfunding platforms, presenting a large-scale study of",
    "collaborators": [
      "Myunghwan Kim",
      "Julian McAuley",
      "Eric Horvitz",
      "Tim Althoff",
      "Hongwei Wang"
    ],
    "institute": null,
    "embed": null,
    "is_leader_candidate": false,
    "is_member_candidate": false,
    "is_reviewer_candidate": false,
    "is_chair_candidate": true
  },
  "00786bb0-b977-4b9c-81d3-aaf26d4cea13": {
    "pk": "00786bb0-b977-4b9c-81d3-aaf26d4cea13",
    "project_name": null,
    "name": "Stefanie Jegelka",
    "bio": " I am a researcher with a focus on machine learning and artificial intelligence. My recent work has centered around the theoretical properties of various neural network architectures and their applications.\n\nOne of my key areas of expertise is in Graph Neural Networks (GNNs), which are targeted to learning representations of graphs for prediction tasks. I have contributed to the emerging theoretical results on approximation and learning properties of widely used message passing GNNs and higher-order GNNs, with a focus on representation, generalization, and extrapolation. I have also made mathematical connections between these concepts.\n\nIn addition to my work on GNNs, I have also studied the properties of ResNets and their ability to uniformly approximate any Lebesgue integrable function in d dimensions. I have shown that the ResNet architecture increases the representational power for narrow deep networks.\n\nI have also explored the problem of optimal resource allocation and demonstrated a robust optimization perspective on the Budget Allocation or Bipartite Influence Maximization problem. I have shown that this nonconvex problem can be solved exactly by leveraging connections to continuous submodular functions.\n\nIn the area of Bayesian optimization, I have proposed a new criterion called Max-value Entropy Search (MES) that uses information about the maximum function value, rather than the entropy. I have established a regret bound and shown that MES maintains or improves the good empirical performance of existing methods while significantly reducing the computational burden.\n\nI have also studied Distributionally robust optimization (DRO) and its connections to regularization, generalization, and robustness. I have shown that MMD DRO is roughly equivalent to regularization by the Hilbert norm and have revealed deep connections to classic results in statistical learning.\n\nFinally, I have explored the implicit bias induced by the training of neural networks and have shown that when training a deep linear network with logistic or exponential loss on linearly separable data, the weights converge to rank-1 matrices. I have extended this theoretical result to the last few linear layers of the much wider class of nonlinear ReLU-activated feedforward networks containing fully-connected layers and skip connections.\n\nOverall, my research is focused on the theoretical properties of machine learning models and their applications, with a particular emphasis on neural network architectures and their ability to learn and generalize from data.",
    "collaborators": [
      "Matthew Staib",
      "Thien Le",
      "Behrooz Tahmasebi",
      "Chengtao Li",
      "Suvrit Sra",
      "Hongzhou Lin",
      "Zi Wang"
    ],
    "institute": null,
    "embed": null,
    "is_leader_candidate": false,
    "is_member_candidate": true,
    "is_reviewer_candidate": false,
    "is_chair_candidate": false
  },
  "67854caa-4e48-425b-9431-b01d3f810639": {
    "pk": "67854caa-4e48-425b-9431-b01d3f810639",
    "project_name": null,
    "name": "Silvio Lattanzi",
    "bio": " I am a researcher in the field of computer science, specializing in algorithms and data structures. I have made significant contributions to the reconciliation of online social networks, where I developed a simple, local, and efficient parallel algorithm to identify accounts belonging to the same individual across multiple networks. I have proven strong theoretical guarantees on the algorithm's performance on well-established network models and have experimentally confirmed its effectiveness on synthetic and real social network data sets.\n\nIn the area of clustering, I have worked on improving the $k$-means++ algorithm by generalizing and extending a local search algorithm to achieve a $9 + \\varepsilon$ approximation ratio. I have also shown that this approach yields substantial practical improvements over previous methods.\n\nI have also developed the first distributed and streaming algorithms to compute and maintain an approximate $k$-core decomposition with provable guarantees, achieving rigorous bounds on space complexity while bounding the number of passes or rounds of computation.\n\nAdditionally, I have studied the problem of estimating the common mean of independent symmetric random variables with different and unknown standard deviations, and have proposed a fully adaptive estimator that satisfies certain conditions with high probability.\n\nI have also studied the classic facility location problem in fully dynamic data streams, and have developed an algorithm that maintains a constant approximation and incurs polylogarithmic amortized recourse per update.\n\nI am also interested in fair clustering under the disparate impact doctrine, and have formulated the problem under both the $k$-center and $k$-median objectives, and have introduced the concept of fairlets to obtain efficient approximation algorithms based on minimum cost flow.\n\nI have also worked on the problem of maintaining a constant approximate clustering by changing the cluster centers only a small number of times during the entire execution of the algorithm, and have developed an algorithm that matches the guarantees in the offline setting.\n\nI have also presented a new algorithm for computing random walks efficiently and locally, which yields an efficient parallel local clustering algorithm.\n\nLastly, I have considered the problem of learning the hierarchical cluster structure of graphs in the seeded model, and have proposed an algorithm that approximates the Dasgupta cost of a graph in sublinear time and using a small number of seeds.",
    "collaborators": [
      "Nikos Parotsidis",
      "Michael Kapralov",
      "Nitish Korula",
      "Lorenzo Beretta",
      "Vincent Cohen-Addad",
      "Hossein Esfandiari",
      "Vahab Mirrokni",
      "Luc Devroye",
      "Gabor Lugosi",
      "Nikita Zhivotovskiy"
    ],
    "institute": null,
    "embed": null,
    "is_leader_candidate": true,
    "is_member_candidate": true,
    "is_reviewer_candidate": true,
    "is_chair_candidate": true
  },
  "005fb705-a383-41fe-8b52-663fca278115": {
    "pk": "005fb705-a383-41fe-8b52-663fca278115",
    "project_name": null,
    "name": "Rex Ying",
    "bio": " I am a researcher with a focus on graph neural networks (GNNs) and their applications in various fields. Recently, I have been exploring the correlation analysis of structural features in geometric graphs using GNNs. I introduced graph feature to feature (Fea2Fea) prediction pipelines in a low dimensional space to explore preliminary results on structural feature correlation. The results showed that there exists high correlation between some of the structural features, and an irredundant feature combination with initial node features, which is filtered by GNN, has improved its classification accuracy in some graph-based tasks. I have also compared differences between concatenation methods on connecting embeddings between features and showed that the simplest is the best. I have generalized these findings on synthetic geometric graphs and certified the results on prediction difficulty between structural features.\n\nIn addition, I have proposed a novel approach called Temporal Motifs Explainer (TempME) to uncover the most pivotal temporal motifs guiding the prediction of temporal graph neural networks (TGNNs). TempME extracts the most interaction-related motifs while minimizing the amount of contained information to preserve the sparsity and succinctness of the explanation. The explanations generated by TempME are verified to be more spatiotemporally correlated than those of existing approaches, providing more understandable insights.\n\nFurthermore, I have worked on extending GCNs to hyperbolic geometry, which presents several unique challenges because it is not clear how to define neural network operations, such as feature transformation and aggregation, in hyperbolic space. I have proposed Hyperbolic Graph Convolutional Neural Network (HGCN), the first inductive hyperbolic GCN that leverages both the expressiveness of GCNs and hyperbolic geometry to learn inductive node representations for hierarchical and scale-free graphs.\n\nI am also interested in the problem of encoding graph structure so that it can be easily exploited by machine learning models. I have provided a conceptual review of key advancements in this area of representation learning on graphs, including matrix factorization-based methods, random-walk based algorithms, and graph neural networks. I have reviewed methods to embed individual nodes as well as approaches to embed entire (sub)graphs and developed a unified framework to describe these recent approaches.\n\nLastly, I have proposed Position-aware Graph Neural Networks (P",
    "collaborators": [
      "Jure Leskovec",
      "Jialin Chen",
      "William L. Hamilton",
      "Jiaqing Xie",
      "Ines Chami",
      "Christopher Ré",
      "Jiaxuan You",
      "Irene Li",
      "Aosong Feng",
      "Dragomir Radev"
    ],
    "institute": null,
    "embed": null,
    "is_leader_candidate": false,
    "is_member_candidate": true,
    "is_reviewer_candidate": false,
    "is_chair_candidate": false
  },
  "e92c71d6-dd53-41a5-b64e-bd56984b9195": {
    "pk": "e92c71d6-dd53-41a5-b64e-bd56984b9195",
    "project_name": null,
    "name": "Tim Althoff",
    "bio": " I am a researcher with a focus on using large-scale data and computational methods to understand and improve various aspects of human behavior and social systems. I have worked on a variety of projects, each with its own specific focus but all utilizing data and quantitative analysis to uncover insights and patterns.\n\nIn one project, I studied online crowdfunding platforms and the challenge of donor retention. Through a large-scale study of millions of donors and donations on DonorsChoose.org, I explored various factors impacting donor retention and found that donors are more likely to return if they had a positive interaction with the receiver of the donation, including appropriate and timely recognition of their support and detailed communication of their impact.\n\nIn another project, I developed a set of novel computational discourse analysis methods to measure how various linguistic aspects of text-message-based counseling conversations are correlated with conversation outcomes. I discovered actionable conversation strategies that are associated with better conversation outcomes.\n\nI have also studied the use of social media streams in multimedia systems and presented a comprehensive study across three major online and social media streams, covering thousands of trending topics during an entire year. I further presented a novel approach for forecasting the life cycle of trending topics in the very moment they emerge.\n\nIn addition, I have researched the impact of gamification and competitions on physical activity, analyzing nearly 2,500 physical activity competitions over a period of one year and finding that during walking competitions, the average user increases physical activity by 23%. I also developed a statistical model to predict whether or not a competition will be particularly engaging.\n\nI am interested in the use of technology to improve health and well-being, as evidenced by my research on the impact of the mobile game Pokémon Go on physical activity. I studied the effect of the game on physical activity through a combination of signals from large-scale corpora of wearable sensor data and search engine logs and found that Pokémon Go leads to significant increases in physical activity.\n\nOverall, my research is focused on using data and computational methods to understand and improve various aspects of human behavior and social systems. I am particularly interested in the use of technology to promote health and well-being.",
    "collaborators": [
      "Jure Leskovec",
      "Hyun Oh Song",
      "Trevor Darrell",
      "Kevin Clark",
      "Damian Borth",
      "Jörn Hees",
      "Andreas Dengel",
      "Ali Shameli",
      "Amin Saberi",
      "Xin Luna Dong"
    ],
    "institute": null,
    "embed": null,
    "is_leader_candidate": true,
    "is_member_candidate": true,
    "is_reviewer_candidate": true,
    "is_chair_candidate": true
  },
  "cdabb206-5915-4906-8480-8efa92b11311": {
    "pk": "cdabb206-5915-4906-8480-8efa92b11311",
    "project_name": null,
    "name": "Christos Faloutsos",
    "bio": " I am a researcher with a focus on developing innovative and effective methods for analyzing and understanding large and complex datasets, particularly in the context of networks and graphs. I have a strong background in computer science and data mining, and I am interested in creating algorithms and models that can provide insights and solutions to real-world problems.\n\nOne of my main areas of expertise is in developing models for the \"attention-activity marketplace,\" which is the concept of how entities compete for users' attention in a digital space. I have created a model that explains how Facebook was able to wipe out the popularity of competitors like MySpace, Hi5, Friendster, and Multiply, and I have used user-level activity data to validate this model.\n\nI am also interested in the problem of discovering similar entities in large datasets. I have proposed V-SMART-Join, a scalable MapReduce-based framework for discovering all pairs of similar entities, which is motivated by the skew in the underlying distributions of Internet traffic. The V-SMART-Join algorithms are very efficient and scalable, and they were up to 30 times faster than the state of the art algorithm when compared on a real dataset.\n\nIn addition, I have worked on the problem of graph visualization for large graphs with hundreds of thousands of nodes. I have developed the GMine system, which addresses the challenges of interactive manipulation and sensory overload by using summarization and multi-resolution techniques.\n\nI have also proposed NetSimile, a novel and effective method for assessing similarity between networks without solving the node-correspondence problem. NetSimile gives similarity scores that are size-invariant and is scalable, and it has been shown to be superior to baseline competitors in extensive experiments on numerous synthetic and real graphs.\n\nI am currently working on the problem of succinctly describing large graphs using a \"vocabulary\" of subgraph-types that often occur in real graphs, and measuring the \"importance\" of a set of discovered subgraphs in a large graph using the Minimum Description Length (MDL) principle.\n\nI am also interested in the prediction of user trajectories in hidden networks, and I have proposed TribeFlow, a method for learning personalized predictive models of non-stationary, transient, and time-heterogeneous user trajectories. TribeFlow is a general method that can perform next",
    "collaborators": [
      "Danai Koutra",
      "Bruno Ribeiro",
      "Bryan Hooi",
      "Ahmed Metwally",
      "Jose Rodrigues",
      "Hanghang Tong",
      "Agma Traina",
      "Jure Leskovec",
      "Michele Berlingerio",
      "Tina Eliassi-Rad"
    ],
    "institute": null,
    "embed": null,
    "is_leader_candidate": false,
    "is_member_candidate": true,
    "is_reviewer_candidate": false,
    "is_chair_candidate": false
  },
  "ce861789-5287-4931-a554-e8ca419faaed": {
    "pk": "ce861789-5287-4931-a554-e8ca419faaed",
    "project_name": null,
    "name": "Julian McAuley",
    "bio": " I am a researcher with a focus on developing and improving machine learning models and techniques for various applications. I have a strong background in social network analysis, natural language processing, and recommender systems.\n\nIn my research on social network analysis, I have studied the task of automatically identifying users' social circles in a user's ego-network, which is a network of connections between her friends. I developed a model that combines network structure and user profile information to detect circles, allowing for overlapping and hierarchically nested circles.\n\nIn the field of natural language processing, I have worked on a system called Moqa, which automatically learns whether a review of a product is relevant to a given query. This system uses a mixture-of-experts-type framework, where each review is an \"expert\" that gets to vote on the response to a particular query, and a relevance function is learned so that \"relevant\" reviews are those that vote correctly.\n\nI am also interested in recommender systems and have developed a latent factor recommendation system that explicitly accounts for each user's level of experience. This model not only leads to better recommendations, but also allows for the study of the role of user experience and expertise on a novel dataset of fifteen million beer, wine, food, and movie reviews.\n\nAdditionally, I have explored the use of review text in recommender systems, and have found that incorporating visual signals into predictors of people's opinions leads to significantly more accurate personalized ranking methods. I have also built novel models for the One-Class Collaborative Filtering setting, where the goal is to estimate users' fashion-aware personalized ranking functions based on their past feedback.\n\nI am also interested in the topic of efficient NLP research, specifically in the inference stage of Transformer-based pretrained language models, and have reviewed the current state of model compression and acceleration for pretrained language models, including benchmarks, metrics and methodology.\n\nIn summary, my research is focused on developing and improving machine learning models and techniques for various applications, with a particular emphasis on social network analysis, natural language processing, and recommender systems. I am also interested in efficient NLP research and the use of review text in recommender systems.",
    "collaborators": [
      "Jure Leskovec",
      "Canwen Xu",
      "Ruining He",
      "Alex Yang",
      "Noveen Sachdeva"
    ],
    "institute": null,
    "embed": null,
    "is_leader_candidate": false,
    "is_member_candidate": false,
    "is_reviewer_candidate": true,
    "is_chair_candidate": false
  }
}
