{
  "30e29291-1615-46e4-bb87-1780167fe289": {
    "pk": "30e29291-1615-46e4-bb87-1780167fe289",
    "project_name": "research_town_demo",
    "eval_score": [],
    "abstract": "Abstract:\n\nThis paper introduces several innovative approaches to enhance the interpretability and performance of graph neural networks (GNNs) and temporal graph neural networks (TGNNs) through the integration of advanced models and mechanisms. We propose a hybrid model combining the Discover-then-Name Concept Bottleneck Model (DN-CBM) with PolyFormer to improve interpretability in large-scale GNNs. Additionally, we extend DN-CBM to temporal graphs by developing Temporal Concept Bottleneck Models (Temp-CBMs), providing interpretable insights into the evolution of dynamic graphs.\n\nWe adapt SurvReLU for survival analysis tasks in graph-based data, such as predicting time-to-event for nodes in social or biological networks. Furthermore, we investigate the use of PolyAttn mechanisms to enhance feature-to-feature (Fea2Fea) prediction pipelines in geometric graphs and develop scalable node-wise filters using PolyAttn for TGNNs.\n\nOur research also explores integrating physics-based AI models, such as the Nonlinear Schrödinger Network, with GNNs to improve representation and prediction tasks in graph-based data. We create sophisticated latent factor recommendation systems incorporating the interpretability of Concept Bottleneck Models (CBMs) and apply DN-CBM to social network analysis to discover and interpret latent social concepts for tasks like community detection or influence maximization.\n\nIn the medical domain, we utilize DN-CBM to discover and name medical concepts in imaging data, enhancing diagnostic accuracy and interpretability in medical AI systems. We also develop a cross-domain DN-CBM framework to transfer discovered concepts from one domain to another, improving interpretability and performance across different data types.\n\nFinally, we implement PolyFormer in real-time traffic prediction systems to capture dynamic changes in traffic patterns and apply it to financial networks to analyze and predict market trends. Our findings demonstrate that these proposed models and mechanisms significantly enhance the interpretability and performance of GNNs and TGNNs across various applications, providing valuable insights and practical solutions for complex graph-based tasks.",
    "title": null,
    "content": null,
    "conference": null
  }
}