{
  "4c018a8c-a550-4529-8fd4-9913f06efb61": {
    "pk": "4c018a8c-a550-4529-8fd4-9913f06efb61",
    "project_name": "research_town_demo",
    "abstract": "### Abstract\n\nGraph Neural Networks (GNNs) have emerged as powerful tools for graph representation learning, yet their scalability and adaptability remain critical challenges, especially when dealing with large-scale and complex graphs. This paper explores the integration of quantum optimization techniques with classical GNN architectures to address these challenges. Specifically, we propose a hybrid Quantum-Classical GNN model that leverages the Quantum Approximate Optimization Algorithm (QAOA) in conjunction with graph reduction techniques, such as Red-QAOA, to enhance the performance and scalability of GNNs. Red-QAOA effectively reduces the size of the graph, thereby minimizing noise and computational overhead in quantum circuits, which is crucial for large-scale optimization tasks.\n\nAdditionally, we introduce PolyFormer, a scalable Spectral GNN model that employs node-wise filters through an attention mechanism, ensuring efficient and expressive graph representation learning. PolyFormer addresses the limitations of traditional spectral methods by directly learning node-specific filters, thus offering a desirable balance between scalability and expressiveness. By combining the strengths of quantum optimization and advanced spectral GNN techniques, our hybrid model demonstrates superior performance on both homophilic and heterophilic graphs, handling datasets with up to 100 million nodes.\n\nExtensive experiments validate the efficacy of our approach, showing significant improvements in computational efficiency and model accuracy. This work paves the way for the development of more adaptable and scalable GNN architectures, capable of tackling complex graph-structured data across various domains. The code for PolyFormer is available at https://github.com/air029/PolyFormer, facilitating further research and application in this promising area.",
    "title": null,
    "content": null,
    "conference": null,
    "eval_score": []
  }
}
