{
  "e8df3f4d-a074-4cc7-a88d-8e2bede97e86": {
    "pk": "e8df3f4d-a074-4cc7-a88d-8e2bede97e86",
    "authors": [
      "Yiming Zhou",
      "Callen MacPhee",
      "Tingyi Zhou",
      "Bahram Jalali"
    ],
    "title": "Nonlinear Schrödinger Network",
    "abstract": "Deep neural networks (DNNs) have achieved exceptional performance across various fields by learning complex nonlinear mappings from large-scale datasets. However, they encounter challenges such as high computational costs and limited interpretability. To address these issues, hybrid approaches that integrate physics with AI are gaining interest. This paper introduces a novel physics-based AI model called the \"Nonlinear Schr\\\"odinger Network\", which treats the Nonlinear Schr\\\"odinger Equation (NLSE) as a general-purpose trainable model for learning complex patterns including nonlinear mappings and memory effects from data. Existing physics-informed machine learning methods use neural networks to approximate the solutions of partial differential equations (PDEs). In contrast, our approach directly treats the PDE as a trainable model to obtain general nonlinear mappings that would otherwise require neural networks. As a physics-inspired approach, it offers a more interpretable and parameter-efficient alternative to traditional black-box neural networks, achieving comparable or better accuracy in time series classification tasks while significantly reducing the number of required parameters. Notably, the trained Nonlinear Schr\\\"odinger Network is interpretable, with all parameters having physical meanings as properties of a virtual physical system that transforms the data to a more separable space. This interpretability allows for insight into the underlying dynamics of the data transformation process. Applications to time series forecasting have also been explored. While our current implementation utilizes the NLSE, the proposed method of using physics equations as trainable models to learn nonlinear mappings from data is not limited to the NLSE and may be extended to other master equations of physics.",
    "url": "http://arxiv.org/abs/2407.14504v1",
    "timestamp": 1721361600,
    "domain": "cs.LG",
    "citation_count": 0
  },
  "4483c488-95e2-46b1-9893-17b89e5cbc58": {
    "pk": "4483c488-95e2-46b1-9893-17b89e5cbc58",
    "authors": [
      "Prasenjit Karmakar",
      "Swadhin Pradhan",
      "Sandip Chakraborty"
    ],
    "title": "Indoor Air Quality Dataset with Activities of Daily Living in Low to Middle-income Communities",
    "abstract": "In recent years, indoor air pollution has posed a significant threat to our society, claiming over 3.2 million lives annually. Developing nations, such as India, are most affected since lack of knowledge, inadequate regulation, and outdoor air pollution lead to severe daily exposure to pollutants. However, only a limited number of studies have attempted to understand how indoor air pollution affects developing countries like India. To address this gap, we present spatiotemporal measurements of air quality from 30 indoor sites over six months during summer and winter seasons. The sites are geographically located across four regions of type: rural, suburban, and urban, covering the typical low to middle-income population in India. The dataset contains various types of indoor environments (e.g., studio apartments, classrooms, research laboratories, food canteens, and residential households), and can provide the basis for data-driven learning model research aimed at coping with unique pollution patterns in developing countries. This unique dataset demands advanced data cleaning and imputation techniques for handling missing data due to power failure or network outages during data collection. Furthermore, through a simple speech-to-text application, we provide real-time indoor activity labels annotated by occupants. Therefore, environmentalists and ML enthusiasts can utilize this dataset to understand the complex patterns of the pollutants under different indoor activities, identify recurring sources of pollution, forecast exposure, improve floor plans and room structures of modern indoor designs, develop pollution-aware recommender systems, etc.",
    "url": "http://arxiv.org/abs/2407.14501v1",
    "timestamp": 1721361600,
    "domain": "cs.LG",
    "citation_count": 0
  },
  "4f1d3108-d587-415f-afe7-e31ba0a20c9e": {
    "pk": "4f1d3108-d587-415f-afe7-e31ba0a20c9e",
    "authors": [
      "Sukrut Rao",
      "Sweta Mahajan",
      "Moritz Böhle",
      "Bernt Schiele"
    ],
    "title": "Discover-then-Name: Task-Agnostic Concept Bottlenecks via Automated Concept Discovery",
    "abstract": "Concept Bottleneck Models (CBMs) have recently been proposed to address the 'black-box' problem of deep neural networks, by first mapping images to a human-understandable concept space and then linearly combining concepts for classification. Such models typically require first coming up with a set of concepts relevant to the task and then aligning the representations of a feature extractor to map to these concepts. However, even with powerful foundational feature extractors like CLIP, there are no guarantees that the specified concepts are detectable. In this work, we leverage recent advances in mechanistic interpretability and propose a novel CBM approach -- called Discover-then-Name-CBM (DN-CBM) -- that inverts the typical paradigm: instead of pre-selecting concepts based on the downstream classification task, we use sparse autoencoders to first discover concepts learnt by the model, and then name them and train linear probes for classification. Our concept extraction strategy is efficient, since it is agnostic to the downstream task, and uses concepts already known to the model. We perform a comprehensive evaluation across multiple datasets and CLIP architectures and show that our method yields semantically meaningful concepts, assigns appropriate names to them that make them easy to interpret, and yields performant and interpretable CBMs. Code available at https://github.com/neuroexplicit-saar/discover-then-name.",
    "url": "http://arxiv.org/abs/2407.14499v1",
    "timestamp": 1721361600,
    "domain": "cs.CV",
    "citation_count": 0
  },
  "5e247060-1050-419f-88f1-ea91c154fa9a": {
    "pk": "5e247060-1050-419f-88f1-ea91c154fa9a",
    "authors": [
      "Rohan Gupta",
      "Iván Arcuschin",
      "Thomas Kwa",
      "Adrià Garriga-Alonso"
    ],
    "title": "InterpBench: Semi-Synthetic Transformers for Evaluating Mechanistic Interpretability Techniques",
    "abstract": "Mechanistic interpretability methods aim to identify the algorithm a neural network implements, but it is difficult to validate such methods when the true algorithm is unknown. This work presents InterpBench, a collection of semi-synthetic yet realistic transformers with known circuits for evaluating these techniques. We train these neural networks using a stricter version of Interchange Intervention Training (IIT) which we call Strict IIT (SIIT). Like the original, SIIT trains neural networks by aligning their internal computation with a desired high-level causal model, but it also prevents non-circuit nodes from affecting the model's output. We evaluate SIIT on sparse transformers produced by the Tracr tool and find that SIIT models maintain Tracr's original circuit while being more realistic. SIIT can also train transformers with larger circuits, like Indirect Object Identification (IOI). Finally, we use our benchmark to evaluate existing circuit discovery techniques.",
    "url": "http://arxiv.org/abs/2407.14494v1",
    "timestamp": 1721361600,
    "domain": "cs.LG",
    "citation_count": 0
  },
  "747a73d2-7104-4f78-a1ca-4ca9aa48daf2": {
    "pk": "747a73d2-7104-4f78-a1ca-4ca9aa48daf2",
    "authors": [
      "Yajie Bao",
      "Javad Mohammadpour Velni"
    ],
    "title": "Adaptive Uncertainty Quantification for Scenario-based Control Using Meta-learning of Bayesian Neural Networks",
    "abstract": "Scenario-based optimization and control has proven to be an efficient approach to account for system uncertainty. In particular, the performance of scenario-based model predictive control (MPC) schemes depends on the accuracy of uncertainty quantification. However, current learning- and scenario-based MPC (sMPC) approaches employ a single timeinvariant probabilistic model (learned offline), which may not accurately describe time-varying uncertainties. Instead, this paper presents a model-agnostic meta-learning (MAML) of Bayesian neural networks (BNN) for adaptive uncertainty quantification that would be subsequently used for adaptive-scenario-tree model predictive control design of nonlinear systems with unknown dynamics to enhance control performance. In particular, the proposed approach learns both a global BNN model and an updating law to refine the BNN model. At each time step, the updating law transforms the global BNN model into more precise local BNN models in real time. The adapted local model is then used to generate scenarios for sMPC design at each time step. A probabilistic safety certificate is incorporated in the scenario generation to ensure that the trajectories of the generated scenarios contain the real trajectory of the system and that all the scenarios adhere to the constraints with a high probability. Experiments using closed-loop simulations of a numerical example demonstrate that the proposed approach can improve the performance of scenario-based MPC compared to using only one BNN model learned offline for all time steps.",
    "url": "http://arxiv.org/abs/2407.14492v1",
    "timestamp": 1721361600,
    "domain": "eess.SY",
    "citation_count": 0
  },
  "4bfbcef7-ea8e-4de3-b393-a24784db9f5b": {
    "pk": "4bfbcef7-ea8e-4de3-b393-a24784db9f5b",
    "authors": [
      "Meng Wang",
      "Bo Fang",
      "Ang Li",
      "Prashant Nair"
    ],
    "title": "Red-QAOA: Efficient Variational Optimization through Circuit Reduction",
    "abstract": "The Quantum Approximate Optimization Algorithm (QAOA) addresses combinatorial optimization challenges by converting inputs to graphs. However, the optimal parameter searching process of QAOA is greatly affected by noise. Larger problems yield bigger graphs, requiring more qubits and making their outcomes highly noise-sensitive. This paper introduces Red-QAOA, leveraging energy landscape concentration via a simulated annealing-based graph reduction.   Red-QAOA creates a smaller (distilled) graph with nearly identical parameters to the original graph. The distilled graph produces a smaller quantum circuit and thus reduces noise impact. At the end of the optimization, Red-QAOA employs the parameters from the distilled graph on the original graph and continues the parameter search on the original graph. Red-QAOA outperforms state-of-the-art Graph Neural Network (GNN)-based pooling techniques on 3200 real-world problems. Red-QAOA reduced node and edge counts by 28% and 37%, respectively, with a mean square error of only 2%.",
    "url": "http://arxiv.org/abs/2407.14490v1",
    "timestamp": 1721361600,
    "domain": "quant-ph",
    "citation_count": 0
  },
  "e6f3389e-9806-4be2-a893-984b12694c17": {
    "pk": "e6f3389e-9806-4be2-a893-984b12694c17",
    "authors": [
      "Alejandra de la Rica Escudero",
      "Eduardo C. Garrido-Merchan",
      "Maria Coronado-Vaca"
    ],
    "title": "Explainable Post hoc Portfolio Management Financial Policy of a Deep Reinforcement Learning agent",
    "abstract": "Financial portfolio management investment policies computed quantitatively by modern portfolio theory techniques like the Markowitz model rely on a set on assumptions that are not supported by data in high volatility markets. Hence, quantitative researchers are looking for alternative models to tackle this problem. Concretely, portfolio management is a problem that has been successfully addressed recently by Deep Reinforcement Learning (DRL) approaches. In particular, DRL algorithms train an agent by estimating the distribution of the expected reward of every action performed by an agent given any financial state in a simulator. However, these methods rely on Deep Neural Networks model to represent such a distribution, that although they are universal approximator models, they cannot explain its behaviour, given by a set of parameters that are not interpretable. Critically, financial investors policies require predictions to be interpretable, so DRL agents are not suited to follow a particular policy or explain their actions. In this work, we developed a novel Explainable Deep Reinforcement Learning (XDRL) approach for portfolio management, integrating the Proximal Policy Optimization (PPO) with the model agnostic explainable techniques of feature importance, SHAP and LIME to enhance transparency in prediction time. By executing our methodology, we can interpret in prediction time the actions of the agent to assess whether they follow the requisites of an investment policy or to assess the risk of following the agent suggestions. To the best of our knowledge, our proposed approach is the first explainable post hoc portfolio management financial policy of a DRL agent. We empirically illustrate our methodology by successfully identifying key features influencing investment decisions, which demonstrate the ability to explain the agent actions in prediction time.",
    "url": "http://arxiv.org/abs/2407.14486v1",
    "timestamp": 1721361600,
    "domain": "cs.CE",
    "citation_count": 0
  },
  "6b9f89f4-6b3e-4d2a-a5e8-45d884ef8edc": {
    "pk": "6b9f89f4-6b3e-4d2a-a5e8-45d884ef8edc",
    "authors": [
      "Xiaotong Sun",
      "Peijie Qiu",
      "Shengfan Zhang"
    ],
    "title": "SurvReLU: Inherently Interpretable Survival Analysis via Deep ReLU Networks",
    "abstract": "Survival analysis models time-to-event distributions with censorship. Recently, deep survival models using neural networks have dominated due to their representational power and state-of-the-art performance. However, their \"black-box\" nature hinders interpretability, which is crucial in real-world applications. In contrast, \"white-box\" tree-based survival models offer better interpretability but struggle to converge to global optima due to greedy expansion. In this paper, we bridge the gap between previous deep survival models and traditional tree-based survival models through deep rectified linear unit (ReLU) networks. We show that a deliberately constructed deep ReLU network (SurvReLU) can harness the interpretability of tree-based structures with the representational power of deep survival models. Empirical studies on both simulated and real survival benchmark datasets show the effectiveness of the proposed SurvReLU in terms of performance and interoperability. The code is available at \\href{https://github.com/xs018/SurvReLU}{\\color{magenta}{ https://github.com/xs018/SurvReLU}}.",
    "url": "http://arxiv.org/abs/2407.14463v1",
    "timestamp": 1721361600,
    "domain": "cs.LG",
    "citation_count": 0
  },
  "470ea968-4098-44b3-bf7b-98b09f05b523": {
    "pk": "470ea968-4098-44b3-bf7b-98b09f05b523",
    "authors": [
      "Jiahong Ma",
      "Mingguo He",
      "Zhewei Wei"
    ],
    "title": "PolyFormer: Scalable Node-wise Filters via Polynomial Graph Transformer",
    "abstract": "Spectral Graph Neural Networks have demonstrated superior performance in graph representation learning. However, many current methods focus on employing shared polynomial coefficients for all nodes, i.e., learning node-unified filters, which limits the filters' flexibility for node-level tasks. The recent DSF attempts to overcome this limitation by learning node-wise coefficients based on positional encoding. However, the initialization and updating process of the positional encoding are burdensome, hindering scalability on large-scale graphs. In this work, we propose a scalable node-wise filter, PolyAttn. Leveraging the attention mechanism, PolyAttn can directly learn node-wise filters in an efficient manner, offering powerful representation capabilities. Building on PolyAttn, we introduce the whole model, named PolyFormer. In the lens of Graph Transformer models, PolyFormer, which calculates attention scores within nodes, shows great scalability. Moreover, the model captures spectral information, enhancing expressiveness while maintaining efficiency. With these advantages, PolyFormer offers a desirable balance between scalability and expressiveness for node-level tasks. Extensive experiments demonstrate that our proposed methods excel at learning arbitrary node-wise filters, showing superior performance on both homophilic and heterophilic graphs, and handling graphs containing up to 100 million nodes. The code is available at https://github.com/air029/PolyFormer.",
    "url": "http://arxiv.org/abs/2407.14459v1",
    "timestamp": 1721361600,
    "domain": "cs.LG",
    "citation_count": 0
  },
  "88e69774-baaf-490f-9661-b01383abc03b": {
    "pk": "88e69774-baaf-490f-9661-b01383abc03b",
    "authors": [
      "Yasushi Yoneta"
    ],
    "title": "Thermal pure states for systems with antiunitary symmetries and their tensor network representations",
    "abstract": "Thermal pure state algorithms, which employ pure quantum states representing thermal equilibrium states instead of statistical ensembles, are useful both for numerical simulations and for theoretical analysis of thermal states. However, their inherently large entanglement makes it difficult to represent efficiently and limits their use in analyzing large systems. Here, we propose a new algorithm for constructing thermal pure states for systems with certain antiunitary symmetries, such as time-reversal or complex conjugation symmetry. Our method utilizes thermal pure states that, while exhibiting volume-law entanglement, can be mapped to tensor network states through simple transformations. Furthermore, our approach does not rely on random sampling and thus avoids statistical uncertainty. Moreover, we can compute not only thermal expectation values of local observables but also thermodynamic functions. We demonstrate the validity and utility of our method by applying it to the one-dimensional XY model and the two-dimensional Ising model on a triangular lattice. Our results suggest a new class of variational wave functions for volume-law states that are not limited to thermal equilibrium states.",
    "url": "http://arxiv.org/abs/2407.14454v1",
    "timestamp": 1721361600,
    "domain": "cond-mat.stat-mech",
    "citation_count": 0
  }
}
