{
  "a61df753-12e2-44a0-83c3-dc0d7d00d16d": {
    "pk": "a61df753-12e2-44a0-83c3-dc0d7d00d16d",
    "title": "LLMs Meet Multimodal Generation and Editing: A Survey",
    "abstract": "With the recent advancement in large language models (LLMs), there is a growing interest in combining LLMs with multimodal learning. Previous surveys of multimodal large language models (MLLMs) mainly focus on understanding. This survey elaborates on multimodal generation across different domains, including image, video, 3D, and audio, where we highlight the notable advancements with milestone works in these fields. Specifically, we exhaustively investigate the key technical components behind methods and multimodal datasets utilized in these studies. Moreover, we dig into tool-augmented multimodal agents that can use existing generative models for human-computer interaction. Lastly, we also comprehensively discuss the advancement in AI safety and investigate emerging applications as well as future prospects. Our work provides a systematic and insightful overview of multimodal generation, which is expected to advance the development of Artificial Intelligence for Generative Content (AIGC) and world models. A curated list of all related papers can be found at https://github.com/YingqingHe/Awesome-LLMs-meet-Multimodal-Generation",
    "authors": [
      "Yingqing He",
      "Zhaoyang Liu",
      "Jingye Chen",
      "Zeyue Tian",
      "Hongyu Liu",
      "Xiaowei Chi",
      "Runtao Liu",
      "Ruibin Yuan",
      "Yazhou Xing",
      "Wenhai Wang",
      "Jifeng Dai",
      "Yong Zhang",
      "Wei Xue",
      "Qifeng Liu",
      "Yike Guo",
      "Qifeng Chen"
    ],
    "url": "http://arxiv.org/abs/2405.19334v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.AI",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "ce12695f-28b6-4ed6-9dc7-471689cd7123": {
    "pk": "ce12695f-28b6-4ed6-9dc7-471689cd7123",
    "title": "Ion Correlation-Driven Hysteretic Adhesion and Repulsion between Opposing Polyelectrolyte Brushes",
    "abstract": "Surface interactions mediated by polyelectrolyte (PE) brushes has been of great significance in biotechnology and nanotechnology including lubrication of skeletal joints, protein-coated surfaces, and stabilization of nanoparticles. The addition of salt ions is an important tool to modulate the morphology and mechanical properties of PE brushes. In this work, the electrostatic correlation augmented self-consistent field theory we previously developed is applied to investigate the interactions between opposing PE brushes in a mixture of 1:1 and 3:1 salt solutions. Our theory predicts that adding a small amount of trivalent ions can lead to a hysteretic feature of the force profile: repulsion in the compression and adhesion in the separation. Coexistence of two collapsed modes of PE brushes induced by strong ion correlations can be obtained, clearly elucidating the molecular origin of the hysteretic force. Furthermore, trivalent ions with larger radius induce less pronounced ion correlation, leading to stronger repulsion in the compression and weaker adhesion in the separation. Our results are in good agreement with the experiments reported by Tirrell group.",
    "authors": [
      "Chao Duan",
      "Rui Wang"
    ],
    "url": "http://arxiv.org/abs/2405.19329v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cond-mat.soft",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "41e6c14a-d8ee-4787-becf-3582ee92c01b": {
    "pk": "41e6c14a-d8ee-4787-becf-3582ee92c01b",
    "title": "Normative Modules: A Generative Agent Architecture for Learning Norms that Supports Multi-Agent Cooperation",
    "abstract": "Generative agents, which implement behaviors using a large language model (LLM) to interpret and evaluate an environment, has demonstrated the capacity to solve complex tasks across many social and technological domains. However, when these agents interact with other agents and humans in presence of social structures such as existing norms, fostering cooperation between them is a fundamental challenge. In this paper, we develop the framework of a 'Normative Module': an architecture designed to enhance cooperation by enabling agents to recognize and adapt to the normative infrastructure of a given environment. We focus on the equilibrium selection aspect of the cooperation problem and inform our agent design based on the existence of classification institutions that implement correlated equilibrium to provide effective resolution of the equilibrium selection problem. Specifically, the normative module enables agents to learn through peer interactions which of multiple candidate institutions in the environment, does a group treat as authoritative. By enabling normative competence in this sense, agents gain ability to coordinate their sanctioning behaviour; coordinated sanctioning behaviour in turn shapes primary behaviour within a social environment, leading to higher average welfare. We design a new environment that supports institutions and evaluate the proposed framework based on two key criteria derived from agent interactions with peers and institutions: (i) the agent's ability to disregard non-authoritative institutions and (ii) the agent's ability to identify authoritative institutions among several options. We show that these capabilities allow the agent to achieve more stable cooperative outcomes compared to baseline agents without the normative module, paving the way for research in a new avenue of designing environments and agents that account for normative infrastructure.",
    "authors": [
      "Atrisha Sarkar",
      "Andrei Ioan Muresanu",
      "Carter Blair",
      "Aaryam Sharma",
      "Rakshit S Trivedi",
      "Gillian K Hadfield"
    ],
    "url": "http://arxiv.org/abs/2405.19328v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.MA",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "7778af17-a352-483c-943c-531500feaca9": {
    "pk": "7778af17-a352-483c-943c-531500feaca9",
    "title": "Reasoning3D -- Grounding and Reasoning in 3D: Fine-Grained Zero-Shot Open-Vocabulary 3D Reasoning Part Segmentation via Large Vision-Language Models",
    "abstract": "In this paper, we introduce a new task: Zero-Shot 3D Reasoning Segmentation for parts searching and localization for objects, which is a new paradigm to 3D segmentation that transcends limitations for previous category-specific 3D semantic segmentation, 3D instance segmentation, and open-vocabulary 3D segmentation. We design a simple baseline method, Reasoning3D, with the capability to understand and execute complex commands for (fine-grained) segmenting specific parts for 3D meshes with contextual awareness and reasoned answers for interactive segmentation. Specifically, Reasoning3D leverages an off-the-shelf pre-trained 2D segmentation network, powered by Large Language Models (LLMs), to interpret user input queries in a zero-shot manner. Previous research have shown that extensive pre-training endows foundation models with prior world knowledge, enabling them to comprehend complex commands, a capability we can harness to \"segment anything\" in 3D with limited 3D datasets (source efficient). Experimentation reveals that our approach is generalizable and can effectively localize and highlight parts of 3D objects (in 3D mesh) based on implicit textual queries, including these articulated 3d objects and real-world scanned data. Our method can also generate natural language explanations corresponding to these 3D models and the decomposition. Moreover, our training-free approach allows rapid deployment and serves as a viable universal baseline for future research of part-level 3d (semantic) object understanding in various fields including robotics, object manipulation, part assembly, autonomous driving applications, augment reality and virtual reality (AR/VR), and medical applications. The code, the model weight, the deployment guide, and the evaluation protocol are: http://tianrun-chen.github.io/Reason3D/",
    "authors": [
      "Tianrun Chen",
      "Chunan Yu",
      "Jing Li",
      "Jianqi Zhang",
      "Lanyun Zhu",
      "Deyi Ji",
      "Yong Zhang",
      "Ying Zang",
      "Zejian Li",
      "Lingyun Sun"
    ],
    "url": "http://arxiv.org/abs/2405.19326v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "d69b198e-988f-44e6-94e3-a2c8cf1d004a": {
    "pk": "d69b198e-988f-44e6-94e3-a2c8cf1d004a",
    "title": "Uniform-in-time estimates on the size of chaos for interacting Brownian particles",
    "abstract": "We consider a system of classical Brownian particles interacting via a smooth long-range potential in the mean-field regime, and we analyze the propagation of chaos in form of sharp, uniform-in-time estimates on many-particle correlation functions. Our results cover both the kinetic Langevin setting and the corresponding overdamped Brownian dynamics. The approach is mainly based on so-called Lions expansions, which we combine with new diagrammatic tools to capture many-particle cancellations, as well as with fine ergodic estimates on the linearized mean-field equation, and with discrete stochastic calculus with respect to initial data. In the process, we derive some new ergodic estimates for the linearized Vlasov-Fokker-Planck kinetic equation that are of independent interest. Our analysis also leads to uniform-in-time concentration estimates and to a uniform-in-time quantitative central limit theorem for the empirical measure associated with the particle dynamics.",
    "authors": [
      "Armand Bernou",
      "Mitia Duerinckx"
    ],
    "url": "http://arxiv.org/abs/2405.19306v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "math.AP",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "9a751627-4985-4bb8-bc93-d8908eaf7127": {
    "pk": "9a751627-4985-4bb8-bc93-d8908eaf7127",
    "title": "Safe and Efficient Estimation for Robotics through the Optimal Use of Resources",
    "abstract": "In order to operate in and interact with the physical world, robots need to have estimates of the current and future state of the environment. We thus equip robots with sensors and build models and algorithms that, given some measurements, produce estimates of the current or future states. Environments can be unpredictable and sensors are not perfect. Therefore, it is important to both use all information available, and to do so optimally: making sure that we get the best possible answer from the amount of information we have. However, in prevalent research, uncommon sensors, such as sound or radio-frequency signals, are commonly ignored for state estimation; and the most popular solvers employed to produce state estimates are only of local nature, meaning they may produce suboptimal estimates for the typically non-convex estimation problems. My research aims to use resources more optimally, by building on 1) multi-modality: using ubiquitous RF transceivers and microphones to support state estimation, 2) building certifiably optimal solvers and 3) learning and improving adequate models from data.",
    "authors": [
      "Frederike Dümbgen"
    ],
    "url": "http://arxiv.org/abs/2405.19301v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.RO",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "e7a29da9-b60e-4b85-97cb-73338ea0e8dd": {
    "pk": "e7a29da9-b60e-4b85-97cb-73338ea0e8dd",
    "title": "Fault-tolerant simulation of Lattice Gauge Theories with gauge covariant codes",
    "abstract": "We show in this paper that a strong and easy connection exists between quantum error correction and Lattice Gauge Theories (LGT) by using the Gauge symmetry to construct an efficient error-correcting code for Abelian LGTs. We identify the logical operations on this gauge covariant code and show that the corresponding Hamiltonian can be expressed in terms of these logical operations while preserving the locality of the interactions. Furthermore, we demonstrate that these substitutions actually give a new way of writing the LGT as an equivalent hardcore boson model. Finally we demonstrate a method to perform fault-tolerant time evolution of the Hamiltonian within the gauge covariant code using both product formulas and qubitization approaches. This opens up the possibility of inexpensive end to end dynamical simulations that save physical qubits by blurring the lines between simulation algorithms and quantum error correcting codes.",
    "authors": [
      "L. Spagnoli",
      "A. Roggero",
      "N. Wiebe"
    ],
    "url": "http://arxiv.org/abs/2405.19293v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "quant-ph",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "0097c2f1-81af-4c17-8669-ef8dc3eb1f4b": {
    "pk": "0097c2f1-81af-4c17-8669-ef8dc3eb1f4b",
    "title": "Act Natural! Projecting Autonomous System Trajectories Into Naturalistic Behavior Sets",
    "abstract": "Autonomous agents operating around human actors must consider how their behaviors might affect those humans, even when not directly interacting with them. To this end, it is often beneficial to be predictable and appear naturalistic. Existing methods to address this problem use human actor intent modeling or imitation learning techniques, but these approaches rarely capture all possible motivations for human behavior or require significant amounts of data. In contrast, we propose a technique for modeling naturalistic behavior as a set of convex hulls computed over a relatively small dataset of human behavior. Given this set, we design an optimization-based filter which projects arbitrary trajectories into it to make them more naturalistic for autonomous agents to execute while also satisfying dynamics constraints. We demonstrate our methods on real-world human driving data from the inD intersection dataset (Bock et al., 2020).",
    "authors": [
      "Hamzah I. Khan",
      "Adam J. Thorpe",
      "David Fridovich-Keil"
    ],
    "url": "http://arxiv.org/abs/2405.19292v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.MA",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "1b714279-ef0e-4300-98f8-5880266e3d36": {
    "pk": "1b714279-ef0e-4300-98f8-5880266e3d36",
    "title": "Grasp as You Say: Language-guided Dexterous Grasp Generation",
    "abstract": "This paper explores a novel task \"\"Dexterous Grasp as You Say\"\" (DexGYS), enabling robots to perform dexterous grasping based on human commands expressed in natural language. However, the development of this field is hindered by the lack of datasets with natural human guidance; thus, we propose a language-guided dexterous grasp dataset, named DexGYSNet, offering high-quality dexterous grasp annotations along with flexible and fine-grained human language guidance. Our dataset construction is cost-efficient, with the carefully-design hand-object interaction retargeting strategy, and the LLM-assisted language guidance annotation system. Equipped with this dataset, we introduce the DexGYSGrasp framework for generating dexterous grasps based on human language instructions, with the capability of producing grasps that are intent-aligned, high quality and diversity. To achieve this capability, our framework decomposes the complex learning process into two manageable progressive objectives and introduce two components to realize them. The first component learns the grasp distribution focusing on intention alignment and generation diversity. And the second component refines the grasp quality while maintaining intention consistency. Extensive experiments are conducted on DexGYSNet and real world environment for validation.",
    "authors": [
      "Yi-Lin Wei",
      "Jian-Jian Jiang",
      "Chengyi Xing",
      "Xiantuo Tan",
      "Xiao-Ming Wu",
      "Hao Li",
      "Mark Cutkosky",
      "Wei-Shi Zheng"
    ],
    "url": "http://arxiv.org/abs/2405.19291v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.RO",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "562483a6-24af-45d5-ba8c-f4ac619d6385": {
    "pk": "562483a6-24af-45d5-ba8c-f4ac619d6385",
    "title": "Programmable Motion Generation for Open-Set Motion Control Tasks",
    "abstract": "Character animation in real-world scenarios necessitates a variety of constraints, such as trajectories, key-frames, interactions, etc. Existing methodologies typically treat single or a finite set of these constraint(s) as separate control tasks. They are often specialized, and the tasks they address are rarely extendable or customizable. We categorize these as solutions to the close-set motion control problem. In response to the complexity of practical motion control, we propose and attempt to solve the open-set motion control problem. This problem is characterized by an open and fully customizable set of motion control tasks. To address this, we introduce a new paradigm, programmable motion generation. In this paradigm, any given motion control task is broken down into a combination of atomic constraints. These constraints are then programmed into an error function that quantifies the degree to which a motion sequence adheres to them. We utilize a pre-trained motion generation model and optimize its latent code to minimize the error function of the generated motion. Consequently, the generated motion not only inherits the prior of the generative model but also satisfies the required constraints. Experiments show that we can generate high-quality motions when addressing a wide range of unseen tasks. These tasks encompass motion control by motion dynamics, geometric constraints, physical laws, interactions with scenes, objects or the character own body parts, etc. All of these are achieved in a unified approach, without the need for ad-hoc paired training data collection or specialized network designs. During the programming of novel tasks, we observed the emergence of new skills beyond those of the prior model. With the assistance of large language models, we also achieved automatic programming. We hope that this work will pave the way for the motion control of general AI agents.",
    "authors": [
      "Hanchao Liu",
      "Xiaohang Zhan",
      "Shaoli Huang",
      "Tai-Jiang Mu",
      "Ying Shan"
    ],
    "url": "http://arxiv.org/abs/2405.19283v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "d0b4904a-1552-4fb4-8ab4-9aa623306e60": {
    "pk": "d0b4904a-1552-4fb4-8ab4-9aa623306e60",
    "title": "The Future of Child Development in the AI Era. Cross-Disciplinary Perspectives Between AI and Child Development Experts",
    "abstract": "This report explores the potential implications of rapidly integrating Artificial Intelligence (AI) applications into children's environments. The introduction of AI in our daily lives necessitates scrutiny considering the significant role of the environment in shaping cognition, socio-emotional skills, and behaviors, especially during the first 25 years of cerebral development. As AI becomes prevalent in educational and leisure activities, it will significantly modify the experiences of children and adolescents, presenting both challenges and opportunities for their developmental trajectories. This analysis was informed by consulting with 15 experts from pertinent disciplines (AI, product development, child development, and neurosciences), along with a comprehensive review of scientific literature on children development and child-technology interactions. Overall, AI experts anticipate that AI will transform leisure activities, revolutionize education, and redefine human-machine interactions. While AI offers substantial benefits in fostering interactive engagement, it also poses risks that require careful considerations, especially during sensitive developmental periods. The report advocates for proactive international collaboration across multiple disciplines and increased research into how technological innovations affect child development. Such efforts are crucial for designing a sustainable and ethical future for the next generation through specific child-centered regulations, and helping to educate all potential stakeholders (regulators, developers, parents and educators, children) about responsible AI use and its potential impacts on child development.",
    "authors": [
      "Mathilde Neugnot-Cerioli",
      "Olga Muss Laurenty"
    ],
    "url": "http://arxiv.org/abs/2405.19275v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.HC",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "0d4062fa-e35e-43ef-a7bd-c1642bdf938c": {
    "pk": "0d4062fa-e35e-43ef-a7bd-c1642bdf938c",
    "title": "Detecting the Stochastic Gravitational Wave Background from Primordial Black Holes in Slow-reheating Scenarios",
    "abstract": "After primordial inflation, the universe may have experienced a prolonged reheating epoch, potentially leading to a phase of matter domination supported by the oscillating inflaton field. During such an epoch, perturbations in the inflaton virialize upon reentering the cosmological horizon, forming inflaton structures. If the primordial overdensities are sufficiently large, these structures collapse to form primordial black holes (PBHs). To occur at a significant rate, this process requires an enhanced primordial power spectrum (PPS) at small scales. The enhancement of the PPS, as well as the formation and tidal interaction of the primordial structures, will in turn source a stochastic gravitational wave background(SGWB) that could be detected by current and/or future gravitational wave detectors. In this paper, we study the SGWB arising from these different sources during slow-reheating, focusing on a PPS that satisfies the requirements necessary for the formation of PBHs with a mass of $M_{\\rm PBH}\\simeq 10^{21}$ and that constitute the entirety of dark matter in the universe.",
    "authors": [
      "Luis E. Padilla",
      "Juan Carlos Hidalgo",
      "Karim A. Malik",
      "David Mulryne"
    ],
    "url": "http://arxiv.org/abs/2405.19271v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "astro-ph.CO",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "fa003848-1652-4ed3-855c-c85efe7e44be": {
    "pk": "fa003848-1652-4ed3-855c-c85efe7e44be",
    "title": "Photonic bilayer Chern insulator with corner states",
    "abstract": "Photonic Chern insulators can be implemented in gyromagnetic photonic crystals with broken time-reversal (TR) symmetry. They exhibit gapless chiral edge states (CESs), enabling unidirectional propagation and demonstrating exceptional resilience to localization even in the presence of defects or disorders. However, when two Chern insulators with opposite Chern numbers are stacked together, this one-way nature can be nullified, causing the originally gapless CESs to become gapped. Recent theoretical works have proposed achieving such a topological phase transition in condensed matter systems using antiferromagnetic thin films such as MnBi2Te4 or by coupling two quantum spin/anomalous Hall insulators, but these approaches have yet to be realized experimentally. In a bilayer gyromagnetic photonic crystal arranged in an antiferromagnetic layer configuration, our experimental observations reveal that interlayer coupling initiates a transition from a Chern insulating phase to a higher-order topological phase. This transition results in the gapping of CESs and triggers the emergence of corner states within the bandgap. The corner mode energy within the gap can be attributed to CESs interaction, forming a Jackiw-Rebbi topological domain wall mode at the corner. These states exhibit heightened resilience against defects, setting them apart from their time-reversal symmetric counterparts.",
    "authors": [
      "Subhaskar Mandal",
      "Ziyao Wang",
      "Rimi Banerjee",
      "Hau Tian Teo",
      "Peiheng Zhou",
      "Xiang Xi",
      "Zhen Gao",
      "Gui-Geng Liu",
      "Baile Zhang"
    ],
    "url": "http://arxiv.org/abs/2405.19267v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cond-mat.mes-hall",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "962e690c-2039-4edd-9646-274fd15e8efa": {
    "pk": "962e690c-2039-4edd-9646-274fd15e8efa",
    "title": "Dark matter admixed neutron stars with a realistic nuclear equation of state from chiral nuclear interactions",
    "abstract": "We study the effects of dark matter on the structural properties of neutron stars. In particular we investigate how the presence of a dark matter component influences the mass-radius relation, the value of the maximum mass of a neutron star and others stellar properties. To model ordinary matter we use a state-of-the-art equation of state of $\\beta$-stable nuclear matter obtained using the Brueckner-Hartree-Fock quantum many-body approach starting from two-body and three-body nuclear interactions derived from chiral effective field theory. The dark matter component of the star is modeled as a non-self-annihilating system of spin $1/2$ fermions and its equation of state as an ideal relativistic Fermi gas. The equilibrium configurations of these dark matter admixed neutron stars (DANS) are calculated by solving a generalization of the Tolman-Oppenheimer-Volkoff equations to the case where the system consists of two perfect fluids interacting solely through gravity. We find that, depending on the dark matter particle mass $m_\\chi$, one can have somehow opposite effects on the stellar properties. In the case $m_\\chi = 1\\, \\mathrm{GeV}$, the stellar gravitational maximum mass $M_{max}$ decreases, whereas in the case $m_\\chi = 0.1\\, \\mathrm{GeV}$, $M_{max}$ increases with respect to the maximum mass of ordinary neutron stars. We also show that the presence of dark matter has indirect sizeable effect on the proton fraction in the ordinary matter fluid and, in the case $m_\\chi = 1\\, \\mathrm{GeV}$, results in a decrease of the threshold gravitational mass $M_{tot}^{durca}$ for having direct URCA processes and fast stellar cooling. Finally we study the stability of dark matter admixed neutron stars with respect to radial perturbations.",
    "authors": [
      "Domenico Scordino",
      "Ignazio Bombaci"
    ],
    "url": "http://arxiv.org/abs/2405.19251v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "astro-ph.HE",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "751fdfe7-3a71-4299-b438-fd2b04f88df6": {
    "pk": "751fdfe7-3a71-4299-b438-fd2b04f88df6",
    "title": "Efficient Optimal Control of Open Quantum Systems",
    "abstract": "The optimal control problem for open quantum systems can be formulated as a time-dependent Lindbladian that is parameterized by a number of time-dependent control variables. Given an observable and an initial state, the goal is to tune the control variables so that the expected value of some observable with respect to the final state is maximized. In this paper, we present algorithms for solving this optimal control problem efficiently, i.e., having a poly-logarithmic dependency on the system dimension, which is exponentially faster than best-known classical algorithms. Our algorithms are hybrid, consisting of both quantum and classical components. The quantum procedure simulates time-dependent Lindblad evolution that drives the initial state to the final state, and it also provides access to the gradients of the objective function via quantum gradient estimation. The classical procedure uses the gradient information to update the control variables.   At the technical level, we provide the first (to the best of our knowledge) simulation algorithm for time-dependent Lindbladians with an $\\ell_1$-norm dependence. As an alternative, we also present a simulation algorithm in the interaction picture to improve the algorithm for the cases where the time-independent component of a Lindbladian dominates the time-dependent part. On the classical side, we heavily adapt the state-of-the-art classical optimization analysis to interface with the quantum part of our algorithms. Both the quantum simulation techniques and the classical optimization analyses might be of independent interest.",
    "authors": [
      "Wenhao He",
      "Tongyang Li",
      "Xiantao Li",
      "Zecheng Li",
      "Chunhao Wang",
      "Ke Wang"
    ],
    "url": "http://arxiv.org/abs/2405.19245v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "quant-ph",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "34c8a900-8036-4abd-babe-6b3ab9dd6323": {
    "pk": "34c8a900-8036-4abd-babe-6b3ab9dd6323",
    "title": "Modeling public opinion control by a charismatic leader",
    "abstract": "We study the average long-time behavior of the binary opinions of a social group with peer-to-peer interactions under the influence of an external bias and a persuadable leader, a strongly-biased agent with a dynamic opinion with the intention of spreading it across the system. We use a generalized, fully-connected Ising model, with each spin representing the binary opinion of an agent at a given time and a single, super spin representing the opinion of the leader. External fields and interaction constants model the opinion bias and peer-to-peer interactions, respectively, while the temperature $T$ models an idealized social climate, representing an authoritarian regime if $T$ is low or a liberal one if $T$ is high. We derive a mean-field solution for the average magnetization $m$, the \"social mood\", and investigate how $m$ and the super spin magnetization vary as a function of $T$. We find that, depending on the initial conditions, due to the presence of metastable states, the sign of the average magnetization depends on the temperature. Finally, we verify that this effect is also present even if we consider only nearest-neighbor interactions within the social group.",
    "authors": [
      "Tiago S. A. N. Simões",
      "Antonio Coniglio",
      "Hans J. Herrmann",
      "Lucilla de Arcangelis"
    ],
    "url": "http://arxiv.org/abs/2405.19242v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cond-mat.stat-mech",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "e9373b9d-d36a-44ec-8cf6-e2920762897e": {
    "pk": "e9373b9d-d36a-44ec-8cf6-e2920762897e",
    "title": "Detection of entanglement by harnessing extracted work in an opto-magno-mechanics",
    "abstract": "The connections between thermodynamics and quantum information processing are of paramount importance. Here, we address a bipartite entanglement via extracted work in a cavity magnomechanical system contained inside an yttrium iron garnet (YIG) sphere. The photons and magnons interact through an interaction between magnetic dipoles. A magnetostrictive interaction, analogous to radiation pressure, couple's phonons and magnons. The extracted work was obtained through a device similar to the Szil\\'ard engine. This engine operates by manipulating the photon-magnon as a bipartite quantum state. We employ logarithmic negativity to measure the amount of entanglement between photon and magnon modes in steady and dynamical states. We explore the extracted work, separable work, and maximum work for squeezed thermal states. We investigate the amount of work extracted from a bipartite quantum state, which can potentially determine the degree of entanglement present in that state. Numerical studies show that entanglement, as detected by the extracted work and quantified by logarithmic negativity, is in good agreement. We show the reduction of extracted work by a second measurement compared to a single measurement. Also, the efficiency of the Szilard engine in steady and dynamical states is investigated. We hope this work is of paramount importance in quantum information processing.",
    "authors": [
      "M'bark Amghar",
      "Mohamed Amazioug"
    ],
    "url": "http://arxiv.org/abs/2405.19205v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "quant-ph",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "7a92bf89-f08b-406c-9253-0a8f71a359cd": {
    "pk": "7a92bf89-f08b-406c-9253-0a8f71a359cd",
    "title": "Collapse/expansion dynamics and actuation of pH-responsive nanogels",
    "abstract": "Polyelectrolyte (PE) hydrogels can dynamically respond to external stimuli, such as changes in pH and temperature, which benefits their use for smart materials and nanodevices with tunable properties. We investigate equilibrium conformations and phase transition dynamics of pH-responsive nanogels using hybrid molecular dynamics/Monte Carlo simulations with full consideration of electrostatic and hydrodynamic interactions. We demonstrate that PE nanogels exhibit a closed-loop phase behavior with a discontinuous swelling--collapse transition that occurs only at intermediate pH values. A 50~nm nanogel particle close to a critical point functions as a pH-driven actuator with a microsecond conformational response and work density $\\approx 10^5~\\mathrm{J/m}^3$, an order of magnitude larger than skeletal muscles. The collapse/expansion time scales as $L^{2}$ and the power density scales as $L^{-2}$ where $L$ is the linear size of the gel. Our work provides fundamental insight into phase behavior and non-equilibrium dynamics of the swelling--collapse transition, and our method enables the investigation of charge--structure--hydrodynamic coupling in soft materials.",
    "authors": [
      "Jiaxing Yuan",
      "Tine Curk"
    ],
    "url": "http://arxiv.org/abs/2405.19193v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cond-mat.soft",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "856a5261-d9b5-4399-9198-ca5ceb90e426": {
    "pk": "856a5261-d9b5-4399-9198-ca5ceb90e426",
    "title": "Diffusion-based Dynamics Models for Long-Horizon Rollout in Offline Reinforcement Learning",
    "abstract": "With the great success of diffusion models (DMs) in generating realistic synthetic vision data, many researchers have investigated their potential in decision-making and control. Most of these works utilized DMs to sample directly from the trajectory space, where DMs can be viewed as a combination of dynamics models and policies. In this work, we explore how to decouple DMs' ability as dynamics models in fully offline settings, allowing the learning policy to roll out trajectories. As DMs learn the data distribution from the dataset, their intrinsic policy is actually the behavior policy induced from the dataset, which results in a mismatch between the behavior policy and the learning policy. We propose Dynamics Diffusion, short as DyDiff, which can inject information from the learning policy to DMs iteratively. DyDiff ensures long-horizon rollout accuracy while maintaining policy consistency and can be easily deployed on model-free algorithms. We provide theoretical analysis to show the advantage of DMs on long-horizon rollout over models and demonstrate the effectiveness of DyDiff in the context of offline reinforcement learning, where the rollout dataset is provided but no online environment for interaction. Our code is at https://github.com/FineArtz/DyDiff.",
    "authors": [
      "Hanye Zhao",
      "Xiaoshen Han",
      "Zhengbang Zhu",
      "Minghuan Liu",
      "Yong Yu",
      "Weinan Zhang"
    ],
    "url": "http://arxiv.org/abs/2405.19189v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "92597710-ea60-4062-87da-f498632d67fe": {
    "pk": "92597710-ea60-4062-87da-f498632d67fe",
    "title": "Personalized Interiors at Scale: Leveraging AI for Efficient and Customizable Design Solutions",
    "abstract": "In this paper, we introduce an innovative application of artificial intelligence in the realm of interior design through the integration of Stable Diffusion and Dreambooth models. This paper explores the potential of these advanced generative models to streamline and democratize the process of room interior generation, offering a significant departure from conventional, labor-intensive techniques. Our approach leverages the capabilities of Stable Diffusion for generating high-quality images and Dreambooth for rapid customization with minimal training data, addressing the need for efficiency and personalization in the design industry. We detail a comprehensive methodology that combines these models, providing a robust framework for the creation of tailored room interiors that reflect individual tastes and functional requirements. We presents an extensive evaluation of our method, supported by experimental results that demonstrate its effectiveness and a series of case studies that illustrate its practical application in interior design projects. Our study contributes to the ongoing discourse on the role of AI in creative fields, highlighting the benefits of leveraging generative models to enhance creativity and reshape the future of interior design.",
    "authors": [
      "Kaiwen Zhou",
      "Tianyu Wang"
    ],
    "url": "http://arxiv.org/abs/2405.19188v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.HC",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "ceeedc8d-70ce-4cba-bc86-aa42f69ea66a": {
    "pk": "ceeedc8d-70ce-4cba-bc86-aa42f69ea66a",
    "title": "Exoplanet Aeronomy: A Case Study of WASP-69b's Variable Thermosphere",
    "abstract": "Aeronomy, the study of Earth's upper atmosphere and its interaction with the local space environment, has long traced changes in the thermospheres of Earth and other solar system planets to solar variability in the X-ray and extreme ultraviolet (collectively, \"XUV\") bands. Extending comparative aeronomy to the short-period extrasolar planets may illuminate whether stellar XUV irradiation powers atmospheric outflows that change planetary radii on astronomical timescales. In recent years, near-infrared transit spectroscopy of metastable HeI has been a prolific tracer of high-altitude planetary gas. We present a case study of exoplanet aeronomy using metastable HeI transit observations from Palomar/WIRC and follow-up high-energy data from the Neil Gehrels Swift Observatory that were taken within one month of the WASP-69 system, a K-type main sequence star with a well-studied hot Jupiter companion. Supplemented by archival data, we find that WASP-69's X-ray flux in 2023 was less than 50% of what was recorded in 2016 and that the metastable HeI absorption from WASP-69b was lower in 2023 versus past epochs from 2017-2019. Via atmospheric modeling, we show that this time-variable metastable HeI signal is in the expected direction given the observed change in stellar XUV, possibly stemming from WASP-69's magnetic activity cycle. Our results underscore the ability of multi-epoch, multi-wavelength observations to paint a cohesive picture of the interaction between an exoplanet's atmosphere and its host star.",
    "authors": [
      "W. Garrett Levine",
      "Shreyas Vissapragada",
      "Adina D. Feinstein",
      "George W. King",
      "Aleck Hernandez",
      "Lia Corrales",
      "Michael Greklek-McKeon",
      "Heather A. Knutson"
    ],
    "url": "http://arxiv.org/abs/2405.19177v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "astro-ph.EP",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "faf07a59-b2dd-4819-8440-059644cf49f1": {
    "pk": "faf07a59-b2dd-4819-8440-059644cf49f1",
    "title": "Measuring the Higgs spin and parity in $H\\to \\ell^-\\ell^+ Z$",
    "abstract": "We develop an effective and methodical algorithm for the construction of general covariant four-point $H\\ell\\ell Z$ vertices, accommodating leptons $\\ell=e, \\mu$, and designed to handle a Higgs boson $H$ of any integer spin, not merely confined to spins up to 2. While our numerical analysis assumes the Higgs boson mass to be $m_H=125\\,{\\rm GeV}$, the analytical framework we propose is versatile, enabling the examination of various mass scenarios. These meticulously devised general covariant four-point $H\\ell\\ell Z$ vertices are pivotal in the systematic determination of the spin and parity of the Standard Model Higgs boson, especially via one of its primary decay channels, the three-body decay process $H\\to \\ell^-\\ell^+ Z$, observable at the Large Hadron Collider. Our innovative strategy extends beyond the limitations of previous investigations on the Higgs spin and parity determinations. It not only encompasses the analysis of the two-step cascade decay $H\\to Z^{\\star} Z \\to \\ell^-\\ell^+ Z$, featuring an intermediate virtual $Z^{\\star}$ exchange but also integrates consideration for the direct 4-point contact $H\\ell\\ell Z$ interaction. Our significantly expanded scheme provides a definitive and unequivocal platform for determining and confirming the spinless nature and even parity of the SM Higgs boson by leveraging threshold effects and angular correlations, even though achieving such conclusive results in practical and exhaustive analyses necessitates high event rates.",
    "authors": [
      "Seong Youl Choi",
      "Jaehoon Jeong",
      "Dong Woo Kang"
    ],
    "url": "http://arxiv.org/abs/2405.19167v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "hep-ph",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "f5ddeb2f-71c8-47fb-bc8d-b6715f960317": {
    "pk": "f5ddeb2f-71c8-47fb-bc8d-b6715f960317",
    "title": "I Bet You Did Not Mean That: Testing Semantic Importance via Betting",
    "abstract": "Recent works have extended notions of feature importance to \\emph{semantic concepts} that are inherently interpretable to the users interacting with a black-box predictive model. Yet, precise statistical guarantees, such as false positive rate control, are needed to communicate findings transparently and to avoid unintended consequences in real-world scenarios. In this paper, we formalize the global (i.e., over a population) and local (i.e., for a sample) statistical importance of semantic concepts for the predictions of opaque models, by means of conditional independence, which allows for rigorous testing. We use recent ideas of sequential kernelized testing (SKIT) to induce a rank of importance across concepts, and showcase the effectiveness and flexibility of our framework on synthetic datasets as well as on image classification tasks using vision-language models such as CLIP.",
    "authors": [
      "Jacopo Teneggi",
      "Jeremias Sulam"
    ],
    "url": "http://arxiv.org/abs/2405.19146v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "stat.ML",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "170fac14-9f8f-43f6-8e16-aed90fd016bf": {
    "pk": "170fac14-9f8f-43f6-8e16-aed90fd016bf",
    "title": "Analyzing Chat Protocols of Novice Programmers Solving Introductory Programming Tasks with ChatGPT",
    "abstract": "Large Language Models (LLMs) have taken the world by storm, and students are assumed to use related tools at a great scale. In this research paper we aim to gain an understanding of how introductory programming students chat with LLMs and related tools, e.g., ChatGPT-3.5. To address this goal, computing students at a large German university were motivated to solve programming exercises with the assistance of ChatGPT as part of their weekly introductory course exercises. Then students (n=213) submitted their chat protocols (with 2335 prompts in sum) as data basis for this analysis. The data was analyzed w.r.t. the prompts, frequencies, the chats' progress, contents, and other use pattern, which revealed a great variety of interactions, both potentially supportive and concerning. Learning about students' interactions with ChatGPT will help inform and align teaching practices and instructions for future introductory programming courses in higher education.",
    "authors": [
      "Andreas Scholl",
      "Daniel Schiffner",
      "Natalie Kiesler"
    ],
    "url": "http://arxiv.org/abs/2405.19132v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.AI",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "af0cdb23-e1fb-4a23-84f7-d747ed7e1406": {
    "pk": "af0cdb23-e1fb-4a23-84f7-d747ed7e1406",
    "title": "MHD simulations of the space weather in Proxima b: Habitability conditions and radio emission",
    "abstract": "The habitability of exoplanets hosted by M-dwarf stars dramatically depends on their space weather. We present 3D magneto-hydrodynamic simulations to characterise the magneto-plasma environment and thus the habitability of the Earth-like planet Proxima b when it is subject to both calm and extreme (CME-like) space weather conditions. We study the role of the stellar wind and planetary magnetic field, and determine the radio emission arising from the interaction between the stellar wind of Proxima and the magnetosphere of its planet Proxima b. We find that if Prox b has a magnetic field similar to that of the Earth ($B_{\\rm p} = B_\\oplus \\approx 0.32$ G) or larger, the magnetopause standoff distance is large enough to shield the surface from the stellar wind for essentially any planetary tilt but the most extreme values (close to $90^{\\circ} $), under a calm space weather. Even if Proxima b is subject to more extreme space weather conditions, the planet is well shielded by an Earth-like magnetosphere ($B_{\\rm p} \\approx B_\\oplus$; $ \\approx 23.5^{\\circ}$), or if it has tilt smaller than that of the Earth. For calm space weather conditions, the radio emission caused by the day-side reconnection regions can be as high as 7$\\times10^{19}$ erg s$^{-1}$ in the super-Alfv\\'enic regime, and is on average almost an order of magnitude larger than the radio emission in the sub-Alfv\\'enic cases, due to the much larger contribution of the bow shock. We also find that the energy dissipation at the bow shock is independent of the angle between the planet's magnetic dipole and the incident stellar wind flow. If Prox b is subject to extreme space weather conditions, the radio emission is more than two orders of magnitude larger than under calm space weather conditions. This result yields expectations for a direct detection--from Earth--in radio of giant planets in close-in orbits.",
    "authors": [
      "Luis Peña-Moñino",
      "Miguel Pérez-Torres",
      "Jacobo Varela",
      "Philippe Zarka"
    ],
    "url": "http://arxiv.org/abs/2405.19116v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "astro-ph.EP",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "9139165a-fb52-4a8c-992d-8fb1ebe73411": {
    "pk": "9139165a-fb52-4a8c-992d-8fb1ebe73411",
    "title": "Signatures of a Charge Ice State in the Doped Mott Insulator Nb$_3$Cl$_8$",
    "abstract": "The interplay between strong electronic correlations and the inherent frustration of certain lattice geometries is a common mechanism for the formation of nontrivial states of matter. In this work, we theoretically explore the collective electronic effects in the monolayer Nb$_3$Cl$_8$, a recently discovered triangular lattice Mott insulator. Our advanced many-body numerical simulations predict the emergence of a phase separation region upon doping this material. Notably, in close proximity to the phase separation, the static charge susceptibility undergoes a drastic change and reveals a distinctive bow-tie structure in momentum space. The appearance of such a signature in the context of spin degrees of freedom would indicate the formation of a spin ice state. This finding allows us to associate the observed phase separation to a charge ice state, a state with a remarkable power-law dependence of both the effective exchange interaction and correlations between electronic densities in real space.",
    "authors": [
      "Evgeny A. Stepanov"
    ],
    "url": "http://arxiv.org/abs/2405.19114v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cond-mat.str-el",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "4b6eeff5-5bbc-4f81-ab6b-5c9bcc51f92a": {
    "pk": "4b6eeff5-5bbc-4f81-ab6b-5c9bcc51f92a",
    "title": "Alt4Blind: A User Interface to Simplify Charts Alt-Text Creation",
    "abstract": "Alternative Texts (Alt-Text) for chart images are essential for making graphics accessible to people with blindness and visual impairments. Traditionally, Alt-Text is manually written by authors but often encounters issues such as oversimplification or complication. Recent trends have seen the use of AI for Alt-Text generation. However, existing models are susceptible to producing inaccurate or misleading information. We address this challenge by retrieving high-quality alt-texts from similar chart images, serving as a reference for the user when creating alt-texts. Our three contributions are as follows: (1) we introduce a new benchmark comprising 5,000 real images with semantically labeled high-quality Alt-Texts, collected from Human Computer Interaction venues. (2) We developed a deep learning-based model to rank and retrieve similar chart images that share the same visual and textual semantics. (3) We designed a user interface (UI) to facilitate the alt-text creation process. Our preliminary interviews and investigations highlight the usability of our UI. For the dataset and further details, please refer to our project page: https://moured.github.io/alt4blind/.",
    "authors": [
      "Omar Moured",
      "Shahid Ali Farooqui",
      "Karin Muller",
      "Sharifeh Fadaeijouybari",
      "Thorsten Schwarz",
      "Mohammed Javed",
      "Rainer Stiefelhagen"
    ],
    "url": "http://arxiv.org/abs/2405.19111v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "4aa4f5b9-2bf2-4253-8fb9-ef026778205b": {
    "pk": "4aa4f5b9-2bf2-4253-8fb9-ef026778205b",
    "title": "Voice Jailbreak Attacks Against GPT-4o",
    "abstract": "Recently, the concept of artificial assistants has evolved from science fiction into real-world applications. GPT-4o, the newest multimodal large language model (MLLM) across audio, vision, and text, has further blurred the line between fiction and reality by enabling more natural human-computer interactions. However, the advent of GPT-4o's voice mode may also introduce a new attack surface. In this paper, we present the first systematic measurement of jailbreak attacks against the voice mode of GPT-4o. We show that GPT-4o demonstrates good resistance to forbidden questions and text jailbreak prompts when directly transferring them to voice mode. This resistance is primarily due to GPT-4o's internal safeguards and the difficulty of adapting text jailbreak prompts to voice mode. Inspired by GPT-4o's human-like behaviors, we propose VoiceJailbreak, a novel voice jailbreak attack that humanizes GPT-4o and attempts to persuade it through fictional storytelling (setting, character, and plot). VoiceJailbreak is capable of generating simple, audible, yet effective jailbreak prompts, which significantly increases the average attack success rate (ASR) from 0.033 to 0.778 in six forbidden scenarios. We also conduct extensive experiments to explore the impacts of interaction steps, key elements of fictional writing, and different languages on VoiceJailbreak's effectiveness and further enhance the attack performance with advanced fictional writing techniques. We hope our study can assist the research community in building more secure and well-regulated MLLMs.",
    "authors": [
      "Xinyue Shen",
      "Yixin Wu",
      "Michael Backes",
      "Yang Zhang"
    ],
    "url": "http://arxiv.org/abs/2405.19103v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CR",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "837977bf-f717-4c08-aa1b-201c5e5fa9b0": {
    "pk": "837977bf-f717-4c08-aa1b-201c5e5fa9b0",
    "title": "Impacts of ALP on the Constraints of Dark Photon",
    "abstract": "Dark sector may exist and interact with Standard Model (SM) through the $U(1)$ kinetic mixing. Through this portal-type interaction, dark photon from dark sector couples to SM fermions, and may explain the discrepancy between experimental data and SM calculations on muon anomalous magnetic moment, muon $g-2$. However, current searches for dark photon impose stringent constraints on the mixing parameter $\\varepsilon$ for various dark photon masses, excluding the favorite parameter space for muon $g-2$. In this paper, we study the case where a global $U(1)$ in dark sector is spontaneously broken, resulting a light pseudo-Goldstone, axion-like particle (ALP) $a$, which couples to dark photon and SM photon, $g_{a\\gamma\\gamma'}$. Through this interaction, dark photon may decay into photon and ALP when this channel is kinematically allowed. As a result, the experimental constraints on dark photon change significantly, and dark photon is able to explain the muon $g-2$ anomaly when its mass is heavier than $10$ GeV.",
    "authors": [
      "Chuan-Ren Chen",
      "Yuan-Feng Hsieh",
      "Chrisna Setyo Nugroho"
    ],
    "url": "http://arxiv.org/abs/2405.19087v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "hep-ph",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "bcfb402a-e257-48b9-ac42-00a4ccceb5bc": {
    "pk": "bcfb402a-e257-48b9-ac42-00a4ccceb5bc",
    "title": "Uniform vs. Lognormal Kinematics in Robots: Perceptual Preferences for Robotic Movements",
    "abstract": "Collaborative robots or cobots interact with humans in a common work environment. In cobots, one under investigated but important issue is related to their movement and how it is perceived by humans. This paper tries to analyze whether humans prefer a robot moving in a human or in a robotic fashion. To this end, the present work lays out what differentiates the movement performed by an industrial robotic arm from that performed by a human one. The main difference lies in the fact that the robotic movement has a trapezoidal speed profile, while for the human arm, the speed profile is bell-shaped and during complex movements, it can be considered as a sum of superimposed bell-shaped movements. Based on the lognormality principle, a procedure was developed for a robotic arm to perform human-like movements. Both speed profiles were implemented in two industrial robots, namely, an ABB IRB 120 and a Universal Robot UR3. Three tests were used to study the subjects' preference when seeing both movements and another analyzed the same when interacting with the robot by touching its ends with their fingers.",
    "authors": [
      "Jose J. Quintana",
      "Miguel A. Ferrer",
      "Moises Diaz",
      "Jose J. Feo",
      "Adam Wolniakowski",
      "Konstantsin Miatliuk"
    ],
    "url": "http://arxiv.org/abs/2405.19081v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.RO",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "c4797bb9-73f8-4630-bf1a-5707dc33f83c": {
    "pk": "c4797bb9-73f8-4630-bf1a-5707dc33f83c",
    "title": "OMPO: A Unified Framework for RL under Policy and Dynamics Shifts",
    "abstract": "Training reinforcement learning policies using environment interaction data collected from varying policies or dynamics presents a fundamental challenge. Existing works often overlook the distribution discrepancies induced by policy or dynamics shifts, or rely on specialized algorithms with task priors, thus often resulting in suboptimal policy performances and high learning variances. In this paper, we identify a unified strategy for online RL policy learning under diverse settings of policy and dynamics shifts: transition occupancy matching. In light of this, we introduce a surrogate policy learning objective by considering the transition occupancy discrepancies and then cast it into a tractable min-max optimization problem through dual reformulation. Our method, dubbed Occupancy-Matching Policy Optimization (OMPO), features a specialized actor-critic structure equipped with a distribution discriminator and a small-size local buffer. We conduct extensive experiments based on the OpenAI Gym, Meta-World, and Panda Robots environments, encompassing policy shifts under stationary and nonstationary dynamics, as well as domain adaption. The results demonstrate that OMPO outperforms the specialized baselines from different categories in all settings. We also find that OMPO exhibits particularly strong performance when combined with domain randomization, highlighting its potential in RL-based robotics applications",
    "authors": [
      "Yu Luo",
      "Tianying Ji",
      "Fuchun Sun",
      "Jianwei Zhang",
      "Huazhe Xu",
      "Xianyuan Zhan"
    ],
    "url": "http://arxiv.org/abs/2405.19080v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "328cadca-2f6a-4938-8955-631268b0dd70": {
    "pk": "328cadca-2f6a-4938-8955-631268b0dd70",
    "title": "Cephalo: Multi-Modal Vision-Language Models for Bio-Inspired Materials Analysis and Design",
    "abstract": "We present Cephalo, a series of multimodal vision large language models (V-LLMs) designed for materials science applications, integrating visual and linguistic data for enhanced understanding and interaction within human-AI and multi-agent AI frameworks. A key innovation of Cephalo is its advanced dataset generation method, which employs a sophisticated algorithm to accurately detect and separate images and their corresponding textual descriptions from PDF documents, such as scientific papers. The method includes a careful refinement of image-text pairs through integrated vision and language processing, ensuring high-quality, contextually relevant, and well reasoned training data. Cephalo is trained on integrated image and text data extracted from thousands of scientific papers and science-focused Wikipedia pages demonstrates can interpret complex visual scenes, generate precise language descriptions, and answer queries about images effectively. The combination of a vision encoder with an autoregressive transformer supports complex natural language understanding in an integrated model, which can be coupled with other generative methods to create an image-to-text-to-image or image-to-text-to-3D pipeline. To explore the development of larger models from smaller ones, we merge sets of layers that originate from different pre-trained source models. This hybrid approach allows us to leverage the domain-specific expertise and general conversational capabilities to harness the strengths of multiple models. We examine the models in diverse use cases that incorporate biological materials, fracture and engineering analysis, protein biophysics, and bio-inspired design based on insect behavior. Generative applications include bio-inspired designs, including pollen-inspired architected materials, as well as the synthesis of bio-inspired material microstructures from a photograph of a solar eclipse.",
    "authors": [
      "Markus J. Buehler"
    ],
    "url": "http://arxiv.org/abs/2405.19076v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "c7f30227-fb38-45b1-826a-e4db9ffb3505": {
    "pk": "c7f30227-fb38-45b1-826a-e4db9ffb3505",
    "title": "FUSU: A Multi-temporal-source Land Use Change Segmentation Dataset for Fine-grained Urban Semantic Understanding",
    "abstract": "Fine urban change segmentation using multi-temporal remote sensing images is essential for understanding human-environment interactions. Despite advances in remote sensing data for urban monitoring, coarse-grained classification systems and the lack of continuous temporal observations hinder the application of deep learning to urban change analysis. To address this, we introduce FUSU, a multi-source, multi-temporal change segmentation dataset for fine-grained urban semantic understanding. FUSU features the most detailed land use classification system to date, with 17 classes and 30 billion pixels of annotations. It includes bi-temporal high-resolution satellite images with 20-50 cm ground sample distance and monthly optical and radar satellite time series, covering 847 km2 across five urban areas in China. The fine-grained pixel-wise annotations and high spatial-temporal resolution data provide a robust foundation for deep learning models to understand urbanization and land use changes. To fully leverage FUSU, we propose a unified time-series architecture for both change detection and segmentation and benchmark FUSU on various methods for several tasks. Dataset and code will be available at: https://github.com/yuanshuai0914/FUSU.",
    "authors": [
      "Shuai Yuan",
      "Guancong Lin",
      "Lixian Zhang",
      "Runmin Dong",
      "Jinxiao Zhang",
      "Shuang Chen",
      "Juepeng Zheng",
      "Jie Wang",
      "Haohuan Fu"
    ],
    "url": "http://arxiv.org/abs/2405.19055v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "6c781878-f47a-419c-9469-75c780fa2c66": {
    "pk": "6c781878-f47a-419c-9469-75c780fa2c66",
    "title": "Multiscale Spatio-Temporal Enhanced Short-term Load Forecasting of Electric Vehicle Charging Stations",
    "abstract": "The rapid expansion of electric vehicles (EVs) has rendered the load forecasting of electric vehicle charging stations (EVCS) increasingly critical. The primary challenge in achieving precise load forecasting for EVCS lies in accounting for the nonlinear of charging behaviors, the spatial interactions among different stations, and the intricate temporal variations in usage patterns. To address these challenges, we propose a Multiscale Spatio-Temporal Enhanced Model (MSTEM) for effective load forecasting at EVCS. MSTEM incorporates a multiscale graph neural network to discern hierarchical nonlinear temporal dependencies across various time scales. Besides, it also integrates a recurrent learning component and a residual fusion mechanism, enhancing its capability to accurately capture spatial and temporal variations in charging patterns. The effectiveness of the proposed MSTEM has been validated through comparative analysis with six baseline models using three evaluation metrics. The case studies utilize real-world datasets for both fast and slow charging loads at EVCS in Perth, UK. The experimental results demonstrate the superiority of MSTEM in short-term continuous load forecasting for EVCS.",
    "authors": [
      "Zongbao Zhang",
      "Jiao Hao",
      "Wenmeng Zhao",
      "Yan Liu",
      "Yaohui Huang",
      "Xinhang Luo"
    ],
    "url": "http://arxiv.org/abs/2405.19053v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "eess.SY",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "e05c0f07-9110-42be-aaa2-ad23c5481baa": {
    "pk": "e05c0f07-9110-42be-aaa2-ad23c5481baa",
    "title": "Continual Collaborative Distillation for Recommender System",
    "abstract": "Knowledge distillation (KD) has emerged as a promising technique for addressing the computational challenges associated with deploying large-scale recommender systems. KD transfers the knowledge of a massive teacher system to a compact student model, to reduce the huge computational burdens for inference while retaining high accuracy. The existing KD studies primarily focus on one-time distillation in static environments, leaving a substantial gap in their applicability to real-world scenarios dealing with continuously incoming users, items, and their interactions. In this work, we delve into a systematic approach to operating the teacher-student KD in a non-stationary data stream. Our goal is to enable efficient deployment through a compact student, which preserves the high performance of the massive teacher, while effectively adapting to continuously incoming data. We propose Continual Collaborative Distillation (CCD) framework, where both the teacher and the student continually and collaboratively evolve along the data stream. CCD facilitates the student in effectively adapting to new data, while also enabling the teacher to fully leverage accumulated knowledge. We validate the effectiveness of CCD through extensive quantitative, ablative, and exploratory experiments on two real-world datasets. We expect this research direction to contribute to narrowing the gap between existing KD studies and practical applications, thereby enhancing the applicability of KD in real-world systems.",
    "authors": [
      "Gyuseok Lee",
      "SeongKu Kang",
      "Wonbin Kweon",
      "Hwanjo Yu"
    ],
    "url": "http://arxiv.org/abs/2405.19046v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.IR",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "64636318-0066-4ec9-bbdb-f04e7703b736": {
    "pk": "64636318-0066-4ec9-bbdb-f04e7703b736",
    "title": "BLSP-KD: Bootstrapping Language-Speech Pre-training via Knowledge Distillation",
    "abstract": "Recent end-to-end approaches have shown promise in extending large language models (LLMs) to speech inputs, but face limitations in directly assessing and optimizing alignment quality and fail to achieve fine-grained alignment due to speech-text length mismatch. We introduce BLSP-KD, a novel approach for Bootstrapping Language-Speech Pretraining via Knowledge Distillation, which addresses these limitations through two key techniques. First, it optimizes speech-text alignment by minimizing the divergence between the LLM's next-token prediction distributions for speech and text inputs using knowledge distillation. Second, it employs a continuous-integrate-andfire strategy to segment speech into tokens that correspond one-to-one with text tokens, enabling fine-grained alignment. We also introduce Partial LoRA (PLoRA), a new adaptation method supporting LLM finetuning for speech inputs under knowledge distillation. Quantitative evaluation shows that BLSP-KD outperforms previous end-to-end baselines and cascaded systems with comparable scale of parameters, facilitating general instruction-following capabilities for LLMs with speech inputs. This approach provides new possibilities for extending LLMs to spoken language interactions.",
    "authors": [
      "Chen Wang",
      "Minpeng Liao",
      "Zhongqiang Huang",
      "Jiajun Zhang"
    ],
    "url": "http://arxiv.org/abs/2405.19041v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CL",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "58058807-0665-4c50-a9a5-27d415ec083f": {
    "pk": "58058807-0665-4c50-a9a5-27d415ec083f",
    "title": "PointNetPGAP-SLC: A 3D LiDAR-based Place Recognition Approach with Segment-level Consistency Training for Mobile Robots in Horticulture",
    "abstract": "This paper addresses robotic place recognition in horticultural environments using 3D-LiDAR technology and deep learning. Three main contributions are proposed: (i) a novel model called PointNetPGAP, which combines a global average pooling aggregator and a pairwise feature interaction aggregator; (ii) a Segment-Level Consistency (SLC) model, used only during training, with the goal of augmenting the contrastive loss with a context-specific training signal to enhance descriptors; and (iii) a novel dataset named HORTO-3DLM featuring sequences from orchards and strawberry plantations. The experimental evaluation, conducted on the new HORTO-3DLM dataset, compares PointNetPGAP at the sequence- and segment-level with state-of-the-art (SOTA) models, including OverlapTransformer, PointNetVLAD, and LOGG3D. Additionally, all models were trained and evaluated using the SLC. Empirical results obtained through a cross-validation evaluation protocol demonstrate the superiority of PointNetPGAP compared to existing SOTA models. PointNetPGAP emerges as the best model in retrieving the top-1 candidate, outperforming PointNetVLAD (the second-best model). Moreover, when comparing the impact of training with the SLC model, performance increased on four out of the five evaluated models, indicating that adding a context-specific signal to the contrastive loss leads to improved descriptors.",
    "authors": [
      "T. Barros",
      "L. Garrote",
      "P. Conde",
      "M. J. Coombes",
      "C. Liu",
      "C. Premebida",
      "U. J. Nunes"
    ],
    "url": "http://arxiv.org/abs/2405.19038v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.RO",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "220f2c09-5ffd-4398-88f8-42f171eb29ff": {
    "pk": "220f2c09-5ffd-4398-88f8-42f171eb29ff",
    "title": "On the formalization of the notion of an interactive algorithm",
    "abstract": "An earlier paper gives an account of a quest for a satisfactory formalization of the classical informal notion of an algorithm. In this paper, an attempt is made to generalize the results of that quest to the informal notion of an interactive algorithm. The notion of an interactive proto-algorithm is introduced. Interactive algorithms are expected to be equivalence classes of interactive proto-algorithms under an appropriate equivalence relation. As in the non-interactive case, three equivalence relations are defined. Two of them are deemed to be bounds for an appropriate equivalence relation and the third is likely an appropriate one.",
    "authors": [
      "C. A. Middelburg"
    ],
    "url": "http://arxiv.org/abs/2405.19037v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CC",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "00aff5e7-b5d7-45fc-80ca-de2b52aee769": {
    "pk": "00aff5e7-b5d7-45fc-80ca-de2b52aee769",
    "title": "Exploring Frustration Effects of Strongly Interacting Bosons via the Hall Response",
    "abstract": "We investigate the Hall response of hardcore bosonic atoms on a triangular ladder in a magnetic field. We show that the behavior of the Hall polarization, both in its saturation value and in the short-time dynamics, correlates with the features of the underlying phase diagram. In particular, it exhibits a strong negative response at the Meissner to vortex phase transitions, while at large magnetic fluxes, after changing sign, it shows a strong positive response due to non-trivial vortex commensurability effects stemming from the interplay of interactions and geometric frustration. Thus, one can employ the Hall response as a sensitive probe of the many-body chiral quantum phases present in the system.",
    "authors": [
      "Catalin-Mihai Halati",
      "Thierry Giamarchi"
    ],
    "url": "http://arxiv.org/abs/2405.19030v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cond-mat.quant-gas",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "be28685a-0426-4a70-af87-5936c875bab7": {
    "pk": "be28685a-0426-4a70-af87-5936c875bab7",
    "title": "Fractional diffusion as the limit of a short range potential Rayleigh gas",
    "abstract": "The fractional diffusion equation is rigorously derived as a scaling limit from a deterministic Rayleigh gas, where particles interact via short range potentials with support of size $\\varepsilon$ and the background is distributed in space $R^3$ according to a Poisson process with intensity $N$ and in velocity according some fat-tailed distribution. As an intermediate step a linear Boltzmann equation is obtained in the Boltzmann-Grad limit as $\\varepsilon$ tends to zero and $N$ tends to infinity with $N \\varepsilon^2 =c$. The convergence of the empiric particle dynamics to the Boltzmann-type dynamics is shown using semigroup methods to describe probability measures on collision trees associated to physical trajectories in the case of a Rayleigh gas. The fractional diffusion equation is a hydrodynamic limit for times $t \\in [0,T]$, where $T$ and inverse mean free path $c$ can both be chosen as some negative rational power $\\varepsilon^{-k}$.",
    "authors": [
      "Karsten Matthies",
      "Theodora Syntaka"
    ],
    "url": "http://arxiv.org/abs/2405.19025v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "math.AP",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "8b84a67c-d0a4-4165-8009-84883683d5c0": {
    "pk": "8b84a67c-d0a4-4165-8009-84883683d5c0",
    "title": "Towards Standardizing AI Bias Exploration",
    "abstract": "Creating fair AI systems is a complex problem that involves the assessment of context-dependent bias concerns. Existing research and programming libraries express specific concerns as measures of bias that they aim to constrain or mitigate. In practice, one should explore a wide variety of (sometimes incompatible) measures before deciding which ones warrant corrective action, but their narrow scope means that most new situations can only be examined after devising new measures. In this work, we present a mathematical framework that distils literature measures of bias into building blocks, hereby facilitating new combinations to cover a wide range of fairness concerns, such as classification or recommendation differences across multiple multi-value sensitive attributes (e.g., many genders and races, and their intersections). We show how this framework generalizes existing concepts and present frequently used blocks. We provide an open-source implementation of our framework as a Python library, called FairBench, that facilitates systematic and extensible exploration of potential bias concerns.",
    "authors": [
      "Emmanouil Krasanakis",
      "Symeon Papadopoulos"
    ],
    "url": "http://arxiv.org/abs/2405.19022v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "c57b4db5-97d8-4c4a-ace6-2f167dcc475d": {
    "pk": "c57b4db5-97d8-4c4a-ace6-2f167dcc475d",
    "title": "Non-Hermitian theory of valley excitons in two-dimensional semiconductors",
    "abstract": "Electron-hole exchange interaction in two-dimensional transition metal dichalcogenides is extremely strong due to the dimension reduction, which promises valley-superposed excitonic states with linearly polarized optical emissions. However, strong circular polarization reflecting valley-polarized excitonic states is commonly observed in helicity-resolved optical experiments. Here we present a non-Hermitian theory of valley excitons by incorporating optical pumping and intrinsic decay, which unveils an anomalous valley-polarized excitonic state with elliptically polarized optical emission. This novel state arises from the non-Hermiticity induced parity-time ($\\mathcal{PT}$)-symmetry breaking, which impedes the experimental observation of intervalley excitonic coherence effect. At large excitonic center-of-mass momenta, the $\\mathcal{PT}$-symmetry is restored and the excitonic states recover their valley coherence. Interestingly, the linear polarization directions in optical emissions from these valley-superposed excitonic states are non-orthogonal and even become parallel at exceptional points. Our non-Hermitian theory also predicts a non-zero Berry curvature for valley excitons, which admits a topological excitonic Hall transport beyond the Hermitian predictions.",
    "authors": [
      "Qiutong Wang",
      "Ci Li",
      "Qingjun Tong"
    ],
    "url": "http://arxiv.org/abs/2405.19007v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cond-mat.mes-hall",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "814856e2-28e1-471c-b35a-ac01e3f7859a": {
    "pk": "814856e2-28e1-471c-b35a-ac01e3f7859a",
    "title": "Auto-selected Knowledge Adapters for Lifelong Person Re-identification",
    "abstract": "Lifelong Person Re-Identification (LReID) extends traditional ReID by requiring systems to continually learn from non-overlapping datasets across different times and locations, adapting to new identities while preserving knowledge of previous ones. Existing approaches, either rehearsal-free or rehearsal-based, still suffer from the problem of catastrophic forgetting since they try to cram diverse knowledge into one fixed model. To overcome this limitation, we introduce a novel framework AdalReID, that adopts knowledge adapters and a parameter-free auto-selection mechanism for lifelong learning. Concretely, we incrementally build distinct adapters to learn domain-specific knowledge at each step, which can effectively learn and preserve knowledge across different datasets. Meanwhile, the proposed auto-selection strategy adaptively calculates the knowledge similarity between the input set and the adapters. On the one hand, the appropriate adapters are selected for the inputs to process ReID, and on the other hand, the knowledge interaction and fusion between adapters are enhanced to improve the generalization ability of the model. Extensive experiments are conducted to demonstrate the superiority of our AdalReID, which significantly outperforms SOTAs by about 10$\\sim$20\\% mAP on both seen and unseen domains.",
    "authors": [
      "Xuelin Qian",
      "Ruiqi Wu",
      "Gong Cheng",
      "Junwei Han"
    ],
    "url": "http://arxiv.org/abs/2405.19005v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "0bd0e2ca-4462-4f20-9029-05a592aaca7b": {
    "pk": "0bd0e2ca-4462-4f20-9029-05a592aaca7b",
    "title": "Tuning load redistribution and damage near heterogeneous interfaces",
    "abstract": "We investigate interface failure of model materials representing architected thin films in contact with heterogeneous substrates. We find that, while systems with statistically isotropic distributions of impurities derive their fracture strength from the ability to develop rough detachment fronts, materials with hierarchical microstructures confine failure near a prescribed surface, where crack growth is arrested and crack surface correlations are suppressed. We develop a theory of network Green's functions for the systems at hand, and we find that the ability of hierarchical microstructures to control failure mode and locations comes at no performance cost in terms of peak stress and specific work of failure and derives from the quenched local anistotropy of the elastic interaction kernel.",
    "authors": [
      "Christian Greff",
      "Paolo Moretti",
      "Michael Zaiser"
    ],
    "url": "http://arxiv.org/abs/2405.18994v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cond-mat.mtrl-sci",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "c9d8b036-7f54-41c2-8640-8965f9574983": {
    "pk": "c9d8b036-7f54-41c2-8640-8965f9574983",
    "title": "The surface tension of Martini 3 water mixtures",
    "abstract": "The Martini model, a coarse-grained forcefield for biomolecular simulations, has experienced a vast increase in popularity in the past decade. Its building-block approach balances computational efficiency with high chemical specificity, enabling the simulation of various organic and inorganic molecules. The modeling of coarse-grained beads as Lennard-Jones particles poses challenges for the accurate reproduction of liquid-vapour interfacial properties, which are crucial in various applications, especially in the case of water. The latest version of the forcefield introduces refined interaction parameters for water beads, tackling the well-known artefact of Martini water freezing at room temperature. Additionally, multiple sizes of water beads are available for simulating the solvation of small cavities, including the smallest pockets of proteins. This work focuses on studying the interfacial properties of Martini water, including surface tension, surface thickness, and bulk densities for the liquid and vapour phases. Employing the test-area method, we systematically compute the liquid-vapour surface tension across various combinations of water bead sizes and for temperatures in the range from 300 to 350 K. Our findings provide a comprehensive characterization of Martini 3.0 water intefacial properties. These findings are of interest to the Martini community as they allow users to account for the low interfacial tension of Martini water by properly adjusting observables computed via coarse-grained simulations (e.g., capillary forces) to allow for accurate matching against all-atom or experimental results. Surface tension data are also interpreted in terms of local enrichment of the various mixture components at the liquid-vapour interface by means of Gibbs' adsorption formalism",
    "authors": [
      "Lorenzo Iannetti",
      "Sonia Cambiaso",
      "Fabio Rasera",
      "Alberto Giacomello",
      "Giulia Rossi",
      "Davide Bochicchio",
      "Antonio Tinti"
    ],
    "url": "http://arxiv.org/abs/2405.18970v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cond-mat.soft",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "208e70b9-5026-43e9-b9d9-744d7e763078": {
    "pk": "208e70b9-5026-43e9-b9d9-744d7e763078",
    "title": "Global and local observability of hypergraphs",
    "abstract": "This paper studies observability for non-uniform hypergraphs with inputs and outputs. To capture higher-order interactions, we define a canonical non-homogeneous dynamical system with nonlinear outputs on hypergraphs. We then construct algebraic necessary and sufficient conditions based on polynomial ideals and varieties for global observability at an initial state of hypergraphs. An example is given to illustrate the proposed criteria for observability. Further, necessary and sufficient conditions for local observability are derived based on rank conditions of observability matrices, which provide a framework to study local observability for non-uniform hypergraphs. Finally, the similarity of observability for hypergraphs is proposed using similarity of tensors, which reveals the relation of observability between two hypergraphs and helps to check the observability intuitively.",
    "authors": [
      "Chencheng Zhang",
      "Hao Yang",
      "Shaoxuan Cui",
      "Bin Jiang",
      "Ming Cao"
    ],
    "url": "http://arxiv.org/abs/2405.18969v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "eess.SY",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "d4a8ed12-cc93-4566-9ab1-769c472df5b8": {
    "pk": "d4a8ed12-cc93-4566-9ab1-769c472df5b8",
    "title": "UniIF: Unified Molecule Inverse Folding",
    "abstract": "Molecule inverse folding has been a long-standing challenge in chemistry and biology, with the potential to revolutionize drug discovery and material science. Despite specified models have been proposed for different small- or macro-molecules, few have attempted to unify the learning process, resulting in redundant efforts. Complementary to recent advancements in molecular structure prediction, such as RoseTTAFold All-Atom and AlphaFold3, we propose the unified model UniIF for the inverse folding of all molecules. We do such unification in two levels: 1) Data-Level: We propose a unified block graph data form for all molecules, including the local frame building and geometric feature initialization. 2) Model-Level: We introduce a geometric block attention network, comprising a geometric interaction, interactive attention and virtual long-term dependency modules, to capture the 3D interactions of all molecules. Through comprehensive evaluations across various tasks such as protein design, RNA design, and material design, we demonstrate that our proposed method surpasses state-of-the-art methods on all tasks. UniIF offers a versatile and effective solution for general molecule inverse folding.",
    "authors": [
      "Zhangyang Gao",
      "Jue Wang",
      "Cheng Tan",
      "Lirong Wu",
      "Yufei Huang",
      "Siyuan Li",
      "Zhirui Ye",
      "Stan Z. Li"
    ],
    "url": "http://arxiv.org/abs/2405.18968v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.AI",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "76d0258c-1bbc-48a3-b8bc-db6aaf17b5a5": {
    "pk": "76d0258c-1bbc-48a3-b8bc-db6aaf17b5a5",
    "title": "Exploring Probabilistic Distance Fields in Robotics",
    "abstract": "The success of intelligent robotic missions relies on integrating various research tasks, each demanding distinct representations. Designing task-specific representations for each task is costly and impractical. Unified representations suitable for multiple tasks remain unexplored. My outline introduces a series of research outcomes of GP-based probabilistic distance field (GPDF) representation that mathematically models the fundamental property of Euclidean distance field (EDF) along with gradients, surface normals and dense reconstruction. The progress to date and ongoing future works show that GPDF has the potential to offer a unified solution of representation for multiple tasks such as localisation, mapping, motion planning, obstacle avoidance, grasping, human-robot collaboration, and dense visualisation. I believe that GPDF serves as the cornerstone for robots to accomplish more complex and challenging tasks. By leveraging GPDF, robots can navigate through intricate environments, understand spatial relationships, and interact with objects and humans seamlessly.",
    "authors": [
      "Lan Wu"
    ],
    "url": "http://arxiv.org/abs/2405.18965v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.RO",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "f384d70a-3b30-4764-9b00-ccffb3dda67e": {
    "pk": "f384d70a-3b30-4764-9b00-ccffb3dda67e",
    "title": "Magnetic Phase Diagram of Rouaite, Cu$_2$(OH)$_3$NO$_3$",
    "abstract": "Spinon-magnon mixing was recently reported in botallackite Cu$_2$(OH)$_3$Br with a uniaxially compressed triangular lattice of Cu$^{2+}$ quantum spins [Zhang et al., Phys. Rev. Lett. 125, 037204 (2020)]. Its nitrate counterpart rouaite, Cu$_2$(OH)$_3$NO$_3$, has a highly analogous structure and might be expected to exhibit similar physics. To lay a foundation for research on this material, we clarify rouaite's magnetic phase diagram and identify both low-field phases. The low-temperature magnetic state consists of alternating ferro- and antiferromagnetic chains, as in botallackite, but with additional canting, leading to net moments on all chains which rotate from one chain to another to form a 90$^\\circ$ cycloidal pattern. The higher-temperature phase is a helical modulation of this order, wherein the spins rotate from one Cu plane to the next. This extends to zero temperature for fields perpendicular to the chains, leading to a set of low-temperature field-induced phase transitions. Rouaite may offer another platform for spinon-magnon mixing, while our results suggest a delicate balance of interactions and high tunability of the magnetism.",
    "authors": [
      "Aswathi Mannathanath Chakkingal",
      "Anton A. Kulbakov",
      "Justus Grumbach",
      "Nikolai S. Pavlovskii",
      "Ulrike Stockert",
      "Kaushick K. Parui",
      "Maxim Avdeev",
      "R. Kumar",
      "Issei Niwata",
      "Ellen Häußler",
      "Roman Gumeniuk",
      "J. Ross Stewart",
      "James P. Tellam",
      "Vladimir Pomjakushin",
      "Sergey Granovsky",
      "Mathias Doerr",
      "Elena Hassinger",
      "Sergei Zherlitsyn",
      "Yoshihiko Ihara",
      "Dmytro S. Inosov",
      "Darren C. Peets"
    ],
    "url": "http://arxiv.org/abs/2405.18961v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cond-mat.str-el",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "5cb334d9-93e1-48e1-8e9a-0c0b6204a186": {
    "pk": "5cb334d9-93e1-48e1-8e9a-0c0b6204a186",
    "title": "Donnan equilibrium in charged slit-pores from a hybrid nonequilibrium Molecular Dynamics / Monte Carlo method with ions and solvent exchange",
    "abstract": "Ion partitioning between different compartments (\\emph{e.g.} a porous material and a bulk solution reservoir), known as Donnan equilibrium, plays a fundamental role in various contexts such as energy, environment, or water treatment. The linearized Poisson-Boltzmann (PB) equation, capturing the thermal motion of the ions with mean-field electrostatic interactions, is practically useful to understand and predict ion partitioning, despite its limited applicability to conditions of low salt concentrations and surface charge densities. Here, we investigate the Donnan equilibrium of coarse-grained dilute electrolytes confined in charged slit-pores in equilibrium with a reservoir of ions and solvent. We introduce and use an extension to confined systems of a recently developed hybrid nonequilibrium molecular dynamics / grand canonical Monte Carlo simulation method (\"H4D\"), which enhances the efficiency of solvent and ion-pair exchange via a fourth spatial dimension. We show that the validity range of linearized PB theory to predict the Donnan equilibrium of dilute electrolytes can be extended to highly charged pores, by simply considering \\textit{renormalized} surface charge densities. We compare with simulations of implicit solvent models of electrolytes and show that in the low salt concentrations and thin electric double layer limit considered here, an explicit solvent has a limited effect on the Donnan equilibrium and that the main limitations of the analytical predictions are not due to the breakdown of the mean-field description, but rather to the charge renormalization approximation, because it only focuses on the behavior far from the surfaces.",
    "authors": [
      "Jeongmin Kim",
      "Benjamin Rotenberg"
    ],
    "url": "http://arxiv.org/abs/2405.18957v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "physics.chem-ph",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "79cc1a60-3df3-4369-88ed-86fb61d472db": {
    "pk": "79cc1a60-3df3-4369-88ed-86fb61d472db",
    "title": "Encouraging Bystander Assistance for Urban Robots: Introducing Playful Robot Help-Seeking as a Strategy",
    "abstract": "Robots in urban environments will inevitably encounter situations beyond their capabilities (e.g., delivery robots unable to press traffic light buttons), necessitating bystander assistance. These spontaneous collaborations possess challenges distinct from traditional human-robot collaboration, requiring design investigation and tailored interaction strategies. This study investigates playful help-seeking as a strategy to encourage such bystander assistance. We compared our designed playful help-seeking concepts against two existing robot help-seeking strategies: verbal speech and emotional expression. To assess these strategies and their impact on bystanders' experience and attitudes towards urban robots, we conducted a virtual reality evaluation study with 24 participants. Playful help-seeking enhanced people's willingness to help robots, a tendency more pronounced in scenarios requiring greater physical effort. Verbal help-seeking was perceived less polite, raising stronger discomfort assessments. Emotional expression help-seeking elicited empathy while leading to lower cognitive trust. The triangulation of quantitative and qualitative results highlights considerations for robot help-seeking from bystanders.",
    "authors": [
      "Xinyan Yu",
      "Marius Hoggenmueller",
      "Martin Tomitsch"
    ],
    "url": "http://arxiv.org/abs/2405.18951v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.HC",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "17ad5c44-3f18-4c59-9636-74a3a4709a1e": {
    "pk": "17ad5c44-3f18-4c59-9636-74a3a4709a1e",
    "title": "Causal Action Influence Aware Counterfactual Data Augmentation",
    "abstract": "Offline data are both valuable and practical resources for teaching robots complex behaviors. Ideally, learning agents should not be constrained by the scarcity of available demonstrations, but rather generalize beyond the training distribution. However, the complexity of real-world scenarios typically requires huge amounts of data to prevent neural network policies from picking up on spurious correlations and learning non-causal relationships. We propose CAIAC, a data augmentation method that can create feasible synthetic transitions from a fixed dataset without having access to online environment interactions. By utilizing principled methods for quantifying causal influence, we are able to perform counterfactual reasoning by swapping $\\it{action}$-unaffected parts of the state-space between independent trajectories in the dataset. We empirically show that this leads to a substantial increase in robustness of offline learning algorithms against distributional shift.",
    "authors": [
      "Núria Armengol Urpí",
      "Marco Bagatella",
      "Marin Vlastelica",
      "Georg Martius"
    ],
    "url": "http://arxiv.org/abs/2405.18917v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "c690790b-03ec-4929-a4a7-46104f1a7c67": {
    "pk": "c690790b-03ec-4929-a4a7-46104f1a7c67",
    "title": "Towards Faithful Chain-of-Thought: Large Language Models are Bridging Reasoners",
    "abstract": "Large language models (LLMs) suffer from serious unfaithful chain-of-thought (CoT) issues. Previous work attempts to measure and explain it but lacks in-depth analysis within CoTs and does not consider the interactions among all reasoning components jointly. In this paper, we first study the CoT faithfulness issue at the granularity of CoT steps, identify two reasoning paradigms: centralized reasoning and distributed reasoning, and find their relationship with faithfulness. Subsequently, we conduct a joint analysis of the causal relevance among the context, CoT, and answer during reasoning. The result proves that, when the LLM predicts answers, it can recall correct information missing in the CoT from the context, leading to unfaithfulness issues. Finally, we propose the inferential bridging method to mitigate this issue, in which we use the attribution method to recall information as hints for CoT generation and filter out noisy CoTs based on their semantic consistency and attribution scores. Extensive experiments demonstrate that our approach effectively alleviates the unfaithful CoT problem.",
    "authors": [
      "Jiachun Li",
      "Pengfei Cao",
      "Yubo Chen",
      "Kang Liu",
      "Jun Zhao"
    ],
    "url": "http://arxiv.org/abs/2405.18915v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CL",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "811dd98c-0eee-4660-8540-2ee95f1eac7e": {
    "pk": "811dd98c-0eee-4660-8540-2ee95f1eac7e",
    "title": "Evaluating the effectiveness of sonifcation in science education using Edukoi",
    "abstract": "Science, Technology, Engineering, and Mathematics classes are mainly taught using visual supports. However, the advancement of technology and the increasing efforts to equip schools with digital instrumentation have opened up the possibility of exploring new teaching avenues, such as sonifcation. We explored the efcacy of sonifcation in education using a novel interactive tool, Edukoi, in the context of astronomy, which is predominantly disseminated through spectacular images, animations, and visuals. Edukoi is a motion-sensing sonifcation tool that converts images to sound in real-time for educational applications. Our study, conducted with nearly 150 middle-school students, included a preliminary questionnaire investigating the perception, engagement, and motivation of students towards science; two sessions dedicated to testing Edukoi and assessing the potentiality of the software for the recognition of the colour and the shape of real and sketchy images; and a fnal second administration of the questionnaire to capture a possible benefcial effect of the use of the tool in the engagement towards science. Results showed the effectiveness of Edukoi in colour recognition and reasonable efcacy in shape identification. Although the questionnaire did not reveal an increment in science engagement over the time of the study, oral feedback from the students was positive. Edukoi presents a possible alternative teaching aid, potentially benefting diverse learners, including the visually impaired. Further developments of the software are needed to enhance its effectiveness in conveying more complex features such as composite colours or shapes.",
    "authors": [
      "Lucrezia Guiotto Nai Fovino",
      "Anita Zanella",
      "Luca Di Mascolo",
      "Michele Ginolfi",
      "Nicolò Carpita",
      "Francesco Trovato Manuncola",
      "Massimo Grassi"
    ],
    "url": "http://arxiv.org/abs/2405.18908v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "physics.ed-ph",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "f435a25e-00f3-4aa4-a582-a8a397feab56": {
    "pk": "f435a25e-00f3-4aa4-a582-a8a397feab56",
    "title": "4Doodle: Two-handed Gestures for Immersive Sketching of Architectural Models",
    "abstract": "Three-dimensional immersive sketching for content creation and modeling has been studied for some time. However, research in this domain mainly focused on CAVE-like scenarios. These setups can be expensive and offer a narrow interaction space. Building more affordable setups using head-mounted displays is possible, allowing greater immersion and a larger space for user physical movements. This paper presents a fully immersive environment using bi-manual gestures to sketch and create content freely in the virtual world. This approach can be applied to many scenarios, allowing people to express their ideas or review existing designs. To cope with known motor difficulties and inaccuracy of freehand 3D sketching, we explore proxy geometry and a laser-like metaphor to draw content directly from models and create content surfaces. Our current prototype offers 24 cubic meters for movement, limited by the room size. It features infinite virtual drawing space through pan and scale techniques and is larger than the typical 6-sided cave at a fraction of the cost. In a preliminary study conducted with architects and engineers, our system showed a clear promise as a tool for sketching and 3D content creation in virtual reality with a great emphasis on bi-manual gestures.",
    "authors": [
      "Fernando Fonseca",
      "Maurício Sousa",
      "Daniel Mendes",
      "Alfredo Ferreira",
      "Joaquim Jorge"
    ],
    "url": "http://arxiv.org/abs/2405.18887v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.HC",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "bb0cb5f3-bc13-42f5-9083-8d34f83d0e1c": {
    "pk": "bb0cb5f3-bc13-42f5-9083-8d34f83d0e1c",
    "title": "Continuous Product Graph Neural Networks",
    "abstract": "Processing multidomain data defined on multiple graphs holds significant potential in various practical applications in computer science. However, current methods are mostly limited to discrete graph filtering operations. Tensorial partial differential equations on graphs (TPDEGs) provide a principled framework for modeling structured data across multiple interacting graphs, addressing the limitations of the existing discrete methodologies. In this paper, we introduce Continuous Product Graph Neural Networks (CITRUS) that emerge as a natural solution to the TPDEG. CITRUS leverages the separability of continuous heat kernels from Cartesian graph products to efficiently implement graph spectral decomposition. We conduct thorough theoretical analyses of the stability and over-smoothing properties of CITRUS in response to domain-specific graph perturbations and graph spectra effects on the performance. We evaluate CITRUS on well-known traffic and weather spatiotemporal forecasting datasets, demonstrating superior performance over existing approaches.",
    "authors": [
      "Aref Einizade",
      "Fragkiskos D. Malliaros",
      "Jhony H. Giraldo"
    ],
    "url": "http://arxiv.org/abs/2405.18877v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "cd6a9b54-562e-4cb8-9386-b4d4805ed92e": {
    "pk": "cd6a9b54-562e-4cb8-9386-b4d4805ed92e",
    "title": "On Fairness Concerns in the Blockchain Ecosystem",
    "abstract": "Blockchains revolutionized centralized sectors like banking and finance by promoting decentralization and transparency. In a blockchain, information is transmitted through transactions issued by participants or applications. Miners crucially select, order, and validate pending transactions for block inclusion, prioritizing those with higher incentives or fees. The order in which transactions are included can impact the blockchain final state. Moreover, applications running on top of a blockchain often rely on governance protocols to decentralize the decision-making power to make changes to their core functionality. These changes can affect how participants interact with these applications. Since one token equals one vote, participants holding multiple tokens have a higher voting power to support or reject the proposed changes. The extent to which this voting power is distributed is questionable and if highly concentrated among a few holders can lead to governance attacks. In this thesis, we audit the Bitcoin and Ethereum blockchains to investigate the norms followed by miners in determining the transaction prioritization. We also audit decentralized governance protocols such as Compound to evaluate whether the voting power is fairly distributed among the participants. Our findings have significant implications for future developments of blockchains and decentralized applications.",
    "authors": [
      "Johnnatan Messias Peixoto Afonso"
    ],
    "url": "http://arxiv.org/abs/2405.18876v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CR",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "2506785b-ba8e-4b35-a09d-16a99baf37b3": {
    "pk": "2506785b-ba8e-4b35-a09d-16a99baf37b3",
    "title": "LLMs achieve adult human performance on higher-order theory of mind tasks",
    "abstract": "This paper examines the extent to which large language models (LLMs) have developed higher-order theory of mind (ToM); the human ability to reason about multiple mental and emotional states in a recursive manner (e.g. I think that you believe that she knows). This paper builds on prior work by introducing a handwritten test suite -- Multi-Order Theory of Mind Q&A -- and using it to compare the performance of five LLMs to a newly gathered adult human benchmark. We find that GPT-4 and Flan-PaLM reach adult-level and near adult-level performance on ToM tasks overall, and that GPT-4 exceeds adult performance on 6th order inferences. Our results suggest that there is an interplay between model size and finetuning for the realisation of ToM abilities, and that the best-performing LLMs have developed a generalised capacity for ToM. Given the role that higher-order ToM plays in a wide range of cooperative and competitive human behaviours, these findings have significant implications for user-facing LLM applications.",
    "authors": [
      "Winnie Street",
      "John Oliver Siy",
      "Geoff Keeling",
      "Adrien Baranes",
      "Benjamin Barnett",
      "Michael McKibben",
      "Tatenda Kanyere",
      "Alison Lentz",
      "Blaise Aguera y Arcas",
      "Robin I. M. Dunbar"
    ],
    "url": "http://arxiv.org/abs/2405.18870v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.AI",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "5b962b38-4232-43cd-bb26-234cebe1aa94": {
    "pk": "5b962b38-4232-43cd-bb26-234cebe1aa94",
    "title": "Quantum gravity signatures in gravitational wave detectors placed inside a harmonic trap potential",
    "abstract": "In this work, we consider a general gravitational wave detector of gravitational wave interacting with an incoming gravitational wave carrying plus polarization only placed inside a harmonic trap. This model can be well acquainted with the description of a resonant detector of gravitational wave as well. The well known detector-gravitational wave interaction scenario uses the method of a semi classical approach where the detector is treated quantum mechanically but the gravitational wave is considered at a classical level. In our analysis, we use a discrete mode decomposition of the gravitational wave perturbation which results in a Hamiltonian involving the position and momentum operators corresponding to the gravitational wave and the harmonic oscillator. We have then calculated the transition probability for the harmonic oscillator-gravitational wave tensor product state for going from an initial state to some unknown final state. Using the energy flux relation of the gravitational waves, we observe that if we consider the total energy as a combination of the number of gravitons in the initial state of the detector then the transition probability for the resonant absorption case scenario takes the analytical form which is exactly similar to the semi-classical absorption case. In case of the emission scenario, we observe a spontaneous emission of a single graviton which was completely absent in the semi-classical analoge of this model. This therefore gives a direct signature of linearized quantum gravity.",
    "authors": [
      "Soham Sen",
      "Sunandan Gangopadhyay",
      "Sukanta Bhattacharyya"
    ],
    "url": "http://arxiv.org/abs/2405.18868v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "hep-th",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "b8c7d2d7-ddc0-433d-adc1-4e9b4ff57436": {
    "pk": "b8c7d2d7-ddc0-433d-adc1-4e9b4ff57436",
    "title": "Empowering Embodied Manipulation: A Bimanual-Mobile Robot Manipulation Dataset for Household Tasks",
    "abstract": "As Embodied AI advances, it increasingly enables robots to handle the complexity of household manipulation tasks more effectively. However, the application of robots in these settings remains limited due to the scarcity of bimanual-mobile robot manipulation datasets. Existing datasets either focus solely on simple grasping tasks using single-arm robots without mobility, or collect sensor data limited to a narrow scope of sensory inputs. As a result, these datasets often fail to encapsulate the intricate and dynamic nature of real-world tasks that bimanual-mobile robots are expected to perform. To address these limitations, we introduce BRMData, a Bimanual-mobile Robot Manipulation Dataset designed specifically for household applications. The dataset includes 10 diverse household tasks, ranging from simple single-arm manipulation to more complex dual-arm and mobile manipulations. It is collected using multi-view and depth-sensing data acquisition strategies. Human-robot interactions and multi-object manipulations are integrated into the task designs to closely simulate real-world household applications. Moreover, we present a Manipulation Efficiency Score (MES) metric to evaluate both the precision and efficiency of robot manipulation methods. BRMData aims to drive the development of versatile robot manipulation technologies, specifically focusing on advancing imitation learning methods from human demonstrations. The dataset is now open-sourced and available at https://embodiedrobot.github.io/, enhancing research and development efforts in the field of Embodied Manipulation.",
    "authors": [
      "Tianle Zhang",
      "Dongjiang Li",
      "Yihang Li",
      "Zecui Zeng",
      "Lin Zhao",
      "Lei Sun",
      "Yue Chen",
      "Xuelong Wei",
      "Yibing Zhan",
      "Lusong Li",
      "Xiaodong He"
    ],
    "url": "http://arxiv.org/abs/2405.18860v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.RO",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "fc04e28f-2c70-47e8-ae9b-49d891cab9f2": {
    "pk": "fc04e28f-2c70-47e8-ae9b-49d891cab9f2",
    "title": "Electric Field Control of Molecular Charge State in a Single-Component 2D Organic Nanoarray",
    "abstract": "Quantum dots (QD) with electric-field-controlled charge state are promising for electronics applications, e.g., digital information storage, single-electron transistors and quantum computing. Inorganic QDs consisting of semiconductor nanostructures or heterostructures often offer limited control on size and composition distribution, as well as low potential for scalability and/or nanoscale miniaturization. Owing to their tunability and self-assembly capability, using organic molecules as building nano-units can allow for bottom-up synthesis of two-dimensional (2D) nanoarrays of QDs. However, 2D molecular self-assembly protocols are often applicable on metals surfaces, where electronic hybridization and Fermi level pinning can hinder electric-field control of the QD charge state. Here, we demonstrate the synthesis of a single-component self-assembled 2D array of molecules [9, 10-dicyanoanthracene (DCA)] that exhibit electric-field-controlled spatially periodic charging on a noble metal surface, Ag(111). The charge state of DCA can be altered (between neutral and negative), depending on its adsorption site, by the local electric field induced by a scanning tunneling microscope tip. Limited metal-molecule interactions result in an effective tunneling barrier between DCA and Ag(111) that enables electric-field-induced electron population of the lowest unoccupied molecular orbital (LUMO) and hence charging of the molecule. Subtle site-dependent variation of the molecular adsorption height translates into a significant spatial modulation of the molecular polarizability, dielectric constant and LUMO energy level alignment, giving rise to a spatially dependent effective molecule-surface tunneling barrier and likelihood of charging. This work offers potential for high-density 2D self-assembled nanoarrays of identical QDs whose charge states can be addressed individually with an electric field.",
    "authors": [
      "Dhaneesh Kumar",
      "Cornelius Krull",
      "Yuefeng Yin",
      "Nikhil V. Medhekar",
      "Agustin Schiffrin"
    ],
    "url": "http://arxiv.org/abs/2405.18855v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cond-mat.mtrl-sci",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "60be50e6-4548-4db0-90d4-3bf3822d8129": {
    "pk": "60be50e6-4548-4db0-90d4-3bf3822d8129",
    "title": "On the stationary solution of the Landau-Lifshitz-Gilbert equation on a nanowire with constant external magnetic field",
    "abstract": "We consider an infinite ferromagnetic nanowire, with an energy functional $E$ with easy-axis in the direction $e_1$ and a constant external magnetic field $E_{ext} = h_0 e_1$ along the same direction. The evolution of its magnetization is governed by the Landau-Lifshitz-Gilbert equation (LLG) associated to $E$. Under some assumptions on $h_0$, we prove the existence of stationary solutions with the same limits at infinity, their uniqueness up to the invariances of the equation and the instability of their orbits with respect to the flow. This property gives interesting new insights of the behavior of the solutions of (LLG), which are completed by some numerical simulations and discussed afterwards, in particular regarding the stability of 2-domain wall structures proven in [4] and more generally the interactions between domain walls.",
    "authors": [
      "Guillaume Ferriere"
    ],
    "url": "http://arxiv.org/abs/2405.18829v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "math.AP",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "8fd56f6c-faa1-492e-b0fe-5796da6dc3aa": {
    "pk": "8fd56f6c-faa1-492e-b0fe-5796da6dc3aa",
    "title": "Large Brain Model for Learning Generic Representations with Tremendous EEG Data in BCI",
    "abstract": "The current electroencephalogram (EEG) based deep learning models are typically designed for specific datasets and applications in brain-computer interaction (BCI), limiting the scale of the models and thus diminishing their perceptual capabilities and generalizability. Recently, Large Language Models (LLMs) have achieved unprecedented success in text processing, prompting us to explore the capabilities of Large EEG Models (LEMs). We hope that LEMs can break through the limitations of different task types of EEG datasets, and obtain universal perceptual capabilities of EEG signals through unsupervised pre-training. Then the models can be fine-tuned for different downstream tasks. However, compared to text data, the volume of EEG datasets is generally small and the format varies widely. For example, there can be mismatched numbers of electrodes, unequal length data samples, varied task designs, and low signal-to-noise ratio. To overcome these challenges, we propose a unified foundation model for EEG called Large Brain Model (LaBraM). LaBraM enables cross-dataset learning by segmenting the EEG signals into EEG channel patches. Vector-quantized neural spectrum prediction is used to train a semantically rich neural tokenizer that encodes continuous raw EEG channel patches into compact neural codes. We then pre-train neural Transformers by predicting the original neural codes for the masked EEG channel patches. The LaBraMs were pre-trained on about 2,500 hours of various types of EEG signals from around 20 datasets and validated on multiple different types of downstream tasks. Experiments on abnormal detection, event type classification, emotion recognition, and gait prediction show that our LaBraM outperforms all compared SOTA methods in their respective fields. Our code is available at https://github.com/935963004/LaBraM.",
    "authors": [
      "Wei-Bang Jiang",
      "Li-Ming Zhao",
      "Bao-Liang Lu"
    ],
    "url": "http://arxiv.org/abs/2405.18765v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "e98e4200-7d52-4557-b81b-69058424106e": {
    "pk": "e98e4200-7d52-4557-b81b-69058424106e",
    "title": "FDQN: A Flexible Deep Q-Network Framework for Game Automation",
    "abstract": "In reinforcement learning, it is often difficult to automate high-dimensional, rapid decision-making in dynamic environments, especially when domains require real-time online interaction and adaptive strategies such as web-based games. This work proposes a state-of-the-art Flexible Deep Q-Network (FDQN) framework that can address this challenge with a selfadaptive approach that is processing high-dimensional sensory data in realtime using a CNN and dynamically adapting the model architecture to varying action spaces of different gaming environments and outperforming previous baseline models in various Atari games and the Chrome Dino game as baselines. Using the epsilon-greedy policy, it effectively balances the new learning and exploitation for improved performance, and it has been designed with a modular structure that it can be easily adapted to other HTML-based games without touching the core part of the framework. It is demonstrated that the FDQN framework can successfully solve a well-defined task in a laboratory condition, but more importantly it also discusses potential applications to more challenging real-world cases and serve as the starting point for future further exploration into automated game play and beyond.",
    "authors": [
      "Prabhath Reddy Gujavarthy"
    ],
    "url": "http://arxiv.org/abs/2405.18761v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "c52fc785-6336-4c6a-a16c-2ad81f35491d": {
    "pk": "c52fc785-6336-4c6a-a16c-2ad81f35491d",
    "title": "Ponderomotive electron physics captured in single-fluid extended MHD model",
    "abstract": "The well-known ponderomotive force, arising from the interaction of matter and light, has critical implications across a broad range of fields from laser fusion and astrophysics to laser diagnostics and even pulsed-power experiments. This pseudo-potential pushes electrons, which through coulomb forces causes ion density modulations that can steepen with profound implications. When used intentionally, density modulations can be used for plasma gratings, which are essential for optical components operating in extreme conditions for next generation lasers. They can also be important for plasma confinement and particle trapping, which can even impact magnetic confinement in fusion devices. The ponderomotive potential also leads to laser self-focusing, complicating laser diagnostics. In laser fusion, the force exacerbates challenges posed by stimulated Brillouin scattering (SBS) and crossed beam energy transfer (CBET), both of which destabilize the fusion process. It even plays an astrophysical role in the filamentation of fast radio bursts in the relativistic winds of magnetars. Since the ponderomotive force primarily effects electron dynamics, multi-fluid/particle codes or additional ansatz are required to include its effects. This paper demonstrates that by including electron effects on an ion timescale with a 1-fluid, 2-energy extended magnetohydrodynamics (XMHD) model, ponderomotive effects are also naturally present. We introduce the theory for these dynamics and demonstrate their presence with 1-D pencil-like simulations.",
    "authors": [
      "James R. Young",
      "Pierre-Alexandre Gourdain"
    ],
    "url": "http://arxiv.org/abs/2405.18759v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "physics.plasm-ph",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "7a3a4198-4e4e-44d4-bcea-313a20335d1a": {
    "pk": "7a3a4198-4e4e-44d4-bcea-313a20335d1a",
    "title": "A SARS-CoV-2 Interaction Dataset and VHH Sequence Corpus for Antibody Language Models",
    "abstract": "Antibodies are crucial proteins produced by the immune system to eliminate harmful foreign substances and have become pivotal therapeutic agents for treating human diseases. To accelerate the discovery of antibody therapeutics, there is growing interest in constructing language models using antibody sequences. However, the applicability of pre-trained language models for antibody discovery has not been thoroughly evaluated due to the scarcity of labeled datasets. To overcome these limitations, we introduce AVIDa-SARS-CoV-2, a dataset featuring the antigen-variable domain of heavy chain of heavy chain antibody (VHH) interactions obtained from two alpacas immunized with severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) spike proteins. AVIDa-SARS-CoV-2 includes binary labels indicating the binding or non-binding of diverse VHH sequences to 12 SARS-CoV-2 mutants, such as the Delta and Omicron variants. Furthermore, we release VHHCorpus-2M, a pre-training dataset for antibody language models, containing over two million VHH sequences. We report benchmark results for predicting SARS-CoV-2-VHH binding using VHHBERT pre-trained on VHHCorpus-2M and existing general protein and antibody-specific pre-trained language models. These results confirm that AVIDa-SARS-CoV-2 provides valuable benchmarks for evaluating the representation capabilities of antibody language models for binding prediction, thereby facilitating the development of AI-driven antibody discovery. The datasets are available at https://datasets.cognanous.com.",
    "authors": [
      "Hirofumi Tsuruta",
      "Hiroyuki Yamazaki",
      "Ryota Maeda",
      "Ryotaro Tamura",
      "Akihiro Imura"
    ],
    "url": "http://arxiv.org/abs/2405.18749v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "f7815de4-a36f-4697-a03e-d971e13f9266": {
    "pk": "f7815de4-a36f-4697-a03e-d971e13f9266",
    "title": "Coherent synchrotron radiation instability in low-emittance electron storage rings",
    "abstract": "Longitudinal impedances at high frequencies, which extend far beyond the width of the beam spectrum, can pose a threat to the performance of modern low-emittance electron storage rings, as they can establish a relatively low threshold for microwave instability. In such rings, coherent synchrotron radiation (CSR) emerges as a prominent contributor to these high-frequency impedances. This paper undertakes a systematic investigation into the effects of CSR on electron rings, utilizing Elettra 2.0, a ring of fourth-generation light sources, and the SuperKEKB low-energy ring, a ring of $e^+e^-$ circular colliders, as illustrative examples. Our work revisits theories of microwave instability driven by CSR impedance, extending the analysis to encompass other high-frequency impedances such as resistive wall and coherent wiggler radiation. Through instability analysis and numerical simulations conducted on the two aforementioned rings, the study explored the impact of high-frequency impedances and their interactions with broadband impedances from discontinuities in vacuum chambers.",
    "authors": [
      "Sara Dastan",
      "Demin Zhou",
      "Takuya Ishibashi",
      "Emanuel Karantzoulis",
      "Simone Di Mitri",
      "Ryan Lindberg"
    ],
    "url": "http://arxiv.org/abs/2405.18738v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "physics.acc-ph",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "57500747-b267-4e55-b78b-982da3e43df6": {
    "pk": "57500747-b267-4e55-b78b-982da3e43df6",
    "title": "Development of a Novel Impedance-Controlled Quasi-Direct-Drive Robotic Hand",
    "abstract": "Most robotic hands and grippers rely on actuators with large gearboxes and force sensors for controlling gripping force. However, this might not be ideal for tasks that require the robot to interact with an unstructured and unknown environment. In this paper, we introduce a novel quasi-direct-drive two-fingered robotic hand with variable impedance control in the joint space and Cartesian space. The hand has a total of four degrees of freedom, backdrivable differential gear trains, and four brushless direct current (BLDC) motors. Motor torque is controlled through Field-Oriented Control (FOC) with current sensing. Variable impedance control enables the robotic hand to execute dexterous manipulation tasks safely during environment-robot and human-robot interactions. The quasi-direct-drive actuators eliminate the need for complex tactile/force sensors or precise motion planning when handling environmental contact. A majority-3D-printed assembly makes this a low-cost research platform built with affordable, readily available off-the-shelf components. Experimental validation demonstrates the robotic hand's capability for stable force-closure and form-closure grasps in the presence of disturbances, reliable in-hand manipulation, and safe dynamic manipulations despite contact with the environment.",
    "authors": [
      "Jay Best",
      "Amin Fakhari"
    ],
    "url": "http://arxiv.org/abs/2405.18730v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.RO",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "c7d4a71f-f6f4-4800-aff6-c3b4fae593e1": {
    "pk": "c7d4a71f-f6f4-4800-aff6-c3b4fae593e1",
    "title": "Contextual Position Encoding: Learning to Count What's Important",
    "abstract": "The attention mechanism is a critical component of Large Language Models (LLMs) that allows tokens in a sequence to interact with each other, but is order-invariant. Incorporating position encoding (PE) makes it possible to address by position, such as attending to the i-th token. However, current PE methods use token counts to derive position, and thus cannot generalize to higher levels of abstraction, such as attending to the i-th sentence. In this paper, we propose a new position encoding method, Contextual Position Encoding (CoPE), that allows positions to be conditioned on context by incrementing position only on certain tokens determined by the model. This allows more general position addressing such as attending to the $i$-th particular word, noun, or sentence. We show that CoPE can solve the selective copy, counting and Flip-Flop tasks where popular position embeddings fail, and improves perplexity on language modeling and coding tasks.",
    "authors": [
      "Olga Golovneva",
      "Tianlu Wang",
      "Jason Weston",
      "Sainbayar Sukhbaatar"
    ],
    "url": "http://arxiv.org/abs/2405.18719v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CL",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "efcbf4be-04bf-4a48-8aea-84f72f10c8ca": {
    "pk": "efcbf4be-04bf-4a48-8aea-84f72f10c8ca",
    "title": "Towards an exact electronic quantum many-body treatment of Kondo correlation in magnetic impurities",
    "abstract": "The Kondo effect is a prototypical quantum phenomenon arising from the interaction between localized electrons in a magnetic impurity and itinerant electrons in a metallic host. Although it has served as the testing ground for quantum many-body methods for decades, the precise description of Kondo physics with material specificity remains challenging. Here, we present a systematic ab initio approach to converge towards an exact zero-temperature electronic treatment of Kondo correlations. Across a series of 3d transition metals, we extract Kondo temperatures matching the subtle experimental trends, with an accuracy far exceeding that of standard models. We further obtain microscopic insight into the origin of these trends. More broadly, we demonstrate the possibility to start from fully ab initio many-body simulations and push towards the realm of converged predictions.",
    "authors": [
      "Tianyu Zhu",
      "Linqing Peng",
      "Huanchen Zhai",
      "Zhi-Hao Cui",
      "Garnet Kin-Lic Chan"
    ],
    "url": "http://arxiv.org/abs/2405.18709v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cond-mat.str-el",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "70c02556-b8b8-4c9c-b26a-08d3f2d9ef87": {
    "pk": "70c02556-b8b8-4c9c-b26a-08d3f2d9ef87",
    "title": "Cognitive Evolutionary Learning to Select Feature Interactions for Recommender Systems",
    "abstract": "Feature interaction selection is a fundamental problem in commercial recommender systems. Most approaches equally enumerate all features and interactions by the same pre-defined operation under expert guidance. Their recommendation is unsatisfactory sometimes due to the following issues: (1)~They cannot ensure the learning abilities of models because their architectures are poorly adaptable to tasks and data; (2)~Useless features and interactions can bring unnecessary noise and complicate the training process. In this paper, we aim to adaptively evolve the model to select appropriate operations, features, and interactions under task guidance. Inspired by the evolution and functioning of natural organisms, we propose a novel \\textsl{Cognitive EvoLutionary Learning (CELL)} framework, where cognitive ability refers to a property of organisms that allows them to react and survive in diverse environments. It consists of three stages, i.e., DNA search, genome search, and model functioning. Specifically, if we regard the relationship between models and tasks as the relationship between organisms and natural environments, interactions of feature pairs can be analogous to double-stranded DNA, of which relevant features and interactions can be analogous to genomes. Along this line, we diagnose the fitness of the model on operations, features, and interactions to simulate the survival rates of organisms for natural selection. We show that CELL can adaptively evolve into different models for different tasks and data, which enables practitioners to access off-the-shelf models. Extensive experiments on four real-world datasets demonstrate that CELL significantly outperforms state-of-the-art baselines. Also, we conduct synthetic experiments to ascertain that CELL can consistently discover the pre-defined interaction patterns for feature pairs.",
    "authors": [
      "Runlong Yu",
      "Qixiang Shao",
      "Qi Liu",
      "Huan Liu",
      "Enhong Chen"
    ],
    "url": "http://arxiv.org/abs/2405.18708v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.AI",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "749b0343-161f-4dc2-ba42-5540509573be": {
    "pk": "749b0343-161f-4dc2-ba42-5540509573be",
    "title": "FocSAM: Delving Deeply into Focused Objects in Segmenting Anything",
    "abstract": "The Segment Anything Model (SAM) marks a notable milestone in segmentation models, highlighted by its robust zero-shot capabilities and ability to handle diverse prompts. SAM follows a pipeline that separates interactive segmentation into image preprocessing through a large encoder and interactive inference via a lightweight decoder, ensuring efficient real-time performance. However, SAM faces stability issues in challenging samples upon this pipeline. These issues arise from two main factors. Firstly, the image preprocessing disables SAM from dynamically using image-level zoom-in strategies to refocus on the target object during interaction. Secondly, the lightweight decoder struggles to sufficiently integrate interactive information with image embeddings. To address these two limitations, we propose FocSAM with a pipeline redesigned on two pivotal aspects. First, we propose Dynamic Window Multi-head Self-Attention (Dwin-MSA) to dynamically refocus SAM's image embeddings on the target object. Dwin-MSA localizes attention computations around the target object, enhancing object-related embeddings with minimal computational overhead. Second, we propose Pixel-wise Dynamic ReLU (P-DyReLU) to enable sufficient integration of interactive information from a few initial clicks that have significant impacts on the overall segmentation results. Experimentally, FocSAM augments SAM's interactive segmentation performance to match the existing state-of-the-art method in segmentation quality, requiring only about 5.6% of this method's inference time on CPUs.",
    "authors": [
      "You Huang",
      "Zongyu Lan",
      "Liujuan Cao",
      "Xianming Lin",
      "Shengchuan Zhang",
      "Guannan Jiang",
      "Rongrong Ji"
    ],
    "url": "http://arxiv.org/abs/2405.18706v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "4e01993b-11de-4c05-8e67-2ff78de763f1": {
    "pk": "4e01993b-11de-4c05-8e67-2ff78de763f1",
    "title": "Bridging the Gap between Partially Observable Stochastic Games and Sparse POMDP Methods",
    "abstract": "Many real-world decision problems involve interaction of multiple self-interested agents with limited sensing ability. The partially observable stochastic game (POSG) provides a mathematical framework for posing these problems, however solving a POSG requires difficult reasoning about two critical factors: (1) information revealed by partial observations and (2) decisions other agents make. In the single agent case, partially observable Markov decision process (POMDP) planning can efficiently address partial observability with particle filtering. In the multi-agent case, imperfect information game solution methods account for other agent's decisions, but preclude belief approximation. We propose a unifying framework that combines POMDP-inspired state distribution approximation and game-theoretic equilibrium search on information sets. This approach enables online planning in POSGs with very large state spaces, paving the way for reliable autonomous interaction in real-world physical environments and complementing offline multi-agent reinforcement learning. Experiments in several zero-sum examples show that the new framework computes solutions for problems with both small and large state spaces.",
    "authors": [
      "Tyler Becker",
      "Zachary Sunberg"
    ],
    "url": "http://arxiv.org/abs/2405.18703v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.GT",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "5ae9d801-41bd-48b2-b0a8-1219c3c187a6": {
    "pk": "5ae9d801-41bd-48b2-b0a8-1219c3c187a6",
    "title": "Locating Quark-Antiquark String Breaking in QCD through Chiral Symmetry Restoration and Hawking-Unruh Effect",
    "abstract": "The relationship between QCD and the string model offers a valuable perspective for exploring the interaction potential between quarks. In this study, we investigate the restoration of chiral symmetry in connection with the Unruh effect experienced by accelerating observers. Utilizing the Schwinger model, we analyze the critical point at which the string or chromoelectric flux tube between quark-antiquarks breaks with increasing separation between quarks. In this study, the critical distance for quark-antiquark chromoelectric flux tube or string breaking is determined to be $r_c=1.294\\pm0.040$ fm. The acceleration and Unruh temperature corresponding to this critical point signify the transition of the system's chiral symmetry from a broken to a restored state. Our estimates for the critical acceleration ($a_c=1.14\\times 10^{34}$ cm/s$^{2}$) and Unruh temperature ($T_c=0.038$ GeV) align with previous studies. This analysis illuminates the interplay between chiral symmetry restoration, the Unruh effect, and the breaking of the string or chromoelectric flux tube within the context of quark interactions.",
    "authors": [
      "Wei Kou",
      "Xurong Chen"
    ],
    "url": "http://arxiv.org/abs/2405.18697v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "hep-ph",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "91b6bbeb-b03c-4efc-bf50-e52282c3b23c": {
    "pk": "91b6bbeb-b03c-4efc-bf50-e52282c3b23c",
    "title": "Advancing Household Robotics: Deep Interactive Reinforcement Learning for Efficient Training and Enhanced Performance",
    "abstract": "The market for domestic robots made to perform household chores is growing as these robots relieve people of everyday responsibilities. Domestic robots are generally welcomed for their role in easing human labor, in contrast to industrial robots, which are frequently criticized for displacing human workers. But before these robots can carry out domestic chores, they need to become proficient in several minor activities, such as recognizing their surroundings, making decisions, and picking up on human behaviors. Reinforcement learning, or RL, has emerged as a key robotics technology that enables robots to interact with their environment and learn how to optimize their actions to maximize rewards. However, the goal of Deep Reinforcement Learning is to address more complicated, continuous action-state spaces in real-world settings by combining RL with Neural Networks. The efficacy of DeepRL can be further augmented through interactive feedback, in which a trainer offers real-time guidance to expedite the robot's learning process. Nevertheless, the current methods have drawbacks, namely the transient application of guidance that results in repeated learning under identical conditions. Therefore, we present a novel method to preserve and reuse information and advice via Deep Interactive Reinforcement Learning, which utilizes a persistent rule-based system. This method not only expedites the training process but also lessens the number of repetitions that instructors will have to carry out. This study has the potential to advance the development of household robots and improve their effectiveness and efficiency as learners.",
    "authors": [
      "Arpita Soni",
      "Sujatha Alla",
      "Suresh Dodda",
      "Hemanth Volikatla"
    ],
    "url": "http://arxiv.org/abs/2405.18687v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.RO",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "ba1c1187-0595-4c80-aafe-40d8c9265974": {
    "pk": "ba1c1187-0595-4c80-aafe-40d8c9265974",
    "title": "Low-Mass Galaxy Interactions Trigger Black Hole Activity",
    "abstract": "The existence of high-$z$ over-massive supermassive black holes represents a major conundrum in our understanding of black hole evolution. In this paper, we probe from the observational point of view how early Universe environmental conditions could have acted as an evolutionary mechanism for the accelerated growth of the first black holes. Under the assumption that the early Universe is dominated by dwarf galaxies, we investigate the hypothesis that dwarf-dwarf galaxy interactions trigger black hole accretion. We present the discovery of 82 dwarf-dwarf galaxy pairs and 11 dwarf galaxy groups using the Hubble Space Telescope, doubling existing samples. The dwarf systems span a redshift range of 0.13$<$z$<$1.5, and a stellar mass range of 7.24$<$log(M$_*$/\\(M_\\odot\\))$<$9.73. We performed an X-ray study of a subset of these dwarf systems with Chandra and detected six new AGN, increasing the number of known dwarf-dwarf-merger-related AGN from one to seven. We then compared the frequency of these AGN in grouped/paired dwarfs to that of isolated dwarfs and found a statistically significant enhancement (4$\\sigma$-6$\\sigma$) in the interacting sample. This study, the first of its kind at the lowest mass scales, implies that the presence of a nearby dwarf neighbor is efficient in triggering black hole accretion. These results open new avenues for indirect studies of the emergence of the first supermassive black holes.",
    "authors": [
      "Marko Mićić",
      "Jimmy A. Irwin",
      "Preethi Nair",
      "Brenna N. Wells",
      "Olivia J. Holmes",
      "Jackson T. Eames"
    ],
    "url": "http://arxiv.org/abs/2405.18685v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "astro-ph.GA",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "03db0640-210d-4669-9535-e00d5b666d50": {
    "pk": "03db0640-210d-4669-9535-e00d5b666d50",
    "title": "DFT+U+V Study of Magnetic Ordering in Single-Layer Pentahexoctite: Implications for Magnetic Device Platforms",
    "abstract": "In this work, we investigate the electronic and magnetic properties of single-layer pentahexoctite, a two-dimensional carbon allotrope patterned by pentagons, hexagons, and octagons. Using density functional theory (DFT) calculations incorporating on-site and intersite Coulomb interactions, we find that type-II Dirac Fermions are formed by a nearly flat band intersecting with a dispersive band at the Fermi level. We further examine the physical origin of nearly flat bands of pentahexoctite. Constructing ab initio tight-binding Hamiltonian based on Wannier functions, we reveal that nearly flat bands of pentahexoctite originate from quantum-mechanical destructive interference. Remarkably, our DFT calculations including extended Hubbard interactions show that hole doping induces a ferrimagnetic phase transition driven by the enhanced density of states in the nearly flat band. This finding highlights that monolayer pentahexoctite is a promising candidate for pristine all-carbon magnetic materials to serve as a platform for future magnetic and spintronic devices.",
    "authors": [
      "Sejoong Kim"
    ],
    "url": "http://arxiv.org/abs/2405.18683v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cond-mat.mes-hall",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "68bc81c7-3a49-418f-9210-b0d187078dc8": {
    "pk": "68bc81c7-3a49-418f-9210-b0d187078dc8",
    "title": "Non-Driving-Related Tasks Influencing Drivers' Takeover Time: A Meta-Analysis",
    "abstract": "Before the era of fully automated vehicles, human is consistently an indispensable part of the driving system. Various studies have investigated drivers' cooperation with the vehicle under different conditions. In this article, we analyzed how non-driving-related tasks (NDRT) influence takeover time (TOT) by conducting a meta-analysis on 37 related papers. NDRTs were transcoded into combinations of five basic dimensions to unify and demonstrate their effects on drivers. In order to interpret experimental data comprehensively, we implemented three methods. A synthetical analysis was conducted to compare the effect size between each study and subgroup. Studies with eligible control groups have been examined by the two-group analysis, followed by moderator analysis on seven variables. The results from the two-group analysis showed that both visual-mental-motoric and visual-mental tasks have significant negative effects on the takeover time and the previous type had a larger effect than the latter one. Moreover, the subgroup comparison and meta-regression in the meta-analysis part revealed the correlation between moderators and the effect size, in which the Driving Experience and the Automation Level affected the relation between NDRT and TOT. The findings of this paper can contribute to the improvement and new directions for further scientific research and engineering design.",
    "authors": [
      "Yan Zhang"
    ],
    "url": "http://arxiv.org/abs/2405.18667v1",
    "timestamp": 1716912000,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.HC",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "2e246c7f-e1f1-4a2e-b599-a921335dfe7f": {
    "pk": "2e246c7f-e1f1-4a2e-b599-a921335dfe7f",
    "title": "Stairway to discovery: a report on the CMS programme of cross section measurements from millibarns to femtobarns",
    "abstract": "The Large Hadron Collider at CERN, delivering proton-proton collisions at much higher energies and far higher luminosities than previous machines, has enabled a comprehensive programme of measurements of the standard model (SM) processes by the CMS experiment. These unprecedented capabilities facilitate precise measurements of the properties of a wide array of processes, the most fundamental being cross sections. The discovery of the Higgs boson and the measurement of its mass became the keystone of the SM. Knowledge of the mass of the Higgs boson allows precision comparisons of the predictions of the SM with the corresponding measurements. These measurements span the range from one of the most copious SM processes, the total inelastic cross section for proton-proton interactions, to the rarest ones, such as Higgs boson pair production. They cover the production of Higgs bosons, top quarks, single and multibosons, and hadronic jets. Associated parameters, such as coupling constants, are also measured. These cross section measurements can be pictured as a descending stairway, on which the lowest steps represent the rarest processes allowed by the SM, some never seen before.",
    "authors": [
      "CMS Collaboration"
    ],
    "url": "http://arxiv.org/abs/2405.18661v1",
    "timestamp": 1716825600,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "hep-ex",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "2194d45b-15ee-4b3b-a6df-3a707e4c839c": {
    "pk": "2194d45b-15ee-4b3b-a6df-3a707e4c839c",
    "title": "Weak (non)conservation and stochastic dynamics of angular momentum",
    "abstract": "Angular momentum conservation influences equilibrium statistical mechanics, leading to a generalized microcanonical density for an isolated system and a generalized Gibbs density for a weakly coupled system. We study the stochastic decay of angular momentum due to weakly imperfect rotational symmetry of the external potential that confines the isolated many-particle system. We present a mesoscopic description of the system, deriving Langevin and Fokker-Planck equations, which are consistent with equilibrium statistical mechanics when rotational symmetry is maintained. When the symmetry is weakly violated, we formulate a coarse-grained stochastic differential equation governing the decay of total angular momentum over time. To validate our analytical predictions, we conduct numerical simulations of the microcanonical ensemble, an isolated system undergoing thermalization due to weak two-body interactions. Our coarse-grained Langevin equation accurately characterizes both the decay of the angular momentum and its fluctuations in a steady state. Furthermore, we estimate the parameters of our mesoscopic model directly from simulations, providing insights into the dissipative phenomenological coefficients, such as friction. More generally, this study contributes to a deeper understanding of the behavior of the integrals of motion when the corresponding symmetry is weakly violated.",
    "authors": [
      "Ashot Matevosyan"
    ],
    "url": "http://arxiv.org/abs/2405.18660v1",
    "timestamp": 1716825600,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cond-mat.stat-mech",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "c4777b5f-a23b-4caa-8fa9-5ed089c54bb2": {
    "pk": "c4777b5f-a23b-4caa-8fa9-5ed089c54bb2",
    "title": "A Dynamical Systems Approach to Bots and Online Political Communication",
    "abstract": "Bots have become increasingly prevalent in the digital sphere and have taken up a proactive role in shaping democratic processes. While previous studies have focused on their influence at the individual level, their potential macro-level impact on communication dynamics is still little understood. This study adopts an information theoretic approach from dynamical systems theory to examine the role of political bots shaping the dynamics of an online political discussion on Twitter. We quantify the components of this dynamic process in terms of its complexity, predictability, and the remaining uncertainty. Our findings suggest that bot activity is associated with increased complexity and uncertainty in the structural dynamics of online political communication. This work serves as a showcase for the use of information-theoretic measures from dynamical systems theory in modeling human-bot dynamics as a computational process that unfolds over time.",
    "authors": [
      "Beril Bulat",
      "Martin Hilbert"
    ],
    "url": "http://arxiv.org/abs/2405.18652v1",
    "timestamp": 1716825600,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CY",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "b6bee222-1d3a-444c-ade5-5346500aa304": {
    "pk": "b6bee222-1d3a-444c-ade5-5346500aa304",
    "title": "Approximating Human Models During Argumentation-based Dialogues",
    "abstract": "Explainable AI Planning (XAIP) aims to develop AI agents that can effectively explain their decisions and actions to human users, fostering trust and facilitating human-AI collaboration. A key challenge in XAIP is model reconciliation, which seeks to align the mental models of AI agents and humans. While existing approaches often assume a known and deterministic human model, this simplification may not capture the complexities and uncertainties of real-world interactions. In this paper, we propose a novel framework that enables AI agents to learn and update a probabilistic human model through argumentation-based dialogues. Our approach incorporates trust-based and certainty-based update mechanisms, allowing the agent to refine its understanding of the human's mental state based on the human's expressed trust in the agent's arguments and certainty in their own arguments. We employ a probability weighting function inspired by prospect theory to capture the relationship between trust and perceived probability, and use a Bayesian approach to update the agent's probability distribution over possible human models. We conduct a human-subject study to empirically evaluate the effectiveness of our approach in an argumentation scenario, demonstrating its ability to capture the dynamics of human belief formation and adaptation.",
    "authors": [
      "Yinxu Tang",
      "Stylianos Loukas Vasileiou",
      "William Yeoh"
    ],
    "url": "http://arxiv.org/abs/2405.18650v1",
    "timestamp": 1716825600,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.AI",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "0f4fc407-c562-45c0-9b10-9b752967bcbd": {
    "pk": "0f4fc407-c562-45c0-9b10-9b752967bcbd",
    "title": "Chiral magnon-polaron edge states in Heisenberg-Kitaev magnets",
    "abstract": "The interplay of spin and lattice fluctuations in two-dimensional magnets without inversion symmetry is investigated. We find a general form for the magnetoelastic coupling between magnons and existing chiral phonons based on the symmetries of the crystalline lattice. We show that in hexagonal lattices, the coupling of magnons and chiral phonons derives from an anisotropic exchange spin model containing topological phases of magnons. Using the Heisenberg-Kitaev-$\\Gamma$ model, we show how magnon-polaron edge states with circular polarization arise from this interaction. Our findings exploit the polarization degrees of freedom in spin-lattice systems, thus setting the ground for the transfer of angular momentum between chiral phonons and magnons.",
    "authors": [
      "Jose D. Mella",
      "L. E. F. Foa Torres",
      "Roberto E. Troncoso"
    ],
    "url": "http://arxiv.org/abs/2405.18644v1",
    "timestamp": 1716825600,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cond-mat.mes-hall",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "e6549b6b-f59c-44a6-a9be-4ab403e36058": {
    "pk": "e6549b6b-f59c-44a6-a9be-4ab403e36058",
    "title": "Structure and magnetic properties of (Fe2O3)n clusters (n = 1-5)",
    "abstract": "Global minimum structures of neutral (Fe2O3)n clusters with n = 1-5 were determined employing the genetic algorithm in combination with ab initio parameterized interatomic potentials and subsequent refinement at the density functional theory level. Systematic investigations of magnetic configurations of the clusters using a broken symmetry approach reveal antiferromagnetic and ferrimagnetic ground states. Whereas (Fe2O3)n clusters with n = 2-5 contain exclusively Fe3+, Fe2O3 was found to be a special case formally containing both Fe2+ and Fe3+. Calculated magnetic coupling constants revealed predominantly strong antiferromagnetic interactions, which exceed bulk values found in hematite. The precise magnetization (spin) state of the clusters has only small influence on their geometric structure. Starting from n = 4 also the relative energies of different cluster isomers are only weakly influenced by their magnetic configuration. These findings are important for simulations of larger (Fe2O3)n clusters and nanoparticles.",
    "authors": [
      "Andreas Erlebach",
      "Carolin Hühn",
      "Richard Jana",
      "Marek Sierka"
    ],
    "url": "http://arxiv.org/abs/2405.18629v1",
    "timestamp": 1716825600,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cond-mat.mtrl-sci",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "71045d61-ac4b-44ca-8e36-30b06281e524": {
    "pk": "71045d61-ac4b-44ca-8e36-30b06281e524",
    "title": "Causal Contextual Bandits with Adaptive Context",
    "abstract": "We study a variant of causal contextual bandits where the context is chosen based on an initial intervention chosen by the learner. At the beginning of each round, the learner selects an initial action, depending on which a stochastic context is revealed by the environment. Following this, the learner then selects a final action and receives a reward. Given $T$ rounds of interactions with the environment, the objective of the learner is to learn a policy (of selecting the initial and the final action) with maximum expected reward. In this paper we study the specific situation where every action corresponds to intervening on a node in some known causal graph. We extend prior work from the deterministic context setting to obtain simple regret minimization guarantees. This is achieved through an instance-dependent causal parameter, $\\lambda$, which characterizes our upper bound. Furthermore, we prove that our simple regret is essentially tight for a large class of instances. A key feature of our work is that we use convex optimization to address the bandit exploration problem. We also conduct experiments to validate our theoretical results, and release our code at our project GitHub repository: https://github.com/adaptiveContextualCausalBandits/aCCB.",
    "authors": [
      "Rahul Madhavan",
      "Aurghya Maiti",
      "Gaurav Sinha",
      "Siddharth Barman"
    ],
    "url": "http://arxiv.org/abs/2405.18626v1",
    "timestamp": 1716825600,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "555334ad-ae5d-4127-a64a-ddb76dad6ee0": {
    "pk": "555334ad-ae5d-4127-a64a-ddb76dad6ee0",
    "title": "I See You: Teacher Analytics with GPT-4 Vision-Powered Observational Assessment",
    "abstract": "This preliminary study explores the integration of GPT-4 Vision (GPT-4V) technology into teacher analytics, focusing on its applicability in observational assessment to enhance reflective teaching practice. This research is grounded in developing a Video-based Automatic Assessment System (VidAAS) empowered by GPT-4V. Our approach aims to revolutionize teachers' assessment of students' practices by leveraging Generative Artificial Intelligence (GenAI) to offer detailed insights into classroom dynamics. Our research methodology encompasses a comprehensive literature review, prototype development of the VidAAS, and usability testing with in-service teachers. The study findings provide future research avenues for VidAAS design, implementation, and integration in teacher analytics, underscoring the potential of GPT-4V to provide real-time, scalable feedback and a deeper understanding of the classroom.",
    "authors": [
      "Unggi Lee",
      "Yeil Jeong",
      "Junbo Koh",
      "Gyuri Byun",
      "Yunseo Lee",
      "Hyunwoong Lee",
      "Seunmin Eun",
      "Jewoong Moon",
      "Cheolil Lim",
      "Hyeoncheol Kim"
    ],
    "url": "http://arxiv.org/abs/2405.18623v1",
    "timestamp": 1716825600,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.HC",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "78af91bc-45d7-4b4f-bf4d-fec91d73a2e5": {
    "pk": "78af91bc-45d7-4b4f-bf4d-fec91d73a2e5",
    "title": "RealitySummary: On-Demand Mixed Reality Document Enhancement using Large Language Models",
    "abstract": "We introduce RealitySummary, a mixed reality reading assistant that can enhance any printed or digital document using on-demand text extraction, summarization, and augmentation. While augmented reading tools promise to enhance physical reading experiences with overlaid digital content, prior systems have typically required pre-processed documents, which limits their generalizability and real-world use cases. In this paper, we explore on-demand document augmentation by leveraging large language models. To understand generalizable techniques for diverse documents, we first conducted an exploratory design study which identified five categories of document enhancements (summarization, augmentation, navigation, comparison, and extraction). Based on this, we developed a proof-of-concept system that can automatically extract and summarize text using Google Cloud OCR and GPT-4, then embed information around documents using a Microsoft Hololens 2 and Apple Vision Pro. We demonstrate real-time examples of six specific document augmentations: 1) summaries, 2) comparison tables, 3) timelines, 4) keyword lists, 5) summary highlighting, and 6) information cards. Results from a usability study (N=12) and in-the-wild study (N=11) highlight the potential benefits of on-demand MR document enhancement and opportunities for future research.",
    "authors": [
      "Aditya Gunturu",
      "Shivesh Jadon",
      "Nandi Zhang",
      "Jarin Thundathil",
      "Wesley Willett",
      "Ryo Suzuki"
    ],
    "url": "http://arxiv.org/abs/2405.18620v1",
    "timestamp": 1716825600,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.HC",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "36b495f6-5f1b-4812-984a-a4e1ddd37fa0": {
    "pk": "36b495f6-5f1b-4812-984a-a4e1ddd37fa0",
    "title": "Augmented Physics: A Machine Learning-Powered Tool for Creating Interactive Physics Simulations from Static Diagrams",
    "abstract": "We introduce Augmented Physics, a machine learning-powered tool designed for creating interactive physics simulations from static textbook diagrams. Leveraging computer vision techniques, such as Segment Anything and OpenCV, our web-based system enables users to semi-automatically extract diagrams from physics textbooks and then generate interactive simulations based on the extracted content. These interactive diagrams are seamlessly integrated into scanned textbook pages, facilitating interactive and personalized learning experiences across various physics concepts, including gravity, optics, circuits, and kinematics. Drawing on an elicitation study with seven physics instructors, we explore four key augmentation techniques: 1) augmented experiments, 2) animated diagrams, 3) bi-directional manipulatives, and 4) parameter visualization. We evaluate our system through technical evaluation, a usability study (N=12), and expert interviews (N=12). The study findings suggest that our system can facilitate more engaging and personalized learning experiences in physics education.",
    "authors": [
      "Aditya Gunturu",
      "Yi Wen",
      "Jarin Thundathil",
      "Nandi Zhang",
      "Rubaiat Habib Kazi",
      "Ryo Suzuki"
    ],
    "url": "http://arxiv.org/abs/2405.18614v1",
    "timestamp": 1716825600,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.HC",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "1de03639-17a2-4050-a00f-462ba6f6c7c6": {
    "pk": "1de03639-17a2-4050-a00f-462ba6f6c7c6",
    "title": "Optimización del sistema de iluminación y proyección para un sensor multiparamétrico acusto-óptico",
    "abstract": "In previous works we presented a novel multiparametric sensor to simultaneously measure the refractive index and the speed of sound in a liquid by means of the acousto-optic effect. The sensor requires an illumination system that expands the laser beam so that it interacts effectively with the liquid under study. Also, a projection system is necessary in order to adequately capture the diffraction pattern at the cell exit. In this article, we present the optimization of the sensor illumination and projection system using the optical design computational tool Zemax OpticStudio. The considered range of refractive indices of the liquid samples is between 1.33 and 1.51. The results show a correct expansion of the incident beam on the cell, and the projection system achieves an image with very few aberrations and an adequate angular separation between the maxima of the diffraction pattern. From the resulting dimensions of the sensor after the illumination and projection system optimization, we affirm that it is compact and portable.",
    "authors": [
      "Patricia María Elena Vázquez",
      "Germán Eduardo Caro"
    ],
    "url": "http://arxiv.org/abs/2405.18607v1",
    "timestamp": 1716825600,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "physics.optics",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "5785372e-bdae-43c7-947b-f98da271392a": {
    "pk": "5785372e-bdae-43c7-947b-f98da271392a",
    "title": "BioBERT-based Deep Learning and Merged ChemProt-DrugProt for Enhanced Biomedical Relation Extraction",
    "abstract": "This paper presents a methodology for enhancing relation extraction from biomedical texts, focusing specifically on chemical-gene interactions. Leveraging the BioBERT model and a multi-layer fully connected network architecture, our approach integrates the ChemProt and DrugProt datasets using a novel merging strategy. Through extensive experimentation, we demonstrate significant performance improvements, particularly in CPR groups shared between the datasets. The findings underscore the importance of dataset merging in augmenting sample counts and improving model accuracy. Moreover, the study highlights the potential of automated information extraction in biomedical research and clinical practice.",
    "authors": [
      "Bridget T. McInnes",
      "Jiawei Tang",
      "Darshini Mahendran",
      "Mai H. Nguyen"
    ],
    "url": "http://arxiv.org/abs/2405.18605v1",
    "timestamp": 1716825600,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CL",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "cf62ad95-75ff-4f30-a12b-abb215cbd7c8": {
    "pk": "cf62ad95-75ff-4f30-a12b-abb215cbd7c8",
    "title": "A Verifiable Computing Scheme for Encrypted Control Systems",
    "abstract": "The proliferation of cloud computing technologies has paved the way for deploying networked encrypted control systems, offering high performance, remote accessibility and privacy. However, in scenarios where the control algorithms run on third-party cloud service providers, the control logic might be changed by a malicious agent on the cloud. Consequently, it is imperative to verify the correctness of the control signals received from the cloud. Traditional verification methods, like zero-knowledge proof techniques, are computationally demanding in both proof generation and verification, may require several rounds of interactions between the prover and verifier and, consequently, are inapplicable in realtime control system applications. In this paper, we present a novel computationally inexpensive verifiable computing solution inspired by the probabilistic cut-and-choose approach. The proposed scheme allows the plant's actuator to validate the computations accomplished by the encrypted cloud-based networked controller without compromising the control scheme's performance. We showcase the effectiveness and real-time applicability of the proposed verifiable computation scheme using a remotely controlled Khepera IV differential-drive robot.",
    "authors": [
      "Francesca Stabile",
      "Walter Lucia",
      "Amr Youssef",
      "Giuseppe Franze"
    ],
    "url": "http://arxiv.org/abs/2405.18586v1",
    "timestamp": 1716825600,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "eess.SY",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "2e16a514-db66-4132-bd9d-71c66575e803": {
    "pk": "2e16a514-db66-4132-bd9d-71c66575e803",
    "title": "The DUNE-DAQ Application Framework",
    "abstract": "The Deep Underground Neutrino Experiment (DUNE) is a next-generation neutrino experiment that will probe the properties of these elusive particles with unparalleled precision. It will also act as an observatory for neutrino bursts caused by nearby supernovae, in the event that one occurs while the experiment is in operation. Given these goals, the DUNE trigger and DAQ system must be able to maintain extremely high uptime and provide a path for full readout of the detectors for very long times (up to 100~s). To achieve these ends, we have designed the DUNE DAQ system around a flexible \"application framework\", which provides a modular interface for specific tasks while handling the interconnections between them. The application framework collects modules into applications which can then be interacted with as units by the control, configuration and monitoring systems. One of the key features of the framework is its communications abstraction layer, which allows for modules to interact with both internal queues and external network connections with a single transport-agnostic interface. We will report on the architecture and features of the framework.",
    "authors": [
      "Eric L. Flumerfelt"
    ],
    "url": "http://arxiv.org/abs/2405.18583v1",
    "timestamp": 1716825600,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "physics.ins-det",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "225dff28-4ccd-4876-af00-8c04b9ac4c95": {
    "pk": "225dff28-4ccd-4876-af00-8c04b9ac4c95",
    "title": "Public Technologies Transforming Work of the Public and the Public Sector",
    "abstract": "Technologies adopted by the public sector have transformed the work practices of employees in public agencies by creating different means of communication and decision-making. Although much of the recent research in the future of work domain has concentrated on the effects of technological advancements on public sector employees, the influence on work practices of external stakeholders engaging with this sector remains under-explored. In this paper, we focus on a digital platform called OneStop which is deployed by several building departments across the U.S. and aims to integrate various steps and services into a single point of online contact between public sector employees and the public. Drawing on semi-structured interviews with 22 stakeholders, including local business owners, experts involved in the construction process, community representatives, and building department employees, we investigate how this technology transition has impacted the work of these different stakeholders. We observe a multifaceted perspective and experience caused by the adoption of OneStop. OneStop exacerbated inequitable practices for local business owners due to a lack of face-to-face interactions with the department employees. For the public sector employees, OneStop standardized the work practices, representing the building department's priorities and values. Based on our findings, we discuss tensions around standardization, equality, and equity in technology transition, as well as design implications for equitable practices in the public sector.",
    "authors": [
      "Seyun Kim",
      "Bonnie Fan",
      "Willa Yunqi Yang",
      "Jessie Ramey",
      "Sarah E Fox",
      "Haiyi Zhu",
      "John Zimmerman",
      "Motahhare Eslami"
    ],
    "url": "http://arxiv.org/abs/2405.18579v1",
    "timestamp": 1716825600,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CY",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "0598b6af-fef8-4ec5-b297-a782b0d6b6bb": {
    "pk": "0598b6af-fef8-4ec5-b297-a782b0d6b6bb",
    "title": "Video2MR: Automatically Generating Mixed Reality 3D Instructions by Augmenting Extracted Motion from 2D Videos",
    "abstract": "This paper introduces Video2MR, a mixed reality system that automatically generates 3D sports and exercise instructions from 2D videos. Mixed reality instructions have great potential for physical training, but existing works require substantial time and cost to create these 3D experiences. Video2MR overcomes this limitation by transforming arbitrary instructional videos available online into MR 3D avatars with AI-enabled motion capture (DeepMotion). Then, it automatically enhances the avatar motion through the following augmentation techniques: 1) contrasting and highlighting differences between the user and avatar postures, 2) visualizing key trajectories and movements of specific body parts, 3) manipulation of time and speed using body motion, and 4) spatially repositioning avatars for different perspectives. Developed on Hololens 2 and Azure Kinect, we showcase various use cases, including yoga, dancing, soccer, tennis, and other physical exercises. The study results confirm that Video2MR provides more engaging and playful learning experiences, compared to existing 2D video instructions.",
    "authors": [
      "Keiichi Ihara",
      "Kyzyl Monteiro",
      "Mehrad Faridan",
      "Rubaiat Habib Kazi",
      "Ryo Suzuki"
    ],
    "url": "http://arxiv.org/abs/2405.18565v1",
    "timestamp": 1716825600,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.HC",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "4cf1ed14-bd9b-4465-864d-630407323b1b": {
    "pk": "4cf1ed14-bd9b-4465-864d-630407323b1b",
    "title": "Potential Field Based Deep Metric Learning",
    "abstract": "Deep metric learning (DML) involves training a network to learn a semantically meaningful representation space. Many current approaches mine n-tuples of examples and model interactions within each tuplets. We present a novel, compositional DML model, inspired by electrostatic fields in physics that, instead of in tuples, represents the influence of each example (embedding) by a continuous potential field, and superposes the fields to obtain their combined global potential field. We use attractive/repulsive potential fields to represent interactions among embeddings from images of the same/different classes. Contrary to typical learning methods, where mutual influence of samples is proportional to their distance, we enforce reduction in such influence with distance, leading to a decaying field. We show that such decay helps improve performance on real world datasets with large intra-class variations and label noise. Like other proxy-based methods, we also use proxies to succinctly represent sub-populations of examples. We evaluate our method on three standard DML benchmarks- Cars-196, CUB-200-2011, and SOP datasets where it outperforms state-of-the-art baselines.",
    "authors": [
      "Shubhang Bhatnagar",
      "Narendra Ahuja"
    ],
    "url": "http://arxiv.org/abs/2405.18560v1",
    "timestamp": 1716825600,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "c9ac9873-00ff-4dd4-bab4-08d32635f20f": {
    "pk": "c9ac9873-00ff-4dd4-bab4-08d32635f20f",
    "title": "Multigraph reconstruction via nonlinear random walk",
    "abstract": "Over the last few years, network science has proved to be useful in modeling a variety of complex systems, composed of a large number of interconnected units. The intricate pattern of interactions often allows the system to achieve complex tasks, such as synchronization or collective motions. In this regard, the interplay between network structure and dynamics has long been recognized as a cornerstone of network science. Among dynamical processes, random walks are undoubtedly among the most studied stochastic processes. While traditionally, the random walkers are assumed to be independent, this assumption breaks down if nodes are endowed with a finite carrying capacity, a feature shared by many real-life systems. Recently, a class of nonlinear diffusion processes accounting for the finite carrying capacities of the nodes was introduced. The stationary nodes densities were shown to be nonlinearly correlated with the nodes degrees, allowing to uncover the network structure by performing a few measurements of the stationary density at the level of a single arbitrary node and by solving an inverse problem. In this work, we extend this class of nonlinear diffusion processes to the case of multigraphs, in which links between nodes carry distinct attributes. Assuming the knowledge of the pattern of interactions associated with one type of links, we show how the degree distribution of the whole multigraph can be reconstructed. The effectiveness of the reconstruction algorithm is demonstrated through simulations on various multigraph topologies.",
    "authors": [
      "Jean-François de Kemmeter",
      "Timoteo Carletti"
    ],
    "url": "http://arxiv.org/abs/2405.18555v1",
    "timestamp": 1716825600,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "physics.soc-ph",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "950bf4ca-63d1-40b7-bea9-b1b6706b3b9b": {
    "pk": "950bf4ca-63d1-40b7-bea9-b1b6706b3b9b",
    "title": "Automatic detection of cognitive impairment in elderly people using an entertainment chatbot with Natural Language Processing capabilities",
    "abstract": "Previous researchers have proposed intelligent systems for therapeutic monitoring of cognitive impairments. However, most existing practical approaches for this purpose are based on manual tests. This raises issues such as excessive caretaking effort and the white-coat effect. To avoid these issues, we present an intelligent conversational system for entertaining elderly people with news of their interest that monitors cognitive impairment transparently. Automatic chatbot dialogue stages allow assessing content description skills and detecting cognitive impairment with Machine Learning algorithms. We create these dialogue flows automatically from updated news items using Natural Language Generation techniques. The system also infers the gold standard of the answers to the questions, so it can assess cognitive capabilities automatically by comparing these answers with the user responses. It employs a similarity metric with values in [0, 1], in increasing level of similarity. To evaluate the performance and usability of our approach, we have conducted field tests with a test group of 30 elderly people in the earliest stages of dementia, under the supervision of gerontologists. In the experiments, we have analysed the effect of stress and concentration in these users. Those without cognitive impairment performed up to five times better. In particular, the similarity metric varied between 0.03, for stressed and unfocused participants, and 0.36, for relaxed and focused users. Finally, we developed a Machine Learning algorithm based on textual analysis features for automatic cognitive impairment detection, which attained accuracy, F-measure and recall levels above 80%. We have thus validated the automatic approach to detect cognitive impairment in elderly people based on entertainment content.",
    "authors": [
      "Francisco de Arriba-Pérez",
      "Silvia García-Méndez",
      "Francisco J. González-Castaño",
      "Enrique Costa-Montenegro"
    ],
    "url": "http://arxiv.org/abs/2405.18542v1",
    "timestamp": 1716825600,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.AI",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "71606c8c-5414-4690-9e7d-014eeffa341d": {
    "pk": "71606c8c-5414-4690-9e7d-014eeffa341d",
    "title": "Augmented Conversation with Embedded Speech-Driven On-the-Fly Referencing in AR",
    "abstract": "This paper introduces the concept of augmented conversation, which aims to support co-located in-person conversations via embedded speech-driven on-the-fly referencing in augmented reality (AR). Today computing technologies like smartphones allow quick access to a variety of references during the conversation. However, these tools often create distractions, reducing eye contact and forcing users to focus their attention on phone screens and manually enter keywords to access relevant information. In contrast, AR-based on-the-fly referencing provides relevant visual references in real-time, based on keywords extracted automatically from the spoken conversation. By embedding these visual references in AR around the conversation partner, augmented conversation reduces distraction and friction, allowing users to maintain eye contact and supporting more natural social interactions. To demonstrate this concept, we developed \\system, a Hololens-based interface that leverages real-time speech recognition, natural language processing and gaze-based interactions for on-the-fly embedded visual referencing. In this paper, we explore the design space of visual referencing for conversations, and describe our our implementation -- building on seven design guidelines identified through a user-centered design process. An initial user study confirms that our system decreases distraction and friction in conversations compared to smartphone searches, while providing highly useful and relevant information.",
    "authors": [
      "Shivesh Jadon",
      "Mehrad Faridan",
      "Edward Mah",
      "Rajan Vaish",
      "Wesley Willett",
      "Ryo Suzuki"
    ],
    "url": "http://arxiv.org/abs/2405.18537v1",
    "timestamp": 1716825600,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.HC",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "c5942c48-7e31-4fbf-a5a4-be2542c2cb4b": {
    "pk": "c5942c48-7e31-4fbf-a5a4-be2542c2cb4b",
    "title": "Decoherence of solid-state spin qubits: a computational perspective",
    "abstract": "The usefulness of solid-state spins in quantum technologies depends on how long they can remain in a coherent superposition of quantum states. This Colloquium discusses how first-principles simulations can predict spin dynamics for different types of solid-state electron spins, helping design novel and improved platforms for quantum computing, networking, and sensing.   We begin by outlining the necessary concepts of the noise affecting generic quantum systems. We then focus on recent advances in predicting spin-phonon relaxation of the spin-defect qubits. Next, we discuss cluster methods as a means of simulating quantum decoherence induced by spin-spin interactions, emphasizing the critical role of validation in ensuring the accuracy of these simulations. We highlight how validated cluster methods can be instrumental in interpreting recent experimental results and, more importantly, predicting the coherence properties of novel spin-based quantum platforms, guiding the development of next-generation quantum technologies.",
    "authors": [
      "Mykyta Onizhuk",
      "Giulia Galli"
    ],
    "url": "http://arxiv.org/abs/2405.18535v1",
    "timestamp": 1716825600,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "quant-ph",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "e5da26ec-4f4f-49d1-861f-61fba6bf28da": {
    "pk": "e5da26ec-4f4f-49d1-861f-61fba6bf28da",
    "title": "Automatic Forward Model Parameterization with Bayesian Inference of Conformational Populations",
    "abstract": "To quantify how well theoretical predictions of structural ensembles agree with experimental measurements, we depend on the accuracy of forward models. These models are computational frameworks that generate observable quantities from molecular configurations based on empirical relationships linking specific molecular properties to experimental measurements. Bayesian Inference of Conformational Populations (BICePs) is a reweighting algorithm that reconciles simulated ensembles with ensemble-averaged experimental observations, even when such observations are sparse and/or noisy. This is achieved by sampling the posterior distribution of conformational populations under experimental restraints as well as sampling the posterior distribution of uncertainties due to random and systematic error. In this study, we enhance the algorithm for the refinement of empirical forward model (FM) parameters. We introduce and evaluate two novel methods for optimizing FM parameters. The first method treats FM parameters as nuisance parameters, integrating over them in the full posterior distribution. The second method employs variational minimization of a quantity called the BICePs score that reports the free energy of `turning on` the experimental restraints. This technique, coupled with improved likelihood functions for handling experimental outliers, facilitates force field validation and optimization, as illustrated in recent studies (Raddi et al. 2023, 2024). Using this approach, we refine parameters that modulate the Karplus relation, crucial for accurate predictions of J-coupling constants based on dihedral angles between interacting nuclei. We validate this approach first with a toy model system, and then for human ubiquitin, predicting six sets of Karplus parameters. This approach, which does not rely on predetermined parameters, enhances predictive accuracy and can be used for many applications.",
    "authors": [
      "Robert M. Raddi",
      "Tim Marshall",
      "Vincent A. Voelz"
    ],
    "url": "http://arxiv.org/abs/2405.18532v1",
    "timestamp": 1716825600,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "physics.bio-ph",
    "references": null,
    "citation_count": 0,
    "award": null
  }
}
